class Chakhsiya {
  String itemOne, itemTwo;
  int wihda;
  Chakhsiya({this.itemOne, this.itemTwo, this.wihda});
}

class Mostala7 {
  String itemOne, itemTwo;
  int wihda;
  Mostala7({this.itemOne, this.itemTwo, this.wihda});
}

class Tarikh {
  String itemOne, itemTwo;
  int wihda;
  int wad3iya;
  Tarikh({this.itemOne, this.itemTwo, this.wihda, this.wad3iya});
}

List allData = [
  Chakhsiya(
    itemOne: ' هاري ترومان',
    itemTwo:
        'رئيس الو . م . أ 1945 -  1953 الآن بقنبلة هيروشيما وناغازاكي مؤيد الهجرة اليهودية إلى فلسطين و مفجر الحرب الباردة بإعلانه لسياسة الاحتواء و التي تطورت إلى سياسة ملء الفراغ ',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'ستالين جوزيف',
    itemTwo:
        'رئيس الاتحاد السوفييتي من 1924 - 1953 تميزت فترة حكه الفردية والتشدد في نظر الغرب واجه المخطط الأمريكية بمخططات مضادة منها الكومنفورم وحلف وارسو ',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' جدانوف أندري الكسندروفيتش',
    itemTwo:
        '( 1896 1948 ) سياسي سوفييتي صاحب أطروحة الكتلتين الشرقية الغربية ، ساهم في التشدد الإيديولوجي و صاحب المشروع المعروف باسمه',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' مارشال جورج ',
    itemTwo:
        '( 1880 1959 ) جنرال و وزير أمريكي في عهد روزفلت ما بين 1947 إلى 1949 وضع مشروع دعم أوربا المعروف باسمه منح جائزة نوبل للسلام بعد نهاية الحرب الكورية 1953',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'خروتشوف نيكيتا',
    itemTwo:
        'خلف ستالين سنة 1953 صاحب ، مبادرة التعايش السلمي و أول زعيم سوفييتي يزور الو م أ حدثت في عهده عدة أزمات أخطرها أزمة الصواريخ في كوبا 1962',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' كنيدي ، فيتزجيرالد',
    itemTwo:
        'اصغر رئيس للو . م . أ 1961 1963 وهو صاحب مشروع ابولو الفضائي في عهده وقعت أزمة كوبا 1962 عمل على تحسين أوضاع السلام ما عرضه للقتل',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' رونالد ريغن',
    itemTwo:
        'رئيس الو . م . أمن 1981 1989 و مؤسس التيار المحافظ . انتهج سياسة خارجية متشددة . في 1983 أطلق ماعرف بمبادرة الدفاع الاستراتيجي ضد السوفيات المعروفة بحرب النجوم',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' بريجنيف بوند اليتش',
    itemTwo:
        ' رئيس الاتحاد س خلفا الخروتشون 19 , 1982 معروف بمبدئه ( مبدأ بريجنيف كان وراء العديد من التدخلات العسكرية السوفيتية في الخارج مثل براغ 1968 أفغانستان 1978 .',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'غورباتشوف ميخائيل ',
    itemTwo:
        'أخر رئيس الاتحاد السوفياتي 1985 . 1990 . اشتهر بسياسة البريستوريكا و الغلاسنوست . وقع العديد من الاتفاقيات التي أدت إلى إنهاء الحرب الباردة في 1990 منح جائزة نوبل للسلام ',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'مصالي الحاج ',
    itemTwo:
        ' 1898 - 1974  زعيم التيار الاستقلالي و أول من طالب به رمز للوطوالتحرر في الشمال الإفريقي ، مؤسس نجم شمال افريقيا ثم حزب الشعب ثم حركة الانتصار للحريات الديمقراطية غير أن موقفه كان سلبيا من الثورة ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'فرحات  عباس ',
    itemTwo:
        ' 1899 - 1985  أول رئيس للحكومة المؤقتة 1958 احد قادة التيار الإدماجي شارك في صياغة بيان فيفري 1943 التحق بالثورة سنة 1956 أسس الاتحاد الديمقراطي للبيان الجزائري ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' أحمد بن بلة',
    itemTwo:
        '1918 - 2013  أول رئيس للجزائر المستقلة 1962 - 1965 مناضل في حزب الشعب وحركة أح د ترأس المنظمة الخاصة احد مجري الثورة التحريرية تم اعتقاله في عملية القرصنة الجوية الشهيرة  1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'بن يوسف بن خدة',
    itemTwo:
        '1923 - 2003 رئيس الحكومة المؤقتة الجزائرية من 1961 1962 مناضل في حزب الشعب و حركة احد ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'مصطفى بن بلعيد',
    itemTwo:
        ' 1917 - 1956  مناضل في حزب الشعب و حركة احد عضو لجنة 22 و لجنة 6 قائد الولاية الأولى القي عليه القبض وسجن بقسنطينة أستشهد في 22 مارس 1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' العربي بن مهيدي',
    itemTwo:
        ' 1923 - 1957 قائد الولاية الخامسة - وهران - أشرف على إضراب السبعة أيام بالعاصمة ، ألقي عليه القبض في 23 فيفري 1957 بمدينة الجزائر أستشهد بالسجن تحت التعذيب يوم 03 مارس 1957',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'ديدوش مراد',
    itemTwo:
        ' 1927 - 1956  انخرط في حزب الشعب الجزائري سنة 1943 ساهم في تكوين المنظمة السرية من مفجري الثورة عين قائدا للولاية الثانية ، قاد معركة قرب قرية سمندو  و في ولاية سكيكدة في 18 جانفي 1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' زيغود يوسف',
    itemTwo:
        '1956 - 1921 مناضل بحزب الشعب و عضو المنظمة الخاصة و اللجنة الثورية للوحدة والعمل من مفجري الثورة نظم الهجوم 20 أوت 1955 ثم عين عضوا بالمجلس الوطني للثورة الجزائرية استشهد يوم 25 سبتمبر 1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'محمد بوضياف ',
    itemTwo:
        ' 1919 - 1992 انظم الى صفوف حزب الشعب ثم عضوا في المنظمة السرية، عضو مجموعة 22 اعتقل في حادثة اختطاف الطائرة 22 أكتوبر 1956 إلى غاية وقف إطلاق استدعي لينصب رئيسا 1992 توفي مقتولا سنة 1994',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'كريم بلقاصح ',
    itemTwo:
        '1922 - 1970  مناضل بحزب الشعب منذ 1947 و عضو مجموعة 6 كان احد مفجري الثورة و قاد العمليات في منطقة القبائل',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'رابح بيطاط',
    itemTwo:
        '1925 - 2000  ناضل في صفوف حركة الانتصار للحريات الديمقراطية عضو في اللجنة الثورية اللوحدة والعمل وهو عضو في مجموعة 22 ومجموعة 9 اعتقل سنة 1955 و بعد وقف إطلاق النار أطلق سراحه تولى رئاسة المجلس الشعبي الوطني إلى غاية 1990',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' حسين ايت احمد ',
    itemTwo:
        '1926  انضم إلى صفوف حزب الشعب وعند إنشاء المنظمة الخاصة كان من ابرز عناصرها ��نتقل إلى القاهرة رفقة محمد خيضر 1951 واعتقل في حادثة اختطاف الطائرة ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' محمد خيضر',
    itemTwo:
        '1912 - 1967  انخرط في صفوف نجم شمال أفريقيا ثم حزب الشعب الجزائري لجا إلى القاهرة 1951 وأصبح مندوبا لحركة انتصار الحريات الديمقراطية ثم احد عناصر المنظمة الخاصة وكان من بين المختطفين في حادثة الطائرة 1956 ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'شارل ديغول',
    itemTwo:
        '1890 - 1970  سياسي وجنرال فرنسي مؤسس الجمهورية الفرنسية الخامسة عام 1958 . حاول ضرب الثورة بسياسته التي جمعت بين القمع والإغراء ومحاولة الاختراق وأخيرا وقع اتفاقيات ايفيان مع جبهة التحرير الوطني . مما أنقذ فرنسا . توفي سنة 1970',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' جاك سوستال',
    itemTwo:
        ' 1912  عين واليا عاما على الجزائر سنة 1955 و هو صاحب مشروع سوستال نصب نفسه مدافعا عن الجزائر الفرنسية ، وسياسة الإدماج عينه ديغول سنة 1958 بوزارة الإعلام ثم الوزارة المنتدبة للصحراء',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'المهاتما غاندي ',
    itemTwo:
        '1869 -  1948  داعية وطني وزعيم هندي ناضل ضد الوجود البريطاني و اشتهر باستخدام اسلوب اللاعنف في نضاله . اغتيل من طرف متطرف ، هندوسي عام 1948',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' جواهر لالا نهرو ',
    itemTwo:
        '1889 - 1964 رجل سياسة هندي و تلميذ غاندي من صانعي استقلال الهند شغل منصب الوزير الأول « 19 1967 ) و كان من أبرز أقطاب حركة عدم الانحياز',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'محمد علي جناح',
    itemTwo:
        '1876 - 1948  مناضل تحرري وسياسي باكستاني ناضل لتحرير شبه القارة الهندية من الوجود البريطاني و كان شريكا لغاندي و نهرو و عمل على الانفصال عن الهند في اطار دول باكستان سنة 1947 التي نصب رئيسا لها',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' هوشي منه',
    itemTwo:
        '1890 - 1969  مؤسس الحزب الشيوعي الفيتنامي قاد حربا ضد الوجود الفرنسي من 1946 ثم تزعم الحرب ضد الحكومة العميلة في الفيتنام الجنوبي وضد الولايات المتحدة عام 1960 وانتهت بانتصار الشماليين وانسحاب الو . م . أ وتوحيد البلاد رسميا عام في أفريل 1975',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'جمال عبد الناصر',
    itemTwo:
        ' 1918 - 1970  انظم لتنظيم الضباط الأحرار الذي اطاح بالملك فاروق 1952 أصبح رئيسا للجمهورية عام من أهم انجازاته تأميم قناة السويس و بناء السد العالي في عهد كانت هزيمة حرب 1967 توفي 1970',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' أرنستو شي غيفارا',
    itemTwo:
        '1928 - 1967 طبيب و ثوري ماركسي من أصل أرجنتيني شارك في الثورة الكوبية إلى جانب كاسترو 1956 - 1959 حاول التأسيس لثورة شاملة في أمريكا اللاتينية ضد الهيمنة الأمريكية و الموالين لها  أصبح رمزا عالميا و قتل في بوليفيا سنة 1967',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'فيدل كاسترو ',
    itemTwo:
        '1926 ثائر و سياسي كوبي - قاد الثورة ضد - باتيستا - قوبلت سياسته بالعداء من طرف الولايات المتحدة التي حاولت الإطاحة به - عملية خليج الخنازير 1961 - تقارب مع السوفيت مما أدى إلى وقوع أزمة الصواريخ 1962 . كان صديقا مقربا للجزائر في عهد هواري بومدين ',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' باتريس لومومبا',
    itemTwo:
        ' 1925 - 1961 سياسي كنغولي ناضل من أجل استقلال بلاده عن الاستعمار البلجكي أصبح وزيرا أولا بعد الاستقلال 1960 سعى من أجل استعادة السيادة على إقليم كاتنغا الغني بالثروات الطبيعية ، اغتيل 1961 وتتهم المخابرات الأمريكية بمقتله ',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'ياسر عرفات',
    itemTwo:
        '1929 - 2004  رمز لحركة النضال الفلسطيني و أحد مؤسسي حركة فتح و قائدها العام منذ 1969 اسمة الحققيا محمد عبد الرؤوف عرفات الملقب ابو عمار حاصل على جائزة نوبل للسلام عام 1994 رئيس السلطة الوطنية الفلسطينية المنتخب 1996 توفي في ظروف غامضة في نوفمبر 2004',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الليبرالية',
    itemTwo:
        'مذهب اقتصادي و اجتماعي يرتكز على مبدا الحرية الفردية ويستبد أي تدخل للدولة في الشؤون الاقتصادية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الاشتراكية',
    itemTwo:
        ' نظام شمولي يقوم على هيمنة الدول على مناحي الحياة و مناهض للرأسمالية تبناها الاتحاد السوفييتي بعد نجاح الثورة البلشفية ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الإمبريالية',
    itemTwo:
        ' هيمنة اقتصادية وعسكرية وسياسية لدولة على دولة أخرى وهي صورة أخرى للاستعمار التقليدي',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الشرق',
    itemTwo:
        ' يقصد به الدول التي تقع في شرق أوربا و التي طبقت النظام الاشتراكي أثناء الحرب الباردة .',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الغرب',
    itemTwo:
        ' الدول الديمقراطية الرأسمالية التي تقع غرب أوربا وكذلك الى جانب الو . م . الأمريكية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الحلف الأطلسي',
    itemTwo:
        ' 04 أفريل 1949 :الناتو حلف عسكري يضم الدول الرأسمالية بزعامة الو م أ بهدف مواجهة المعسكر الشيوعي و حركات التحرر مقره ببروكسل ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'حلف وارسو',
    itemTwo:
        'ماي 1955 حلف عسكري تابع للمعسكر الشيوعي بزعامة الاتحاد السوفييتي يهدف إلى مواجهة تحديات الغرب الرأسمالي',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الكريملين',
    itemTwo: ' القلعة الحصينة مقر الرئاسية السوفيتية بالعاصمة موسكو ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' البيت الأبيض',
    itemTwo:
        'هو مقر رئيس الو م أ بواشنطن ويستمد اسمه من اللون الأبيض الذي طليت به جدرانه ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة الاحلاف',
    itemTwo:
        'هي سياسة تقوم على تأسيس تكتلات عسكرية تضم دولا ذات مصالح مشتركة بزعامة إحدى الق��تين منها الناتو - حلف بغداد - وارسو',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة المشاريع',
    itemTwo:
        'تتمثل في سعي كل طرف إلى احتواء واستقطاب اكبر عدد مند الدول في إطار مواجهته للمعسكر الأخر عبر مشاريع سياسية واقتصادية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الأزمات الدولية ',
    itemTwo:
        'هي الفترات التي تميزت فيها علاقات العسكرين باللا استقرار والتوتر الحاد الذي لم يصل لمستوى الحرب الفعلية ومن أبرزها الأزمة كورية و الكوبية ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الحرب الباردة ',
    itemTwo:
        ' هي صراع اديولوجي حضاري و مصلحي عرفه العالم بعد الح ع 2 حتى سنة 1990 بين المعسكرين استعملت فيه مختلف الوسائب باستثناء المواجهة العسكرية المباشرة بين و م أ و اتحاد السوفيتي ، بغية الحصول على مصالح مادية ومعنوية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الدعاية المغرضة',
    itemTwo:
        'من ابرز وسائل الحرب الباردة وتقوم على نشر الأفكار من أجل التأثير باستخدام وسائل الإعلام - الإذاعات الصحف القنوات التليفزيونية الإشهار النشربات السرية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الانفراج',
    itemTwo:
        'هي وصف العلاقات العكرين بعد تسوية أزمة كوبا الخطيرة حيث تم التخلص من الشدة والضيق اللذان وصل إليها ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'التعايش السلمي',
    itemTwo:
        ' مصطلح سياسي يقصد به إبعاد شبح الحرب الساخنة كوسيلة لتسوية الخلافات وحلها بالطرق السلمية مع القبول بازدواجية النظام الدولي ظل التعايش و تبادل المصالح بين 1977 - 1956',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'مشروع مارشال',
    itemTwo:
        'أعلن الوزير الأمريكي جورج مارشال في 5 جوان 1947 ويقضي بتقديم مساعدات مالية لأوربا من أجل إعادة اعمار دمار الحرب ع2 و بشروط ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الستار الحديدي',
    itemTwo:
        'مفهوم استعمله رئيس وزراء بريطانيا ونستون تشرشل لما تحدث عن أطماع الاتحاد السوفيتي التوسعية في أوروبا الشرقية ويمتد من منطقة ستايتن على بحر البلطيق إلى ميناء تريستيا الايطالي',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الصراع الاديولوجي',
    itemTwo:
        'هو صراع فكري حضاري بين الشيوعية و الرأسمالية بحيث يسعى كل طرف لفرض مذهبه و سياسته',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'ملء الفراغ',
    itemTwo:
        'هي سياسة استعمارية تبنتها الولايات المتحلق الأمريكية تقوم على تعويض الدول الاستعمارية بعد ضعفها وانسحابها من مستعمراتها السابقة قابلها الاتحاد السوفيتي بدعم حركات التحررية ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة الاحتواء',
    itemTwo:
        ' سياسة تقوم على إنشاء سلسلة من الأحلاف والقواعد العسكرية لتطويق وعزل الإتحاد السوفييتي ومنع انتشار نفوذه وإيديولوجيته',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' توازن الرعب النووي',
    itemTwo:
        ' توازن عسكري نووي دولي منبثق من امتلاك كل من الوم أ والإتحاد س  قوة عسكرية ضاربة خاصة بعد توصل كل منهما للسلاح النووي ، تستطيع بها تدمير القوة الأخرى ، وكذا نشأت حالة من قوة الردع النووي العسكري المتبادلة ، يتعذر في ظلها على أي من الدولتين أن تحقق نصرا على الأخرى أو أن تتحداها مباشرة خوفا من التدمير المباشر',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة التكتل',
    itemTwo:
        'توجه استراتيجي تمارسه الدول التي لها مصالح وقواسم مشتركة سياسية اقتصادية عسكرية كما فعل القطبان اثناء الحرب الباردة ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'القطبية الثنائية',
    itemTwo: 'القطبية الثنائية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' المجال الحيوي',
    itemTwo:
        'سياسة توسعية تعني ملء المجالات الجغرافية أو استغللها إلا حين . . طبقتها النازية والفاشية وبعد الحرب ع 2 طبقت في شكل سياسة الاحتواء',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' المنظمة العالية للتجارة',
    itemTwo:
        'منظمة دولية أنشئت سنة 1995  خلفا لمنظمة - الغات GATT تعمل على وضع القواعد والقوانين التي تنظم التجارة العالمية 2004 مقرها جنيف بسويسرا ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'النظام الدولي الجديد',
    itemTwo:
        ' مفهوم برز بعد لقاء مالطا 1989 وانهيار المعسكر الشيوعي يقوم على أساس توسيع مفاهيم العولمة و الليبرالية و فرض خطة الهيمنة الأمريكية على العالم',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' المنظمات غير الحكومية ',
    itemTwo:
        'هي منظات خيرية عالمية تعرف بالمجتمع المدني موظفوها متطوعون تنشط في كافة الميادين البيئة ، حقوق الإنسان، الإغاثة ، الرعاية الصحية و الطفولة ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' مبدا جدانوف',
    itemTwo:
        '5 - 10 - 1947 نسبة إلى السياسي السوفيتي جدانوف وهو رد على مشروع مارشال وعلى اساسه تم تأسيس مكتب الإخبار الشيوعي - الكومفورم',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الكومنفورم',
    itemTwo:
        ' مكتب الإخبار الشيوعي هدفه مواجهة المشاريع الأمريكية بجمع المعلومات عنها ولذلك اعتبره الغرب مكتب للتجسس على المصالح الغربية في العالم',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' مشروع إيزنهاور',
    itemTwo:
        '1957  مشروع أمريكي برز بعد أزمة السويس يقضي بتقديم مساعدات مالية لدول الشرق الأوسط مقابل رفض للشيوعية و القبول باسرائيل .',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'البريستوريكا والغلاسنوست',
    itemTwo:
        'كلمتين روسيتين وظفها ميخائيل كورباتشوف الوصف سياسته الساعية إلى إدخال الشفافية والديمقراطية في تسيير أجهزة الدولة السوفيتية و الحزب الشيوعي ، وإعادة ترتيب البيت السوفييتي بشكل يؤمن للفرد السوفياتي حياة أفضل',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الأحادية القطبية ',
    itemTwo:
        ' نظ��م دولي جديد ساد العالم بعد انهيار المعسكر الشيوعي أصبحت فيه قيادة وتوجيه العلاقات الدولية والعالم للوم أ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الشرعية الدولية ',
    itemTwo:
        ' يقصد بها الالتزام و تنفيذ القرارات الصادرة عن الهيئات الدولية كالأمم المتحدة وأجهزتها . ما يخدم مصالح الو م أ و حلفائها',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' النظام الدولي',
    itemTwo:
        'هو مجموعة المبادئ والقيم التي تسير العلاقات الدولية في مختلف المجالات كميثاق ملزم للجميع و بإشراف الهيئات والمنظمات الدولية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'النظام الدولي الجديد',
    itemTwo:
        'مفهوم برز بعد لقاء مالطا 1989 وانهيار المعسكر الشيوعي يقوم على أساس توسيع مفاهيم العولمة و الليبرالية و فرض منطق الهيمنة الأمريكية على العالم ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'التبشير',
    itemTwo:
        ' محاولة الأوروبين نشر المسيحية و الثقافة الغربية في مناطق مختلفة من العالم خاصة في العالم العربي والإسلامي تمهيدا للاستعمار ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الاستعمار',
    itemTwo:
        'هو السيطرة أو بسط النفوذ بوساطة دولة أو جماعة منظمة على مساحة من الأرض و على سكانها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' الاستعمار الجديد',
    itemTwo:
        ' أسلوب السيطرة السياسية و الاقتصاية و الثقافية على دولة أو مجموعة دول مع الاعتراف باستقلالها وسيادتها مبتعدا عن أساليب الاستعمار التقليدية واستخدام وسائل خاصة في تحقيق أغراضه ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' الاستعمار الاستيطاني ',
    itemTwo:
        ' وجود غرباء وسط سكان البلاد الأصليين يشعرون بالنقاء والتفوق و يمارسون إزاء السكان الأصليين شتى أنواع التمييز و ينكرون وجودهم القومي',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'التيار الثوري',
    itemTwo:
        'مجموعة الشباب المتحمس المؤمن بضرورة العمل المسلح و الثورة و هم أفراد المنظمة الخاصة و كل من يؤيد العمل المسلح',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' تصفية الاستعمار',
    itemTwo:
        'الجهود والتضحيات التي قدمتها الشعوب المستعمرة أثناء نضالها وحروبها ضد القوى الاستعمارية لاسترجاع سيادتها و تحقيق الاستقلال و حريتها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الأحزاب الوطنية',
    itemTwo:
        'وهي مجموعة التنظيمات ذات الطابع السياسي التي ظهرت في الجزائر بعد الحرب ع 1 إلى 1954 و المتشكلة في أربعة اتجاهات رئيسية هي دعاة المساواة ودعاة الإدماج، دعاة الاستقلال ،دعاة الإصلاح',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المؤتمر الاسلامي عام 1936',
    itemTwo:
        ' هو أول تجمع وطني جزائري جمع كل التيارات السياسية رغم اختلاف اتجاهاتها عقد بسبب إصدار فرنسا المشروع بلوم فيوليت . بدعوة من عبد الحميد بن باديس و الدكتور بن جلول و فرحات عباس ، و قد تم الاتفاق على تشكيل وفد عن المؤتمر ينتقل إلى باريس لتقديم مطالب الجزائرين إلى حكومة الجبهة الشعبية بباريس',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'سياسة القمع',
    itemTwo:
        ' استعمال فرنسا لاقصى وسائل التنكيل و الإبادة و التهجير والتجهيل لإخضاع و قتل روح المقاومة في الجزائريين كما حدث في سطيف و قالمة وملعب سكيكدة و استخدام الأسلحة المحرمة دوليا',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'تدويل القضية',
    itemTwo:
        'التعريف بالقضية الجزائرية في المحافل الدولية و الدعاية للثورة  لكسب حلفاء لها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الدبلوماسية',
    itemTwo:
        'جهود بذلتها الثورة بإنشاء جهاز دبلوماسي يتحرك بين العواصم و المحافل الدولية لكسب الدعم السياسي مع الثورة الجزائرية',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'مشروع سوستال',
    itemTwo:
        'نسبة إلى صاحبه جاك سوستال الوالي العام للجزائر 1955 وقد تناول جوانب إدارية واقتصادية واجتماعية وثقافية  قصد دمج الجزائريين بفرنسا',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' المكاتب العربية',
    itemTwo:
        'جهاز إداري خاص أقامته الادارة الفرنسية يهتم بشؤون الجزائريين و يهدف إلى ضرب الثورة ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المحتشدات',
    itemTwo:
        'مراكز مسيجة مغلقة و محروسة وهي إحدى الوسائل القمعية الرهيبة التي لجأت إليها فرنسا لخنق الثورة عن طريق عزل الشعب عنها وضمت قرابة 3 مليون جزائري',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'مشروع قسنطينة ',
    itemTwo:
        'هو مشروع استعماري دعائي أعلنه دغول في 3 أكتوبر 1958 بقسنطينة و تضمن بناء 200 ألف مسكن و توزيع 250 اف هكتار من الأراضي عل الجزائر و توظيفهم  وبناء المدارس خلال خمس سنوات 1959 - 1963 بهدف إفشال الثورة و فصل الشعب عنها و خلق فئة من المتغربين الجزائريين',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المد التحرري',
    itemTwo:
        'هو رد الفعل النضالي الوطني للشعوب المستعمرة ضد الاستعمار وقد امتد بين 1945 إلى 1965 في قارة افريقيا و اسيا',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'حرب التحرير',
    itemTwo:
        'الجهود العسكرية والسياسية التي شاهدتها الجزائر في الفترة الممتدة بين 1954 إلى غاية 1962 بهدف تحقيق الاستقلال واسترجاع السيادة و اخراج المحتل',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المواثيق',
    itemTwo:
        'هي مجموعة القرارات المتفق عليها و التي تأخذ صفة المبادئ والأسس مثل ميثاق الصومام ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'البرنامج',
    itemTwo:
        'هو مجموع الأطروحات و القرارات المتفق عليها و هو عبارة عن خطة عمل بأهداف وإجراءات وأجال محددة',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'البيان',
    itemTwo: 'هو تصريح كتابي يتعلق بقضية معينه مثاله بيان نوفمبر',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' الثورة التحريرية',
    itemTwo:
        'و هي فعل تحرري شامل ورد شعبي عنيف يهدف للسيادة و الاستقلال من خلال العمليات العسكرية والسياسية لجيش و جبهة التحرير',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' النشاط المسلح ',
    itemTwo:
        'هي مجموع العمليات العسكرية و الفدائية التي قام بها الثوار الجزائريون داخل وخارج الجزائر الفترة الممتدة بين 1954 - 1962 والتي انتهت بتحقيق الاستقلال',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' سياسة الاغراء',
    itemTwo:
        'سياسة الترغيب بواسطة المشاريع الاقتصادية والاجتماعية التي أقرتها فرنسا في الجزائر للقضاء على الثورة وكسب عملاء',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'حركة عدم الانحياز',
    itemTwo:
        'تنظيم سياسي تأسس في 1961 تضم الدول حديثة ا الاستقلال التي اختارت الحياد الايجابي و عدم الميل لأي من المعسكرين المتصارعين في الحرب الباردة',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'نظام اقتصادي عالمي جديد',
    itemTwo:
        'دعوة تقدمت بها الجزائر في الدورة الطارئة للأمم المتحدة ابريل 1974 تهدف إلى إعادة صياغة القواعد المنظمة للعلاقات الاقتصادية الدولية على أسس عادلة تحمي مصالح الدول المتخلفة و الدول المتقدمة على السواء ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' النظام الدولي الجديد',
    itemTwo:
        'يقصد به فرض وجه النظر الأمريكية لاليات سير العلاقات الدولية بعد انهيار المعسكر الشيوعي ونهاية الحرب الباردة 1990 بما يخدم مصالحها ومصالح حلفائها',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' حركات التحرر',
    itemTwo:
        'ظاهرة سياسية وعسكرية شهدها العالم بعد الحرب العالمية الثانية  متمثلة في كفاح نضال الشعوب المستعمرة ضد الوجود الاستعماري مما أسهم في تراجع وتصفية الاستعمار التقليدي في أغلب المستعمرات',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الجزائر جزائرية',
    itemTwo:
        'فكرة فرنسية اعلن عنها ديغول عام 1960 تنص على تقيلد مناصب الحكم في الجزائر لمن تثق فيهم الإدارة الفرنسية أي تهميش جبهة التحرير  الوطني وكل العاملين معها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' مخطط شال وموريس',
    itemTwo:
        'نسبة للجنرال شال و موريس  إجراءات عسكرية شاملة تهدف للقضاء على الثورة بتكثيف العمليات العسكرية الضرب وحدات الجيش و منع تواصلها مع غلق الحدود تونسية والمغربية بخطين كهرباء حراسة ألغام  لشل تحرك الثوار ووقف الدعم عنهم',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' القوة الثالثة',
    itemTwo:
        'طبقة برجوازية عميلة في الجزائر دعمتها فرنسا كبديل عن الثورة و جهازها السياسي جبهة ت و ولتغليط الراي العام العالمي',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' سلم الشجعان ',
    itemTwo:
        'مناورة سياسية و حرب نفسية أطلقها ديغول يوم 23 - 10 - 1958 تقضي باستلام الثوار وتسليم أسلحتهم مقابل ضمان حريتهم وسلامتهم وقد هدف الى إفراغ الثورة من محتواها وإظهارها إلى العالم على أنها ثورة جياع',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المخططات الإنمائية',
    itemTwo:
        'عبارة عن برامج تنموية اقتصادية واجتماعية و ثقافية شاملة ترتكز على النهج الاشتراكي أعدتها الجزائر المستقلة لتطوير الاقتصاد الوطني والخروج محال التخلف والتبعية للخارج منها المخطط الثلاثي و الرباعي ومشاريع كبرى مثل طريق الوحدة الافريقية و السد الأخضر',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الثورة الزراعية ',
    itemTwo:
        ' إصلاحات جذرية ادخلتها الدولة الجزائرية على القطاع الزراعي سنة 1972 تحت شعار - الأرض لمن يخدمها بهدف النهوض بالقطاع وتحقيق الاكتفاء الذاتي تم التراجع عنها بداية من سنة 1984 ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'التحرر الشامل',
    itemTwo:
        'هو دعم الاستقلال السياسي بالاستقلال الاقتصادي بحيث تشرف الدولة وتتحكم في ثرواتها و مواردها و في مواقفها واختياراتها الداخلية والخارجية',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'اتفاقيات الاستقلال',
    itemTwo:
        'هي تلك المعاهدات التي يتم توقيعها بين الدولة المستعمرة و بين القوى التحررية في دولة ما وفي الغالب تتضمن قيود وشروط تقرضها الدول الاستعمارية لضمان حماية مصالحها في المنطقة',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الديكتاتورية',
    itemTwo:
        ' من أشكال الحكم تكون فيه السلطة مطلقة في يد فرد ديكتاتور لا يتقيد بدستور و لا بقانون و يعمل على تقيد الحريات الأساسية -   التجمع ، التظاهر ، التغيير - كما يتميز بالتسلط و الاستبدا',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' الأنظمة الفردية',
    itemTwo:
        'هي تستمد سلطتها من فرد ووحكم في مصير الدولة و توجهاتها السياسية والاقتصادية دون العودة لشعبها و  مؤسساتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' الحرب الأهلية',
    itemTwo:
        ' هي الحروب التي تقع  داخل البلد الواحد وبين جماعات من شعبه بسبب الاختلافات العرقية والسياسية و تلعب الدول الاستعمارية دورا في إشعالها و إدامتها ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' التمييز العنصري ',
    itemTwo:
        'سياسة استعمارية تقوم على التمييز و التفضيل بسبب العرق أو اللون أو الدين في التعامل وممارسة الحقوق السياسية و الاقتصادية و الاجتماعية على قدم المساوات بين جميع السكان كما كان الحال في جنوب إفريقيا مع - نظام الابرتايد العنصري و  الحركة الصهيونية',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الحدود الموروثة',
    itemTwo:
        'حدود للدول المستعمرة سابقا التي وضعها الاستعمار و كثيرا ماتنشب حروب بين دول الجوار لانها قنابل موقوتة وضعها الاستعمار لتفجيرها وقت الحاجة',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' التعددية السياسية',
    itemTwo:
        'مشروعية تعدد القوى والآراء السياسية وحقها في التعايش والتعبي�� عن نفسها والمشاركة في القرار السياسي في مجتمعاتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الاستعمار التقليدي',
    itemTwo:
        ' هو القائم على أساليب الإخضاع باستخدام القوة والحملات العسكرية لتحقيق الهيمنة ونهب ثروات المستعمرات و استغلال شعوبها استغلالا مباشرا ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' الاستعمار المقنع ',
    itemTwo:
        'محاولة الدول الاستعمارية إلى إخفاء تغلغها بأقنعة جديدة منها الاتفاقيات السياسية و الاقتصادية و الثقافية و باستخدام المساعدات الإنسانية و وسائل الإعلام ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'التبعية',
    itemTwo:
        'وصف للعلاقة غير متكافئة بين الدول الإستعمارية و مستعمراتها السابقة في المجال الاقتصادي والسياسي والثقافي مما يجعلها في حالة ضعف وعجز و فاقدة لسيادتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' المنظمات العالمية',
    itemTwo:
        'هي منظمات مفتوحة في عضويتها لجميع الدول المستقلة شرط الالتزام بمواثيقها مثل منظمة الأمم المتحدة و المنظمة العالمية للتجارة و . . . ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الاستقرار السياسي',
    itemTwo:
        'حالة سياسية تتميز بها الدول الكبرى نتيجة استقرار مؤسسات الحكم فيها و التزامها بالديمقراطية بينها تعاني الدول المتخلفة من عدم استقرارها  السياسي نتيجة كثرة الصراعات على السلطة بين طوائف الشعب',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' التحرر السياسي',
    itemTwo:
        ' أهم هدف ضحت من اجله حركات التحرر وهو استرجاع الحرية و الاستقلال و إخراج قوات المستعمر و بناء دولة وطنية تحظى بالاعتراف الدولي',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'حروب الخليج',
    itemTwo:
        'من سنة 1980 إلى 1988 بين العراق وإيران الثانية : من 1990 إلى 1991 احتلال العراق للكويت وتشكل التحالف و الدولي بقيادة ال و م أ الذي أخرجه منها وفرض عليه الحصار . الثالثة : سنة 2003 و احتلال العراق من طرف ال و م أ إلى اليوم ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' المنظمات اليهودية',
    itemTwo:
        ' هي منظمات وهيئات داعمة للحركة الصهيونية عملت وتعمل للاستلاء على كل فلسطين وتحويلها إلى وطن قومي لليهود و تهويد مقدساتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الحكم الذاتي',
    itemTwo:
        'تأسيس سلطة وطنية فلسطينية تمارس إشراف داخلي على الأوضاع في مدينة غزة وأريحا ثم الضفة لغربية كما نصت عليه الاتفاقية الموقعة في 13 سبتمبر 1993 بواشنطن بين منظمة التحرير الفلسطينية و الكيان الإسرائيلي',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الانتفاضة',
    itemTwo:
        ' شكل من أشكال المقاومة والتي ابتكرها الفلسطينيون ضد الوجود الإسرائيلي بداية من يوم 07 ديسمب 1985 تقوم على الاضربات و المظاهرات و المقاطعة للبضائع الإسرائيلية و المواجهة اليومية مع جيشها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'المقاومة',
    itemTwo:
        'هي كل الأشكال التي يأخذها نظال الشعوب المستعمرة  سياسية واقتصادية وعسكرية ضد الوجود الاستعماري فهي وسيلة حركات التحرير الوطني من أجل الاستقلال و استعادة السيادة وتحرير أراضيها و تحقيق تقرير مصيرها .',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الحركة الصهيونية',
    itemTwo:
        'حركة سياسية عنصرية ظهرت سنة 1897 عمل زعماؤها على المطالبة باقامة وطن قومي لليهود',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الكفاح المسلح ',
    itemTwo:
        'حق الشعوب المستعمرة في اللجوء لقوة للتحرر من المحتل واخراج قواته وهو حق أكدت عليه الأمم المتحدة ',
    wihda: 3,
  ),
  Tarikh(
    itemOne: '14 اوت 1941م',
    itemTwo: 'ميثاق الأطلسي بين بريطانيا والولايات المتحدة الأمريكية',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '24 - 25 أكتوبر 1917 م',
    itemTwo: 'قيام ونجاح الثورة البلشفية في روسيا',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '04 - 11 فيفري 1945 م',
    itemTwo: 'مؤتمر بالطا بين الوم  + أ إ . س +  بريطانيا ',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '16 جويلية 1945 م',
    itemTwo: ' إمتلاك الو . م . أ السلاح الذري',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '26 / 06 / 1945 م',
    itemTwo: 'المصادقة على ميثاق الأمم المتحدة ',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '17 جويلية - 02 اوت 1945 م',
    itemTwo: 'مؤتمر بوتسدام ( بريطانيا + إ س+و. م . أ ) أقر تقسيم ألمانيا',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '22 جويلية 1945 م',
    itemTwo: 'تأسيس صندوق النقد الدولي',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '06 - 09 أوت 1945 م',
    itemTwo: 'تفجير قنبلتين نوويين على كليروشيما وناكازاكي في اليابان',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '24 / 10 / 1945 م',
    itemTwo: ' تاسيس هيئة الامم المتحدة',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '05 مارس 1946',
    itemTwo: ' تسمية مؤتمر الستار الحديدي من طرف تشرشل',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '12 مارس 1947 م',
    itemTwo: 'مبدأ مشروع هاري ترومان',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '05 جوان 1947 م',
    itemTwo: 'مشروع جورج مارشال',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '26 جويلية 1947 م',
    itemTwo: 'تأسيس وكالة المخابرات المركزية الأمريكية',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '22 سبتمبر 1947',
    itemTwo: 'مبدأ جدانوف',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '06 أكتوبر 1947م ',
    itemTwo: ' إنشاء مكتب الكومنفورم',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '28 جوان 1946 م',
    itemTwo: 'انسحاب يوغوسلافيا من الكومنفورم',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '25 جانفي 1949 م',
    itemTwo: 'تأسيس منظمة الكوميكون ',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: ' 04 أفريل 1949 م',
    itemTwo: 'تأسيس الحلف الأطلسي ( الناتو )',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '21 سبتمبر 1949 م',
    itemTwo: 'تفجير أول قنبلة ذرية سوفياتية',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '01 أكتوبر 1949 م ',
    itemTwo:
        ' انتصار الثورة الشيوعية بقيادة ماو تسي تونغ وقيام جمهورية الصين الشعبية',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '04 نوفمبر 1952 م ',
    itemTwo: 'وصول ايزنهاور إلى الرئاسة في الو . م . أ',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '13 مارس 1954 م',
    itemTwo: ' تأسيس لجنة أمن الدولة السوفياتية',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '08 / 09 / 1954 م',
    itemTwo: 'تأسيس حلف جنوب شرق أسيا ( السياتو )',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '24 فيفري 1955 م',
    itemTwo: ' تأسيس حلف بغداد ',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '14 / 05 / 1955 م',
    itemTwo: ' تأسيس حلف وارسو',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '05 جانفي 1957 م ',
    itemTwo: 'مشروع ايزنهاور',
    wihda: 1,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '03 جوان 1948 م ',
    itemTwo:
        'اجتماع لندن بين بريطانيا - فرنسا - و . م . أ  بتأسيس حكومة ديمقراطي الرأسمالية في بون الألمانية',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 23 جوان 1945 م ',
    itemTwo: ' حصار برلين الذي فرضه السوفيات ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 25 جوان 1948 م ',
    itemTwo: 'إنشاء جسر جوي إلى برلين وفك الحصار عنها .',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '08 ماي 1949 م',
    itemTwo: 'تأسيس ألمانيا الغربية الرأسمالية الاتحادية عاصمتها بون',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '12 ماي 1949 م',
    itemTwo: 'رفع حصار برلين',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '07 أكتوبر 1949م ',
    itemTwo:
        'تأسيس ألمانيا الديمقراطية الشرقية الشيوعية عاصمتها  برلين الشرقية ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '25 جوان 1956 م',
    itemTwo: 'اندلاع الحرب الكورية بغزو القسم الشمالي للجنوب واجتياز خط °38',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '27 جويلية 1953م',
    itemTwo: ' نهاية الحرب الكورية ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 27 سبتمبر 1955 م ',
    itemTwo: 'صفقة السلاح المصرية مع تشيكوسلوفاكيا',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 29 أكتوبر 1956 م',
    itemTwo: 'العدوان الثلاثي على مصر من قبل فرنسا - بريطانيا -إسرائيل ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '05 نوفمبر 1956 م',
    itemTwo: 'تهديد -ا س - بضرب عواصم الدول المعتدية على مصر بالسلاح النووي',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '23 ديسمبر 1956 م',
    itemTwo: 'انسحاب فرنسا وبريطانيا من بور سعيد المصرية',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '06 مارس 1957 م',
    itemTwo: ' انسحاب إسرائيل من غزة و سيناء ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '27 نوفمبر 1958 م',
    itemTwo: 'إنذار السوفيات بجعل مدينة برلين مدينة حرة',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '20 جوان 1959 م',
    itemTwo: 'انسحاب الصين من الكومنفورم ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '07 فيفري 1962 م',
    itemTwo: 'تطبيق الحصار الاقتصادي على كوبا من وم أ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '14 أكتوبر 1962 م',
    itemTwo:
        ' التقاط طائرة التجسس الأمريكية للصواريخ النووية السوفيائية في كوبا ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 22 أكتوبر 1962 م ',
    itemTwo: 'فرض الحصار العسكري على كوبا من طرف الو . م . ا',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '28 أكتوبر 1962 م',
    itemTwo: 'قرار سحب السوفيات للصواريخ من كوبا ونهاية الأزمة الكوبية ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '20 جوان 1963 م',
    itemTwo: 'إنشاء الخط الأحمر الهاتفي بين موسكو - واشنطن ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '13 أوت 1961 م ',
    itemTwo: 'إقامة جدار برلين',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '27 ديسمبر 1979 م',
    itemTwo: ' تدخل الاتحاد السوفياتي في أفغانستان ',
    wihda: 1,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '05 مارس 1953 م',
    itemTwo: 'وفاة زعيم الاتحاد السوفياتي جوزيف ستالين',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 18 - 24 أفريل 1955م',
    itemTwo: 'مؤتمر باندونغ ( التضامن الأفروأسيوي )',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '05 ماي 1955 م',
    itemTwo: 'اعتراف ( إ.س ) بألمانيا الغربية الاتحادية',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 17افريل  1956 م',
    itemTwo: 'حل مكتب الكومنفورم',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '21 - 23 /06/ 1955م',
    itemTwo: 'انعقاد مؤتمر جنييف ( فرنسا - بريطانيا - الو . م . أ - إ . س )',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '14 فيفري 1956 م',
    itemTwo: 'تبني خروتشوف سياسة التعايش السلمي',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '04 اكتوبر 1957م',
    itemTwo: ' إطلاق ( إ.س ) أول نمر إصطناعي ( سبوتنبك )',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '21/2 - 03/03 1959م',
    itemTwo: 'زيارة رئيس الوزراء البريطاني إلى موسكو',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '15 - 18 / 09 / 1959 م',
    itemTwo: 'زيارة خروتشوف إلى واشنطن',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '21 / 04 / 1961 م',
    itemTwo: 'أول رحلة لغزو الفضاء من طرف يوري غاغارين',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '1 - 06 / 09 / 1961 م',
    itemTwo: 'تأسيس حركة عدم الانحياز ببلغراد ',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '26 ماي 1972 م',
    itemTwo: 'اتفاقية سالت الأولى للحد من الأسلحة الإستراتيجية',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '09 سبتمبر 1973 م',
    itemTwo: 'المؤتمر الرابع لحركة عدم الانحياز بالجزائر',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '18 جوان 1979 م',
    itemTwo:
        'اتفاقية سالت الثانية بفيينا تم فيها تحديد كمية الأسلحة و الصواريخ العابرة للقارات',
    wihda: 1,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '09 نوفمبر 1989 م',
    itemTwo: 'سقوط جدار برلين',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '03 أكتوبر 1990 م',
    itemTwo: 'تحقيق الوحدة الألمانية بين ألمانيا الغربية - ألمانيا الشر��ية',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '19 - 21 نوفمبر 1990 م',
    itemTwo: ' مؤتمر باريس وإعلان نهاية الحرب الباردة رسميا',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '03 - 04 ديسمبر 1989 م',
    itemTwo:
        'مؤتمر مالطا بدين غورباتشوف وجورج بوش أعلن فيه نهاية الحرب الباردة وزوال القطبية الثنائية ',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: ' 05 سبتمبر 1991 م',
    itemTwo: 'حل الحزب الشيوعي السوفياتي',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '01 جانفي 1991 م',
    itemTwo: ' إنزال علم الاتحاد السوفياتي من مبنى هيئة الأمم المتحدة',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '28 جوان 1991 م ',
    itemTwo: 'حل منظمة الكوميكون ',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '01 جويلية 1991م',
    itemTwo: 'حل حلف وارسو',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '21 ديسمبر 1991م',
    itemTwo:
        'زوال الاتحاد السوفياتي رسميا وظهور الجمهوريات المستقلة بمؤتمر ألما آتاه',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '25 ديسمبر 1991م',
    itemTwo: 'استقالة غورباتشوف من رئاسة الاتحاد السوفياتي',
    wihda: 1,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '03 - 10 فيفري  1943 م ',
    itemTwo: ' بيان الشعب الجزائري ( بيان فيفري )',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '12 / 12 / 1943 م ',
    itemTwo: 'مشروع إصلاحات جاء بها ديغول في الجزائر',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '16 مارس 1945 م',
    itemTwo: 'إطلاق سراح البشير الإبراهيمي وفرحات عباس ',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '08 ماي 1945 م',
    itemTwo: 'مظاهرات و مجازر أحداث قالمة وسطيف وخراطة',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '15 ماي 1945 م',
    itemTwo: 'حل حزب أحباب البيان و الحرية',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '09 مارس 1946 م',
    itemTwo:
        'قانون العفو الشامل الذي أصدرته سلطات الاستعمار في  الجزائر على المعتقلين السياسيين الجزائريين',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '17 أفريل 1946',
    itemTwo: ' تأسيس حزب الاتحاد الديمقراطي للبيان الجزائري',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '21 جويلية 1946 م',
    itemTwo: 'المؤتمر التاسع لجمعية العلماء المسلمين الجزائريين',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '02 نوفمبر 1946 م',
    itemTwo: 'تأسيس حركة انتصر الحريات الديمقراطية بزعامة مصالي الحاج',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: ' 15 - 16 فيفري 1947 م',
    itemTwo: 'تأسيس المنظمة الخاصة إثرى المؤتمر الأول بقيادة محمد  بلوزداد',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '20 / 09 / 1947',
    itemTwo: 'صدور الدستور الخاص بالجزائر ( القانون الخاص ',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '4 - 11 أفريل 1948م',
    itemTwo: ' انتخابات المجلس الجزائري',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '18 مارس 1960 م ',
    itemTwo: 'اكتشاف المنظمة الخاصة',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '05 اوت 1956 م',
    itemTwo: 'إنشاء الجبهة الجزائرية للدفاع عن الحريات واحترامه',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '14 ماي 1952 م ',
    itemTwo: 'نفي مصالي الحاج إلى برازافيل بالكونغو',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '4 أفريل 1953 م',
    itemTwo: 'أزمة حركة انتصار الحريات الديمقراطية في مؤتمرها الثاني',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '23 مارس 1954',
    itemTwo: 'تأسيس اللجنة الثورية للوحدة و العمل ( CRUA )',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '25 جوان 1954 م',
    itemTwo: 'اجتماع مجموعة 22',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '14 - 16 جويلية  1954 م',
    itemTwo: ' مؤتمر « أورنو ببلجيكا » أت��اع مصالي الحاج بحل اللجنة المركزية',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '13 - 15 أوت 1954 م',
    itemTwo: 'مؤتمر أتباع اللجنة المركزية بعزل مصالي الحاج',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '23 أكتوبر 1954 م',
    itemTwo:
        ' اجتماع لجنة الستة ( 06 ) بتأسيس حزب جبهة الوطني وجيش التحرير الوطني',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '24 أكتوبر 1954 م',
    itemTwo: 'تحديد تاريخ اندلاع الثورة و إعداد بيان أول نوفمبر',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '01 نوفمبر 1954 م',
    itemTwo: 'اندلاع الثورة التحريرية الكبرى ',
    wihda: 2,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '05 نوفمبر 1954 م',
    itemTwo: 'حل فرنسا لحزب حركة انتصار الحريات الديمقراطية ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '18 / 01 / 1955 م',
    itemTwo: ' استشهاد ديدوش مراد',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '01 فيفري 1955 م ',
    itemTwo: 'تعيين جاك سوستين حاكما عاما على الجزائر',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '05 فيفري 1955 م',
    itemTwo: ' سقوط حكومة منداس فرانس ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '12 / 02 / 1955 م ',
    itemTwo: ' اعتقال مصطفى بن بولعيد ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '23 مارس 1955 م',
    itemTwo: ' اعتقال رابح بيطاط',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '03 أفريل 1955 م ',
    itemTwo: ' إعلان حالة الطوارئ في الجزائر',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '20 أوت 1955 م',
    itemTwo: 'هجومات الشمال القسنطيني بقيادة زيغود يوسف',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '12 سبتمبر 1955 م',
    itemTwo: ' حل فرنسا للحزب الشيوعي الجزائري',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '26 سبتمبر 1955 م',
    itemTwo: ' إنشاء المصالح الإدارية الخاصة ( الاصاص )',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '07/01/1956 ',
    itemTwo: ' التحاق جمعية العلماء المسلمين بالثورة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '01 فيفري 1956 م',
    itemTwo: ' تأسيس حكومة غي مولي',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 2 فيفري 1956 م ',
    itemTwo: 'تأسيس الاتحاد العام للعمال الجزائريين',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '22 أفريل 1956 م',
    itemTwo:
        ' حل حزب حركة الاتحاد الديمقراطي لليان الجزائري  وانضام فرحات عباس إلى الثورة ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '19 ماي 1956 م',
    itemTwo: 'إضراب الاتحاد العام للطلبة المسلمين والتحاقهم بالثورة ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '22 أوت 1956 م ',
    itemTwo:
        ' اختطاف طائرة قادة الوفد الخارجي للثورة في القرصنة  الجوية الفرنسية',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '20 أوت 1956 م ',
    itemTwo: 'انعقاد مؤتمر الصومام',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '10 / 01 / 1957 م',
    itemTwo: 'شروع مخطط فصل الصحراء عن الشمال',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '22 جانفي 1957',
    itemTwo: 'اجتماع لجنة التنسيق و التنفيذ بالعاصمة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '28 جانفي - 04  فيفري 1957 م',
    itemTwo: 'إضراب 08 أيام الذي دعت إليه جبهة التحرير',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 05 مارس 1957 م',
    itemTwo: 'استشهاد العربي بن مهيدي',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '21 ماي 1957 م',
    itemTwo: 'سقوط حكومة غي مولي',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '08 فيفري 1958 م ',
    itemTwo: ' حادثة قصف ساقية سيدي يوسف على الحدود التونسية ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '19 فيفري 1958 م',
    itemTwo: ' إنشاء المناطق المحرمة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '28 أفريل 1958 م',
    itemTwo: 'دعم مؤتمر طنجة للكفاح في الجزائر',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '13 ماي 1958 م ',
    itemTwo: 'تمرد الجيش و الضباط الفرنسيين في الجزائر على الحكومة الفرنسية',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '25 ماي 1958م',
    itemTwo: 'ظهور لجنة الإنقاذ الفرنسية ودعوتها لعودة ديغول الى السلطة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '01 جوان 1957 م ',
    itemTwo: 'وصول ديغول إلى السلطة وتأسيس الجمهورية الخامسة ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '28 جويلية 1958 م',
    itemTwo: 'تنظيم الاستفتاء حول دستور الجمهورية الخامسة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '19 سبتمبر 1958 م',
    itemTwo: 'تشكيل الحكومة الجزائرية المؤقتة بقيادة فرحات عباس ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 18 أكتوبر 1958 م',
    itemTwo: 'مشروع قسنطينة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '23 أكتوبر 1958 م',
    itemTwo: 'شروع سلم الشجعان ( سلم الأبطال )',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '25 أكتوبر 1958 م',
    itemTwo: ' الحكومة المؤقتة ترفض سلم الأبطال',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 28 مارس 1959 م',
    itemTwo: ' استشهاد العقيد عميروش وسي الحواس',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '16 سبتمبر 1959 م',
    itemTwo: 'إعلان ديغول لحق الجزائريين في تقرير المصير',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '13 فيفري 1960',
    itemTwo: ' أول تفجير نووي لفرنسا في الصحراء الجزائرية',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 25 - 29 / 06 / 1960 م ',
    itemTwo: 'محادثات مولان',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 11 ديسمبر 1960 م',
    itemTwo: 'مظاهرات في الجزائر من طرف الجزائريين ضد دعاة الجزائر فرنسية',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '29 ديسمبر 1960',
    itemTwo: 'اعتراف الجمعية العامة للأمم المتحدة حق الجزائر في تقرير المصير',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: 'فيفري 1961 م',
    itemTwo: 'ظهور منظمة الجيش السري الإرهابية الفرنسية',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '20 فيفري 1961 م ',
    itemTwo: 'لقاء لوسارن بسويسرا بين الوفد الفرنسي و الجزائري',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '21 أفريل 1961 م',
    itemTwo: 'الانقلاب العسكره صد دول من طرف جنرالات الجزائر',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '20 ماي - 13  جوان  1961 م',
    itemTwo: 'مفاوضات ايفان الأول',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 26 أوت 1961 م',
    itemTwo: ' تعيين بن خدة رئيسا للحكومة الجزائرية خلفا لفرحات عباس',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '17 أكتوبر 1961 م ',
    itemTwo:
        'مظاهرات المهاجرين الجزائريين بباريس التي نظمتها فيدرالية جبهة التحرير بفرنسا ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: 'من 07 الى 18 / 03 /1962 م ',
    itemTwo: 'مفاوضات ايفيان الثانية',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '19 مارس 1962م',
    itemTwo: 'وقف إطلاق النار بين الجزائر و الفرنسيين وتوقيف القتال',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '29 مارس 1968 م',
    itemTwo: 'ظهور الهيئة التنفيذية المؤقتة برئاسة عبد الرحمن فارس',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '27 جوال 1962 م',
    itemTwo: 'انعقاد مؤتمر طرابلس ( برنامج طرابلس ثلث وثيقة للثورة )',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '2 جويلية 1962 م',
    itemTwo: 'استفتاء تقرير المصير في الجزائر ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '02 جويلية 1962 م ',
    itemTwo: 'نتائج الاستفتاء ب 99 بالمئة نعم للاستقلال',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 05 جويلية 1962 م',
    itemTwo: 'إعلان ديغول استقلال الجزائر رسميا',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '05 جويلية 1962 م',
    itemTwo: 'إعلان استقلال الجزائر رسميا من طرف الحكومة الجزائرية المؤقتة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 20 سبتمبر 1962',
    itemTwo: ' انتخاب الجمعية التأسيسية الجزائرية ',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '25 سبتمبر 1962 م',
    itemTwo: 'إعلان قيام الجمهورية الجزائرية',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: ' 29 سبتمبر 1962 م',
    itemTwo: ' انتخاب احمد بن بلة رئيسا للحكومة',
    wihda: 2,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '29 مارس 1963 م',
    itemTwo: 'إعلان بن بلة لقانون التسيير الذاتي',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 08 سبتمبر 1963 م ',
    itemTwo: 'استفتاء حول أول دستور للجزائر ( نظام و الواحد ) ',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '15 سبتمبر 1963 م',
    itemTwo: ' انتخاب أحمد بن بلة رئيسا للجمهورية',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '08 أكتوبر 1963 م',
    itemTwo: 'بداية حرب الرمال الحدودية بين الجزائر و المغرب الأقصى',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '05 نوفمبر 1963 م ',
    itemTwo: 'نهاية حرب الرمال بين الجزائر المغرب',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 16 أفريل 1964 م',
    itemTwo: ' صدور ميثاق الجزائر',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '19 جوان 1965 م',
    itemTwo: 'حركة التصحيح العربي بقيادة هواري بومدين وإزاحة  أحمد بن بلة',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '10 جويلية 1965 م',
    itemTwo: ' تشكيل هواري بومدين للحكومة',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '06 / 05 / 1966 م',
    itemTwo: ' تأميم المناجم',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '05 فيفري 1967 م',
    itemTwo: ' انتخابات المجالس البلدية ',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' جانفي 1968 م ',
    itemTwo: 'انسحاب القوات الفرنسية من قاعدة المرسى الكبير',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '02 ماي 1969 م ',
    itemTwo: ' انتخابات المجالس الولائية',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '24 فيفري 1971 م',
    itemTwo: 'تأميم المحروقات ',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '10 أفريل 1974 م',
    itemTwo:
        ' خطاب الرئيس هواري بومدين في الأمم المتحدة و المطالبة بنظام اقتصادي عالمي',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '14 أوت 1974 م  ',
    itemTwo: 'وفاة مصالي الحاج بفرنسا ',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 14 أوت 1974 م',
    itemTwo: ' انطلاق انجاز مشروع السد الأخضر من طرف شباب الخدمة الوطنية ',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '27 / 06 / 1976',
    itemTwo: 'إعادة صيغة الميثاق الوطني الأول',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '27 فيفري 1976 م ',
    itemTwo: ' انتخاب أول مجلس شعبي وطني في الجزائر ',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '19 / 11 / 1976',
    itemTwo: ' الدستور الثاني الحرائر - العودة إلى النظام الجمهوري الرئاسي',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '10 / 12 / 1976',
    itemTwo: ' انتخاب هواري بومدين رئيسا للجمهورية',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 27 ديسمبر 1978 م',
    itemTwo: ' وفاة الرئيس هواري بومدين',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '27 - 30 جانفي 1979 م ',
    itemTwo: 'حل مجلس الثورة وتعيين شادلي بن جديد رئيسا للجمهورية الجزائرية ',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '07 فيفري 1979 ',
    itemTwo: 'انتخاب شادلي بن جديد رئيسا للجمهورية',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '20 أفريل 1980 م ',
    itemTwo: 'حركة احتجاجية بمنطقة القبائل',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 10 أكتوبر 1980 م ',
    itemTwo: 'زلزال الشلف- 10000 ضحية',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '30 أكتوبر 1980 م ',
    itemTwo: 'إطلاق سراح أحمد بن بلة والطاهر الزبيري',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '12 جانفي 1984 م',
    itemTwo: 'انتخاب شادلي بن جديد للعهدة  الثانية',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '8 نوفمبر 1986 م',
    itemTwo: 'إضرابات في قسنطينة',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 05 أكتوبر 1988م',
    itemTwo: 'إضرابات ومظاهرات شغب  بالجزائر العاصمة',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '23 فيفري 1989 م',
    itemTwo: 'أستفتاء حول دستور التعددية الحزبية و السياسية في الجزائر',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '9  مارس 1989م',
    itemTwo: ' إنشاء المجلس الدستوري',
    wihda: 2,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '08 اكتوبر 1962 م',
    itemTwo: 'انضمام الجزائر إلى هيئة الأمم المتحدة',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '23 سبتمبر 1963م',
    itemTwo: ' فتح أول مكتب لحركة فتح الفلسطينية في الجزائر',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '06 جوان 1967م',
    itemTwo:
        'قطع الجزائر العلاقات الدبلوماسية مع الو . م . أ بسبب دعمها لاسرائيل',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '10 - 15 اكتوبر 1967 م ',
    itemTwo: ' انعقاد مؤتمر التنمية المجموعة 77 بالجزائر',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '13 - 16 سبتمبر 1968 م',
    itemTwo: ' المؤتمر الخامس لمنظمة الوحدة الإفريقية بالجزائر',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: ' 14 - 29 نوفمبر 1973 م',
    itemTwo: ' المؤتمر السادس لجامعة الدول العربية بالجزائر',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '13 نوفمبر 1974 م',
    itemTwo: 'خطاب ياسر عرفات التاريخي في الأمم المتحدة بفضل جهود الجزائر ',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: ' 15 نوفمبر 1988 م',
    itemTwo: 'إعلان قيام دولة فلسطين بالجزائر',
    wihda: 2,
    wad3iya: 4,
  ),
  Tarikh(
    itemOne: '03 فيفري 1930 م',
    itemTwo: ' تأسيس الحزب الشيوعي الفيتنامي',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '22/ 09/ 1940م',
    itemTwo: 'احتلال اليابان للهند الصينية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '25 جويلية 1941 م ',
    itemTwo: 'اخضاع الهند الصينية للسيطرة اليابانية كليا',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '02 سبتمبر 1945 م',
    itemTwo:
        'إعلان هوشي منه استقلال الفيتنام واستسلام اليابان  في الحرب العالمية الثانية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: 'ديسمبر 1941 م',
    itemTwo: 'تأسيس حركة الفيت منه الفيتنامية ',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '10 مارس 1945 م',
    itemTwo: 'نهاية الحماية الفرنسية على الهند الصينية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: 'ماي 1946 م',
    itemTwo: 'مؤتمر مونتينيبلو بين فرنسا و الفيتنام',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '19 ديسمبر 1946 م',
    itemTwo: ' اندلاع الثورة الفيتنامية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '05 جوان 1948 م',
    itemTwo: 'تنصيب باوداي إمبراطورا على الفيتنام الجنوبي',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '19 جويلية 1949 م ',
    itemTwo: 'منح الاستقلال لللاووس',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '09 نوفمبر 1953 م',
    itemTwo: 'منح الاستقلال لكمبوديا',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '7 ماي 1954',
    itemTwo: 'معركة ديان بيان فو وانهزام فرنسا بالفيتنام',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '20 جويلية 1954 م',
    itemTwo: ' مؤتمر جنييف الخاص بالقضية الفيتنامية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '23/ 10/ 1955م',
    itemTwo:
        ' إلغاء الملكية وتأسيس النظام الجمهوري بقيادة ديم في الفيتنام الجنوبي',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '2 / 8 / 1964',
    itemTwo:
        'هجوم القوات الفيتنامية الشمالية على القوات الأمريكية في خليج تونكين ',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '31 / 7 / 1966',
    itemTwo: ' القصف الأمريكي بطائرات بي 52 على فيتنام الشمالية ',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: ' 03 / 9 / 1969',
    itemTwo: 'وفاة هوشي منه رئيس فيتنام الشمالية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '15 / 1 / 1973',
    itemTwo: 'وقف إطلاق النار من طرف الو . م . أ في الفيتنام الشمالية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '27 / 1 / 1973',
    itemTwo:
        'توقيع هدنة باريس بين الو . م . أ و الفيتنام الشالي و الفيتنام الجنوبي',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: ' أفريل 1975 م',
    itemTwo: ' احتلال القسم الجنوب الفيتنامي من طرف قوات الشمال',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '17 / 06 / 1975',
    itemTwo: ' استقلال وتوحيد الفيتنام',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '12 مارس - 06 أفريل 1930 م',
    itemTwo: ' مسيرة الملح في الهند',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '13 أفريل 1919 م',
    itemTwo: 'مظاهرات أمريتسار في الهند',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '08 أوت 1942 م',
    itemTwo: 'خطاب غاندي بالدعوة إلى رحيل الانجليز',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '15 أوت 1947 م',
    itemTwo: 'استقلال و تقسيم اللهند',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '26 / 08 / 1936 ',
    itemTwo: 'معاهدة لندن بين مصر وبريطانيا بمنح الاستقلال الشكلي  لمصر',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '23 جويلية 1952م',
    itemTwo: ' اندلاع الثورة المصرية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '26 جويلية 1962 م',
    itemTwo: 'عزل ونفي الملك فاروق',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '18 جوان 1953م',
    itemTwo:
        ' إلغاء النظام الملكي في مصر وقيام النظام الجمهوري برئاسة  محمد نجيب ',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: 'جوان 1954',
    itemTwo: ' انتخاب جمال عبد الناصر رئيسا لمصر',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '19 أكتوبر 1954 م ',
    itemTwo: 'توقيع معاهدة جلاء وانسحاب بريطانيا من مصر',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '18 جوان 1956 م',
    itemTwo: 'انتهاء و جلاء القوات البريطانية من مصر رسميا ( قناة السويس )',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '26 جويلية 1956 ',
    itemTwo: 'تأميم قناة السويس',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '23 فيفري 1958',
    itemTwo: ' اعلان جمال عبد الناصر الوحدة السورية المصرية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: ' 26 جويلية 1953 م',
    itemTwo: 'الانقلاب الفاشل لفيدال كاسترو على نظام باتيستا- الثورة الكوبية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '08 جانفي  1959 م',
    itemTwo: ' نجاح الثورة الكوبية بسقوط نظام باتيستا وصول كاسترو و إلى السلطة',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: ' 20 مارس 1970',
    itemTwo: 'تأسيس منظمة الفرنكونية',
    wihda: 3,
    wad3iya: 1,
  ),
  Tarikh(
    itemOne: '11 مارس 1985 م',
    itemTwo: 'وصول غورباتشوف إلى السلطة في الاتحاد السوفياتي',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '26 أفريل 1986 م',
    itemTwo: 'حادثة تشرنوبيل النووية في أوكرانيا',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '02 أوت 1990 م',
    itemTwo: 'اندلاع حرب الخليج الثانية بغزو العراق للكويت و قرار مجلس الأمن',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '06 أوت 1990 م ',
    itemTwo: 'قرار مجلس الأمن 661 بفرض عقوبات إقتصادية على العراق',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: 'نوفمبر 1990',
    itemTwo: 'قرار مجلس الأمن 678 بتشكيل قوة تحالف ضد العراق',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '17 جانفي 1991 م',
    itemTwo:
        'التدخل العسكري للتحالف الدولي بقيادة و . م . أ على العراق في حرب الخليج الثاني',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '26 فيفري 1991م',
    itemTwo: ' انتهاء حرب الخليج الثانية وانسحاب العراق من الكويت',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '8 ديسمبر 1992',
    itemTwo: 'إعلان حقوق الأشخاص المنتمين إلى الأقليات القومية',
    wihda: 3,
    wad3iya: 2,
  ),
  Tarikh(
    itemOne: '29 - 31 أوت 1897 م',
    itemTwo: ' المؤتمر الأول للحركة الصهيونية ببال السويسرية',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '16 ماي 1916 م ',
    itemTwo: ' اتفاقية سايكس بيكو',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '02 نوفمبر 1917 م',
    itemTwo: 'وعد بلفور',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '31 ماي 1920 م',
    itemTwo: 'مؤتمر سان ريمو بإعلان الانتداب البريطاني على فلسطين ',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 30 جوان 1920 م',
    itemTwo: 'تعيين هربرت صموئيل مندوبا بريطانيا ساميا على فلسطين',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '29 سبتمبر 1923 م ',
    itemTwo: 'وضع فلسطين تحت الانتداب البريطاني رسميا بتكليف  من عصبة الأمم',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '23 - 29 أوت 1929 م',
    itemTwo: 'ثورة البراق الشريف ( حائط المبكي )',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '28 أوت 1936 م',
    itemTwo: ' اندلاع الثورة العربية الكبري بقيادة عز الدين القسام',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 07 جويلية 1937 م',
    itemTwo: 'مشروع بيل البريطاني في تقسم فلسطين',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 29 نوفمبر 1947 م ',
    itemTwo: 'المشروع الأممي 181 في تقسيم فلسطين',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '14 ماي 1948 م',
    itemTwo: 'إعلان بريطانيا نهاية الانتداب على فلسطين',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '15 ماي 1948 م',
    itemTwo: ' إعلان قيام دولة إسرائيل',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '11 جوان 1948 م',
    itemTwo: 'هدنة مؤقتة لمدة شهر بين إسرائيل و العرب',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 16 جويلية 1948 م ',
    itemTwo: ' هزيمة العرب في حرب 1948 م',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '07 جانفي 1949 م',
    itemTwo: 'هدنة رودس بطلب من مجلس الأمن بين إسرائيل و العرب',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '09 أفريل 1949 م',
    itemTwo: 'مجزرة دير ياسين ضد الفلسطينين',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '11 ماي 1949 م ',
    itemTwo: 'الاعتراف الدولي بإسرائيل من طرف الأمم المتحدة',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '06 نوفمبر 1956 م',
    itemTwo: 'توقف العدوان الثلاثي على مصر',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '28 ماي 1964 م',
    itemTwo: 'تأسيس منظمة التحرير الفلسطينية',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '01 جانفي 1965 م',
    itemTwo: 'اندلاع ثورة التحرير الفلسطينية',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '05 جوان 1967 م',
    itemTwo: 'الحرب العربية الإسرائيلية الثالثة ( حرب النكسة )',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 10 جوان 1967 م',
    itemTwo:
        ' إنهاء حرب النكسة وهزيمة العرب و القرار الأممي 242 القالمي بانسحاب إسرائيل من اراضي 1967',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '8 سبتمبر 1968 م',
    itemTwo: 'حرب الاستنزاف المصرية ضد اسرائيل',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '20 مارس 1968 م',
    itemTwo: 'معركة الكرامة',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' سبتمبر 1970 م',
    itemTwo: 'أحداث أيلول الأسود',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '06 أكتوبر 1973 م',
    itemTwo: ' الحرب العربية الإسرائيل الرابعة ( حرب رمضان )',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '15 اكتوبر 1973 م',
    itemTwo: 'استخدام العرب لسلاح النفط ضد الدول المؤيدة لإسرائيل',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 22 أكتوبر 1973 م',
    itemTwo:
        'قرار در قرار مجلس الأمن 338 بالدعوة إلى وقف إطلاق النار وتطبيق قرار 242',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '25 أكتوبر 1973 م',
    itemTwo: ' نهاية حرب رمضان',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '24 اكتوبر 1974م',
    itemTwo: 'الاعتراف بمنظمة التحرير الفلسطينية كعضو مراقب في الامم المتحدة',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '17 سبتمبر 1978م',
    itemTwo:
        'توقيع اتفاقية كامب ديفيد بين أنور السادات و الإسرائيلي مناحيم بيغن',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '1979/03/29',
    itemTwo: 'معاهدة السلام في واشنطن بين مصر وإسرائيل',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '06 جوان 1982م',
    itemTwo: ' العدوان الإسرائيلي على لبنان',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '09/ 01/ 1982',
    itemTwo: 'مشروع رونالد ريغن الأمريكي',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '09 / 09 / 1982',
    itemTwo: ' مشروع فاس من طرف الملك فهد بن عبد العزيز',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '15 / 09 / 1982 م',
    itemTwo: 'مشروع التسوية للزعيم السوفياتي بريجنيف',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '18 سبتمبر 1982 م',
    itemTwo: ' مجازر صبرا و شتيلا في لبنان ',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 07 ديسمبر 1987 م ',
    itemTwo: 'الانتفاضة الفلسطينية الأولى ( انتفاضة أطفال الحجارة )',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '09 جوان 1988 م ',
    itemTwo: ' انعقاد قمة الانتفاضة بالجزائر',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 30 أكتوبر - 03 نوفمبر 1991 م',
    itemTwo: ' انعقاد مؤتمر مدريد للسلام ',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '13 سبتمبر 1993 م',
    itemTwo: ' اتفاقية أوسلو بواشنطن بين ياسر عرفات و إسحاق رابين ',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: ' 01 جويلية 1994 م',
    itemTwo: 'عودة ياسر عرفات إلى قطاع غزة',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '20 جانفي 1996 م',
    itemTwo: 'انتخاب ياسر عرفات رئيسل للسلطة الفلسطينية',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '24 ماي 2000 م',
    itemTwo: ' انسحاب إسرائيلي من جنوب لبنان',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '29 سبتمبر 2000 م',
    itemTwo: ' انتفاضة الأقصى الثانية',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '12 جويلية - 14 أوت 2006م',
    itemTwo:
        'الحرب العربية الإسرائيلية السادسة ( العدوان الإسرائيلي على لبنان )',
    wihda: 3,
    wad3iya: 3,
  ),
  Tarikh(
    itemOne: '',
    itemTwo: '',
    wihda: 3,
    wad3iya: 3,
  ),
];
