class Chakhsiya {
  String itemOne, itemTwo;
  int wihda;
  Chakhsiya({this.itemOne, this.itemTwo, this.wihda});
}

List<Chakhsiya> chakhsiyat = [
  Chakhsiya(
    itemOne: ' هاري ترومان',
    itemTwo: 'رئيس الو . م . أ 1945 -  1953 الآمر برمي قنبلة هيروشيما وناغازاكي مؤيد الهجرة اليهودية إلى فلسطين و مفجر الحرب الباردة بإعلانه لسياسة الاحتواء و التي تطورت إلى سياسة ملء الفراغ ',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'ستالين جوزيف',
    itemTwo: 'رئيس الاتحاد السوفييتي من 1924 - 1953 تميزت فترة حكه الفردية والتشدد في نظر الغرب واجه المخطط الأمريكية بمخططات مضادة منها الكومنفورم وحلف وارسو ',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' جدانوف أندري الكسندروفيتش',
    itemTwo: '( 1896 1948 ) سياسي سوفييتي صاحب أطروحة الكتلتين الشرقية الغربية ، ساهم في التشدد الإيديولوجي و صاحب المشروع المعروف باسمه',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' مارشال جورج ',
    itemTwo: '( 1880 1959 ) جنرال و وزير أمريكي في عهد روزفلت ما بين 1947 إلى 1949 وضع مشروع دعم أوربا المعروف باسمه منح جائزة نوبل للسلام بعد نهاية الحرب الكورية 1953',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'خروتشوف نيكيتا',
    itemTwo: 'خلف ستالين سنة 1953 صاحب ، مبادرة التعايش السلمي و أول زعيم سوفييتي يزور الو م أ حدثت في عهده عدة أزمات أخطرها أزمة الصواريخ في كوبا 1962',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' كنيدي ، فيتزجيرالد',
    itemTwo: 'اصغر رئيس للو . م . أ 1961 1963 وهو صاحب مشروع ابولو الفضائي في عهده وقعت أزمة كوبا 1962 عمل على تحسين أوضاع السلام ما عرضه للقتل',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' رونالد ريغن',
    itemTwo: 'رئيس الو . م . أمن 1981 1989 و مؤسس التيار المحافظ . انتهج سياسة خارجية متشددة . في 1983 أطلق ماعرف بمبادرة الدفاع الاستراتيجي ضد السوفيات المعروفة بحرب النجوم',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: ' بريجنيف بوند اليتش',
    itemTwo: ' رئيس الاتحاد س خلفا الخروتشون 19 , 1982 معروف بمبدئه ( مبدأ بريجنيف كان وراء العديد من التدخلات العسكرية السوفيتية في الخارج مثل براغ 1968 أفغانستان 1978 .',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'غورباتشوف ميخائيل ',
    itemTwo: 'أخر رئيس الاتحاد السوفياتي 1985 . 1990 . اشتهر بسياسة البريستوريكا و الغلاسنوست . وقع العديد من الاتفاقيات التي أدت إلى إنهاء الحرب الباردة في 1990 منح جائزة نوبل للسلام ',
    wihda: 1,
  ),
  Chakhsiya(
    itemOne: 'مصالي الحاج ',
    itemTwo: ' 1898 - 1974  زعيم التيار الاستقلالي و أول من طالب به رمز للوطوالتحرر في الشمال الإفريقي ، مؤسس نجم شمال افريقيا ثم حزب الشعب ثم حركة الانتصار للحريات الديمقراطية غير أن موقفه كان سلبيا من الثورة ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'فرحات  عباس ',
    itemTwo: ' 1899 - 1985  أول رئيس للحكومة المؤقتة 1958 احد قادة التيار الإدماجي شارك في صياغة بيان فيفري 1943 التحق بالثورة سنة 1956 أسس الاتحاد الديمقراطي للبيان الجزائري ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' أحمد بن بلة',
    itemTwo: '1918 - 2013  أول رئيس للجزائر المستقلة 1962 - 1965 مناضل في حزب الشعب وحركة أح د ترأس المنظمة الخاصة احد مجري الثورة التحريرية تم اعتقاله في عملية القرصنة الجوية الشهيرة  1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'بن يوسف بن خدة',
    itemTwo: '1923 - 2003 رئيس الحكومة المؤقتة الجزائرية من 1961 1962 مناضل في حزب الشعب و حركة احد ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'مصطفى بن بلعيد',
    itemTwo: ' 1917 - 1956  مناضل في حزب الشعب و حركة احد عضو لجنة 22 و لجنة 6 قائد الولاية الأولى القي عليه القبض وسجن بقسنطينة أستشهد في 22 مارس 1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' العربي بن مهيدي',
    itemTwo: ' 1923 - 1957 قائد الولاية الخامسة - وهران - أشرف على إضراب السبعة أيام بالعاصمة ، ألقي عليه القبض في 23 فيفري 1957 بمدينة الجزائر أستشهد بالسجن تحت التعذيب يوم 03 مارس 1957',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'ديدوش مراد',
    itemTwo: ' 1927 - 1956  انخرط في حزب الشعب الجزائري سنة 1943 ساهم في تكوين المنظمة السرية من مفجري الثورة عين قائدا للولاية الثانية ، قاد معركة قرب قرية سمندو  و في ولاية سكيكدة في 18 جانفي 1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' زيغود يوسف',
    itemTwo: '1956 - 1921 مناضل بحزب الشعب و عضو المنظمة الخاصة و اللجنة الثورية للوحدة والعمل من مفجري الثورة نظم الهجوم 20 أوت 1955 ثم عين عضوا بالمجلس الوطني للثورة الجزائرية استشهد يوم 25 سبتمبر 1956',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'محمد بوضياف ',
    itemTwo: ' 1919 - 1992 انظم الى صفوف حزب الشعب ثم عضوا في المنظمة السرية، عضو مجموعة 22 اعتقل في حادثة اختطاف الطائرة 22 أكتوبر 1956 إلى غاية وقف إطلاق استدعي لينصب رئيسا 1992 توفي مقتولا سنة 1994',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'كريم بلقاصح ',
    itemTwo: '1922 - 1970  مناضل بحزب الشعب منذ 1947 و عضو مجموعة 6 كان احد مفجري الثورة و قاد العمليات في منطقة القبائل',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'رابح بيطاط',
    itemTwo: '1925 - 2000  ناضل في صفوف حركة الانتصار للحريات الديمقراطية عضو في اللجنة الثورية اللوحدة والعمل وهو عضو في مجموعة 22 ومجموعة 9 اعتقل سنة 1955 و بعد وقف إطلاق النار أطلق سراحه تولى رئاسة المجلس الشعبي الوطني إلى غاية 1990',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' حسين ايت احمد ',
    itemTwo: '1926  انضم إلى صفوف حزب الشعب وعند إنشاء المنظمة الخاصة كان من ابرز عناصرها انتقل إلى القاهرة رفقة محمد خيضر 1951 واعتقل في حادثة اختطاف الطائرة ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' محمد خيضر',
    itemTwo: '1912 - 1967  انخرط في صفوف نجم شمال أفريقيا ثم حزب الشعب الجزائري لجا إلى القاهرة 1951 وأصبح مندوبا لحركة انتصار الحريات الديمقراطية ثم احد عناصر المنظمة الخاصة وكان من بين المختطفين في حادثة الطائرة 1956 ',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'شارل ديغول',
    itemTwo: '1890 - 1970  سياسي وجنرال فرنسي مؤسس الجمهورية الفرنسية الخامسة عام 1958 . حاول ضرب الثورة بسياسته التي جمعت بين القمع والإغراء ومحاولة الاختراق وأخيرا وقع اتفاقيات ايفيان مع جبهة التحرير الوطني . مما أنقذ فرنسا . توفي سنة 1970',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: ' جاك سوستال',
    itemTwo: ' 1912  عين واليا عاما على الجزائر سنة 1955 و هو صاحب مشروع سوستال نصب نفسه مدافعا عن الجزائر الفرنسية ، وسياسة الإدماج عينه ديغول سنة 1958 بوزارة الإعلام ثم الوزارة المنتدبة للصحراء',
    wihda: 2,
  ),
  Chakhsiya(
    itemOne: 'المهاتما غاندي ',
    itemTwo: '1869 -  1948  داعية وطني وزعيم هندي ناضل ضد الوجود البريطاني و اشتهر باستخدام اسلوب اللاعنف في نضاله . اغتيل من طرف متطرف ، هندوسي عام 1948',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' جواهر لالا نهرو ',
    itemTwo: '1889 - 1964 رجل سياسة هندي و تلميذ غاندي من صانعي استقلال الهند شغل منصب الوزير الأول « 19 1967 ) و كان من أبرز أقطاب حركة عدم الانحياز',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'محمد علي جناح',
    itemTwo: '1876 - 1948  مناضل تحرري وسياسي باكستاني ناضل لتحرير شبه القارة الهندية من الوجود البريطاني و كان شريكا لغاندي و نهرو و عمل على الانفصال عن الهند في اطار دول باكستان سنة 1947 التي نصب رئيسا لها',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' هوشي منه',
    itemTwo: '1890 - 1969  مؤسس الحزب الشيوعي الفيتنامي قاد حربا ضد الوجود الفرنسي من 1946 ثم تزعم الحرب ضد الحكومة العميلة في الفيتنام الجنوبي وضد الولايات المتحدة عام 1960 وانتهت بانتصار الشماليين وانسحاب الو . م . أ وتوحيد البلاد رسميا عام في أفريل 1975',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'جمال عبد الناصر',
    itemTwo: ' 1918 - 1970  انظم لتنظيم الضباط الأحرار الذي اطاح بالملك فاروق 1952 أصبح رئيسا للجمهورية عام من أهم انجازاته تأميم قناة السويس و بناء السد العالي في عهد كانت هزيمة حرب 1967 توفي 1970',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' أرنستو شي غيفارا',
    itemTwo: '1928 - 1967 طبيب و ثوري ماركسي من أصل أرجنتيني شارك في الثورة الكوبية إلى جانب كاسترو 1956 - 1959 حاول التأسيس لثورة شاملة في أمريكا اللاتينية ضد الهيمنة الأمريكية و الموالين لها  أصبح رمزا عالميا و قتل في بوليفيا سنة 1967',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'فيدل كاسترو ',
    itemTwo: '1926 ثائر و سياسي كوبي - قاد الثورة ضد - باتيستا - قوبلت سياسته بالعداء من طرف الولايات المتحدة التي حاولت الإطاحة به - عملية خليج الخنازير 1961 - تقارب مع السوفيت مما أدى إلى وقوع أزمة الصواريخ 1962 . كان صديقا مقربا للجزائر في عهد هواري بومدين ',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: ' باتريس لومومبا',
    itemTwo: ' 1925 - 1961 سياسي كنغولي ناضل من أجل استقلال بلاده عن الاستعمار البلجكي أصبح وزيرا أولا بعد الاستقلال 1960 سعى من أجل استعادة السيادة على إقليم كاتنغا الغني بالثروات الطبيعية ، اغتيل 1961 وتتهم المخابرات الأمريكية بمقتله ',
    wihda: 3,
  ),
  Chakhsiya(
    itemOne: 'ياسر عرفات',
    itemTwo: '1929 - 2004  رمز لحركة النضال الفلسطيني و أحد مؤسسي حركة فتح و قائدها العام منذ 1969 اسمة الحققيا محمد عبد الرؤوف عرفات الملقب ابو عمار حاصل على جائزة نوبل للسلام عام 1994 رئيس السلطة الوطنية الفلسطينية المنتخب 1996 توفي في ظروف غامضة في نوفمبر 2004',
    wihda: 3,
  ),
  
];
