import 'package:flutter/material.dart';
import 'package:photo_view/photo_view.dart';

myImage(String url) {
  return Container(
      height: 250,
      child: PhotoView(
          imageProvider: AssetImage(url),
          backgroundDecoration: BoxDecoration(color: Colors.amber[200])));
}

Container wad3iya1 = Container(
  child: Column(
    children: <Widget>[
      _h1Text('تحديد معايير تشكل العالم'),
      _h2Text('التاريخية والسياسية'),
      _normalText(
          '-إعادة رسم الخارطة السياسية لأوروبا والعالم  \n-الإعلان عن تأسيس هيئة الأمم المتحدة 1945 / 1024 كأداة لحفظ الأمن والسلام في العالم    \n-تقسيم ألمانيا واوروبا ثم العالم إلى شرق شيوعي وغرب رأسمالي - مؤتمر يالطا 11 / 04 فيفري 1945 م   \n-انتقال الزعامة العالمية من أوروبا الاستعمارية إلى الولايات المتحدة والاتحاد السوفيتي  \n-بروز موجة حركات التحرر في اغلب المستعمرات \n'),
      _h2Text('الاقتصادية'),
      _normalText(
          '- بروز نظام اقتصادي دولي جديد استنادا لاتفاقية -بروتن  وودز- جويلية 1944 م وظهور صندوق النقد الدولي والبنك العالي للإنشاء والتعمير\n- خروج الولايات المتحدة كأكبر مستفيد اقتصاديا من الحرب واستحواذها على % 80 من احتياطي الذهب العالمي\n-انتشار النظام الاشتراكي في اوروبا الشرقية والديمقراطيات الشعبية - الصين وفيتنام وكوريا الشمالية ... \n- اشتداد التنافس على الأسواق وبروز ظاهرة التكتلات الاقتصادية \n'),
      _h2Text('الاجتماعية'),
      _normalText(
          '- ضخامة الحصيلة البشرية 55 م قتيل و ملايين المشردين والمعطوبين والأيتام \n-الدمار الكبير في البنى التحتية والعمرانية والمنشآت الاقتصادية . \n-انتشار الأوبئة والآفات والبطالة \n'),
      _h2Text('العلمية و التكنولوجية'),
      _normalText(
          '- تطوير الترسانة العسكرية بعد تفجير الذرة\n- وتطور العلوم والتكنولوجيا\n- بعيد و غزو الفضاء وتطور وسائل الاتصال والمعلوماتية\n'),
      SizedBox(
        height: 20,
      ),
      myImage('media/maps/east_west.jpg'),
      SizedBox(
        height: 20,
      ),
      _h1Text('دراسة وتحديد طبيعة العلاقات بين الكتلتين'),
      _normalText(
          'كانت العلاقات بينهما علاقة صراع في إطار ما بعرف بالحرب الباردة وهي عبارة عن صراع إيديولوجي واستراتيجي بين المعسكر الشرقي الشيوعي بزعامة الاتحاد السوفييتي والغربي الرأسمالي بزعامة الولايات المتحدة الأمريكية ، استخدمت فيه مختلف الوسائل ماعدا الواجهة المباشرة '),
      _h2Text('أسباب الصراع بين المعسكرين - أسباب الحرب الباردة -'),
      _normalText(
          ' - الاختلاف الإيديولوجي بين الرأسمالية والشيوعية\n- توسع الاتحاد السوفيتي في اوروبا الشرقية وإقامة أنظمة موالية له ( الديمقراطيات الشعبية ) \n- تصادم المصالح ورغبة كل طرف في فرض هيمنته ونظامه على العالم \n- زوال الخطر المشترك بين الطرفين وهر النازية بانهزام المانيا ونهاية الحرب العالمية الثانية 1945 م\n- حدوث أزمات دولية بسبب الأحزاب الشيوعية خاصة في اليونان وتركيا ومناطق أخرى من أوروبا والعالم \n'),
      _h2Text('ومن هذه الوسائل - وسائل الحرب الباردة –'),
      _normalText(
          '- تقديم الدعم الاقتصادي والمالي - سياسة المشاريع الاقتصادية - \n- السياق تحو التسلح وامتلاك الأسلحة الفتاكة \n- نشر القواعد العسكرية \n- تأسيس الأحلاف العسكرية - الحلف الأطلسي أفريل 1949 وحلف وارسو في ماي 1955 -\n- إثارة الحروب الإقليمية والأهلية وتنظيم الانقلابات العسكرية \n- الجوسسة والجوسسة المضادة   \n  - الدعاية الإعلامية المغرضة\n'),
      _h1Text('إبراز الاستراتيجيات الخاصة بكل كتلة'),
      _h2Text('إستراتيجية - وسائل المعسكر الغربي –'),
      _h3Text('اقتصاديا وسياسيا : '),
      _h4Text('مبدأ ترومان:'),
      _normalText(
          ' نسبة إلى الرئيس هاري ترومان اعلن عنه في 12 مارس 1947 وهو يقضي بتقديم مساعدات بقيمة 400 مليون دولار لبعض الدول لمواجهة الزحف الشرعي إستفادت منه خاصة اليونان وتركيا'),
      _h4Text('مشروع مارشال 05 جوان 1947 : '),
      _normalText(
          'مساعدة مالية قيمتها  اكثر من 12 مليار دولار عرضها جورج مارشال وزير خارجية الولايات المتحدة على الدول الأوروبية من أجل تحقيق الأهداف التالية :'),
      _h5Text('الظاهرة:'),
      _normalText(
          '- إعادة تعمير اوروبا وإنعاشها اقتصاديا \n- التخلص من آثار الحرب العالمية الثانية \n- مساندة الدول الديمقراطية في اوروبا \n'),
      _h5Text('الخفية:'),
      _normalText(
          ' - مقاومة المد الشيوعي في أوروبا\n- ربط الاقتصاد الأوربي بالاقتصاد الأمريكي وتثبيت الرأسمالية في اوروبا \n- فرض الهيمنة والوصاية الأمريكية على أوروبا \n- دعم وإنعاش الشركات الأمريكية المفلسة \n- التخلص من فائض الإنتاج \n- إضعاف الارتباط بين الدول الأوروبية المستفيدة من المشروع والاتحاد السوفييتي\n'),
      _h4Text('مشروع إيزنهاور 05 جانفي 1957:'),
      _normalText(
          '  نسبة إلى الرئيس إيزنهاور وهو يقضي بتقديم مساعدات بقيمة 200 مليون دولار لدول أسيا والشرق العربي في إطار كسب دول حليفة في المنطقة وصد الشيوعية هناك '),
      _h3Text('عسكريا:'),
      _h4Text('- حلف الشمال الأطلسي -الناتو- :'),
      _normalText(
          'تأسس في 04 أفريل 1949 بواشنطن بزعامة الو.م.أ وهو حلف عسكري كان يضم الولايات المتحدة وكندا وبريطانيا وفرنسا وألمانيا الغربية ودول البنيلوكس والنرويج والدانمرك وأيسلندا وايطاليا و تركيا واليونان والبرتغال واسبانيا واليابان ، توسع حاليا إلى دول أوروبا الشرقية بعد زوال الحرب الباردة ويتم حاليا 28 دولة وعدد من الدول الخليفة 2'),
      _h4Text('- حلف جنوب شرق آسيا - سياتو -:'),
      _normalText(
          'تأسس في 5  سبتمبر 1954 بضم الولايات المتحدة وفرنسا ونيوزيلندا واستراليا والفلبين وتايلاندا بهدف محاربة الشيوعية في المنطقة والتصدي لها '),
      _h4Text(' حلف بغداد :'),
      _normalText(
          ' تأسس في 24 فيفري 1955 وضم العراق وتركيا وبريطانيا وباكستان وإيران تم  تحويل ����ركزه إلى تركيا وأصبح يعرف بالحلف المركزي -سانتو- بعد انسحاب العراق منه سنة 1958 م '),
      SizedBox(
        height: 15,
      ),
      myImage('media/maps/a7laf.jpg'),
      SizedBox(
        height: 15,
      ),
      _h2Text('استراتيجية المعسكر الشرقي : '),
      _h3Text('عسكريا:'),
      _h4Text('حلف وارسو 14 ماي 1955 :'),
      _normalText(
          'سمي كذلك نسبة إلى فرصوفيا عاصمة بولونيا مقر الحلف ، جاء كرد فعل على الأحلاف الغربية وضم الاتحاد السوفييتي وأوروبا الشرقية ماعدا يوغسلافيا ، وقد كان لتفجير الاتحاد السوفيتي القنبلة الذرية في 21 / 09 / 1949 أثر كبير في قوة الملف والمعسكر الشرقي على العموم'),
      SizedBox(
        height: 15,
      ),
      myImage('media/maps/some_countries.jpg'),
      SizedBox(
        height: 15,
      ),
      _h3Text('اقتصاديا وسياسيا : '),
      _h4Text(' منظمة الكوميكون:'),
      _normalText(
          ' ويعني مجلس التعاون او منظمة التعاون والتبادل الحر بين الاتحاد السوفييتي وأوروبا الشرقية تأسست في 25 جانفي 1949 م كرد فعل على مشروع مارشال اهدافها : - تنشيط التبادل التجاري بين دول المعسكر - إقامة سوق حرة للتبادل التجاري بين دول المعسكر -حلت في 28 جوان 1991 –'),
      _h4Text(' مكتب الكومنفورم:'),
      _normalText(
          ' ويعني - مكتب الإعلام الشيوعي - أعلن عنه في 06 / 05 أكتوبر 1947 مهمته تنسيق التعاون بين الأحزاب الشيوعية في العالم والدعاية المناهضة الرأسمالية'),
      _h4Text('مبدا جدا نوف:'),
      _normalText(
          'ينسب إلى رجل الدولة السوفيتي أندري جدا نوف جاء للرد على مشروع مارشال الأمريكي ويعرف مشروع بلشفة أوربا الشرقية ، تم الاعلان عنه أثناء انعقاد المؤتمر الدولي للأحزاب الشيوعية في 22 سبتمبر 1947 ببولونيا وتم نشره في الصحف بتاريخ 1947 / 10 / 05 ، وهو بقسم العالم إلى قسمين الأول ديمقراطي ويقصد به المعسكر الشرقي اما الثاني فامبريالي ويقصد يه المعسكر الغربي'),
      _h4Text(' تدعيم حركات التحرر'),
      _normalText(
          ' قدم السوفيات دعما كبيرا لحركات التحرر في المستعمرات - سياسي ومادي - من أجل إضعاف الدول الرأسمالية الاستعمارية من جهة وأملا في كسب تلك الشعوب بعد استقلالها في صف الذهب الشيوعي من جهة أخرى '),
      _h1Text('نتائج الصراع وانعكاساته على العالم'),
      _h2Text('على المعسكرين:'),
      _normalText(
          '- اشتداد التوتر بين المعسكرين وظهور أزمات دولية خطيرة . \n - توازن قوى الرعب النووي - تخرف كل معسكر من مواجهة الأخر -\n - فشل سياسة الاحتواء -انشاط الحركات التحررية –\n - الاستفادة من التطور العلمي والتكنولوجي \n - الخسائر المادية والبشرية -  بفعل الجوسسة... الدعاية -\n - ظهور المعارضة داخل المعسكرين - خروج يوغسلافيا عن نهج الاتحاد السوفييتي وخروج فرنسا من الحلف الأطلسي بسبب الخلافات–  \n - ظهور الانفراج الدولي - سياسة التعايش السلمي -  \n - تصدع الاتحاد السوفيتي والمعسكر الشرقي في نهاية الثمانينات\n '),
      _h2Text('على دول العالم:'),
      _normalText(
          ' - التقارب الافروآسيوي وظهور حركة عدم الانحياز 1961 . \n - انقسام العديد من الشعوب بفعل الحرب الباردة مثل كوريا - فيتنام - المانيا ۔\n - ازدياد نشاط الحركات التحررية في العالم الثالث وتلقي الدعم من المعسكر الشرقي\n '),
      SizedBox(
        height: 15,
      ),
      myImage('media/maps/europe.jpg'),
      SizedBox(
        height: 15,
      ),
    ],
  ),
);
Container wad3iya2 = Container(
  child: Column(
    children: <Widget>[
      _h3Text('مقدمة'),
      _normalText(
          ' أدت الحرب الباردة إلى تصاعد بؤر التوتر في كافة أرجاء العالم ، ففي أوروبا نشبت سنة 1946 ازمة اليونان بسبب رغبة العصابات الشيوعية قلب نظام الحكم ما أدى إلى تدخل الغرب - مبدأ ترومان -  وفي إيران حصل توتر آخر سنة 1946 بسبب تماطل الاتحاد السوفيتي في سحب جيوشه منها ما ادى بالغرب إلى الضغط عليه حتى الانسحاب \nولكن من اخطر الأزمات الدولية - أزمتي برلين في أوروبا و  أزمة كوريا في أسيا ازمة السويس في إفريقيا ، أزمة كوبا في أمريكا - '),
      _h1Text('1- خارطة الأزمات الدولية وتأثير كل منها على العلاقات الدولية '),
      _h2Text('في أوروبا '),
      _h3Text(' أزمة برلين الأولى : 1948 1949 : '),
      _normalText(
          'تم تقسيم برلين وألمانيا في مؤتمر « بوتسدام » 17 جويلية إلى 02 أوت 1945 إلى مناطق  نفوذ بين الولايات المتحدة بريطانيا الاتحاد السوفيتي وفرنسا ،  فنال الاتحاد السوفيتي المانيا الشرقية وشرقي برلين ، بينما تقاسم الحلفاء المانيا الغربية وبرلين الغربية '),
      _h4Text('أسبابها : '),
      _normalText(
          ' محاولة الحلفاء في مؤتمر لندن 03 جوان 1946 توحيد ألمانيا الغربية مما أغضب الاتحاد السوفييتي الذي فرض حصارا على برلين الغربية في 23 جوان 1948 ، وكان رد فعل الحلفاء تنظيم جسر جوي لإمداد سكان برلين الغربية بالمؤن و البنزين لمدة 324 يوم '),
      _h4Text('نتائجها:'),
      _normalText(
          ' الاتفاق على رفع الاتحاد السوفييتي لحصاره عن برلين \n تقسيم ألمانيا إلى دولتين هما ألمانيا الفدرالية الغربية في 1949-05-23 و ألمانيا الديموقراطية في 07 أكتوبر 1949.'),
      _h3Text(' أزمة برلين الثانية 1961 :'),
      _h4Text('أسبابها : '),
      _normalText(
          '- رفض الغرب جعل برلين منطقة حرة ومنزوعة السلاح كما ألح عليه خروشوف \n- هروب ونزح ألاف الألمان من برلين الشرقية إلى الغربية '),
      _h4Text('نتائجها:'),
      _normalText(
          'قيام الاتحاد السوفييتي ببناء جدار برلين في 13 اوت 1961 والفاصل بين شطري المدينة , وقد بلغ طول الجدار 165.7 كلم وفيه 210 برج للمراقبة وارتفاعه 3.2 م وقد اشرف على بنائه انريك هوئيكر الذي اصبح رئيسا لألمانيا الشرقية من 1971 الى 1989 .'),
      _h2Text('في آسيا  '),
      _h3Text('أزمة كوريا 1953 - 1950 :'),
      _normalText(
          ' قسمت كوريا بعد تحريرها من الاحتلال الياباني إلى دولتين وذلك في مؤتمر بوتسدام 1945 ، اعتمادا على الخط الوهمي °38 شمالا ، فظهرت في الشمال جمهورية كوريا الشعبية برياسة كميل سونغ وعاصمتها بيونغ يونغ ، وفي الجنوب جمهورية كوريا الرأسمالية  بزعامة ومنع سينغ مانري  وعاصمتها سيول '),
      _h4Text('أسبابها : '),
      _normalText(
          'اجتياح كوريا الشمالية لكوريا الجنوبية في 25 جوان 1950 رغبة منها في توحيد الكوريتين وبدعم من المعسكر الشرقي ، مما أدى إلى تدخل الولايات المتحدة وحلفائها عن طريق هيئة الأم المتحدة القرار- 84 القاضي بتشكيل قوات اممية لتحرير كوريا الجنوبية وكان 90 بالمائة من الجنود الأمريكان - وتدخلت الصين - 2 . 3 مليون متطوع '),
      _h4Text('نتائجها:'),
      _normalText(
          '- عقد هدنة بانمجيوم - على الحدود بين الكوريتين في 27 جويلية 1953 والتي انهت الحرب بعودة الجبوش الكورية الشمالية إلى ما وراء الخط * 38 شمالا  /n- إنشاء منطقة منزوعة السلاح طولها 249 كلم عند الخط 38 شمالا وعرضها 4 كلم /n- خلفت الحرب حسب بعض المصادر اكثر من 04 ملايين قتيل معظمهم مدنيين وكرست تقسييم الشعب الكوري وكوريا إلى دولتين متعاديتين إلى يومنا هذا/n '),
      _h2Text('في افريقيا  '),
      _h3Text(' أزمة السويس 1956 :'),
      _normalText(
          'تمتد قناة السويس على مسافة 173 كلم و عرضها 190 م وهي تصل البحر الاحمر بالبحر الابيض المتوسط اي انها منطقة عبور إستراتيجية وكانت تحت إشراف بريطانيا'),
      _h4Text('أسبابها : '),
      _normalText(
          'قيام جمال عبد الناصر بتأميم القناة في 26 جويلية 1956 رغبة منه في تحقيق السيادة على القناة وانتقاما من الغرب والولايات المتحدة التي اوقفت المساعدات التي كانت موجهة لبناء السد العالي بعد صفقة السلاح المصرية مع تشيكوسلوفاكيا 1955 ، فقررت بريطانيا وفرنسا وإسرائيل شن العدوان الثلاثي على مصر بداية من 29 أكتوبر 1956 ليتوقف الاعتداء في 05 نوفمبر 1956 نتيجة تهديد السوفييت يقصف عواصم الدول المعتدية بالسلاح النووي ومعارضة الولايات المتحدة للعدوان'),
      _h4Text('نتائجها وانعكاساتها :'),
      _normalText(
          '- نهاية النفوذ الفرنسي البريطاني في المنطقة \n- تصاعد الوجود الأمريكي في المنطقة - مشروع إيزنهاور 1957 ضمن سياسية ملء الفراغ \n- تغلغل السوفييت في المنطقة ودعمهم للأنظمة الاشتراكية . \n- تحول مصر إلى قلعة للنضال ضد الإمبريالية وجمال عبد الناصر إلى زعيم قومي \n- هروب 75 ألف يهودي من مصر الى إسرائيل - فلسطين المحتلة –\n'),
      _h2Text('في أمريكا  '),
      _h3Text(' أزمة كوبا 1962 :'),
      _normalText(
          ' تبعد كوبا ب 135 كلم من سواحل فلوريدا وفي جانفي 1959 نجح الشيوعي - فيدال كاسترو - في الإطاحة بالدكتاتور - باتيستا -وتقرب من الاتحاد السوفييتي وأعلن عداءه للغرب .'),
      _h4Text('أسبابها : '),
      _normalText(
          ' - تحول كوبا إلى النظام الشيوعي وطردها للشركات الأمريكية وتأميم ممتلكاتها \n- قطعها لعلاقاتها مع الولايات المتحدة التي دبرت محاولة الانقلاب الفاشلة المعروفة بخليج الخنازير في 17 افريل 1961 بعد تسليحها للمعارضة . \n- اكتشاف طائرات التجسس الأمريكية  لمنصات الصواريخ السوفيتية على التراب الكوبي وكان ذلك في 14 أكتوبر 1962 .\n- إعلان الولايات المتحدة حصار كوبا في 22 أكتوبر 1962 فتحركت 30 سفينة حربية سوفيتية لفك الحصار عنها ، مما أدى إلى تأزم الوضع الذي أصبح ينذر بحرب شاملة بين المعسكرين \n'),
      _h4Text('نتائجها وانعكاساتها :'),
      _normalText(
          '- تدخل هيئة الأمم وعقد لقاءات ومفاوضات بين الولايات المتحدة والاتحاد السوفييتي أفضت إلى سحب السوفييت للصواريخ من كوبا مقابل سحب الأمريكان للصواريخ من تركيا \n- إنشاء ما يعرف بالخط الأحمر بين موسكو وواشنطن 1963 ، وتبني الطرفين لسياسة الانفراج الدولي\n- خروج كوبا وزعيمها  فيدال كاسترو منتصرة من الأزمة وتحول كوبا إلى قلعة مساندة لحركات التحرر في العالم الثالث \n'),
      SizedBox(
        height: 20,
      ),
      myImage('media/maps/azamat_dowaliya.jpg'),
      SizedBox(
        height: 20,
      ),
    ],
  ),
);
Container wad3iya3 = Container(
  child: Column(
    children: <Widget>[
      _h1Text(' مفهوم سياسة التعايش السلمي'),
      _normalText(
          'هو مصطلح سياسي يقصد به إبعاد شبح الحرب الساخنة كوسيلة لتسوية الخلافات الدولية وحلها بالطرق السلمية والحوار مع القبول بازدواجية النظام الدولي في ظل التعايش وتبادل المصالح والمنافع ، ظهر المصطلح سنة 1956 م ، وأول من نادى به الرئيس السوفييتي  نيكيتا خروشوف'),
      _h2Text('الانفراج الدولي:'),
      _normalText(
          'هي وصف لطبيعة علاقات المعسكرين بعد تسوية أزمة كوبا الخطيرة 1962 م ، حيث تخلص خلالها المعسكران من حالة التوتر والاحتقان اللذان وصلا إليهما بفعل اشتداد ازمات الحرب الباردة ، وقد عرفها بعض الخبراء بذوبان الجليد بين المعسكرين '),
      _h1Text('دراسة عوامل الجنوح إلى السلم'),
      _h2Text('العوامل داخلية خاصة بالعسكرين:'),
      _normalText(
          ' - تبدل القيادة في الاتحاد السوفييتي بموت ستالين في 05 مارس 1953 وكدلك نهاية عهدة الرئيس ترومان  واستخلافه بايزنهاور في الولايات المتحدة في 4 نوفمبر 1953 .\n- التنافس في مجال غزو الفضاء وبداية التعاون بين الطرفين منذ 1972 ، ومن أبرز محطات التنافس:  في 21 أفريل 1961 رحلة أول رائد فضاء إلى الفضاء وهو السوفيتي غاغارين ، وفي 1969 نزول الأمريكي  نيل أمسترونغ على سطح القمر\n- توازن قوة الردع النوري حيث بامتلاك الطرفين السلاح النووي ( الو.م.أ سنة 1945 - أس سنة 1949 ) تاكد كلاهما بخطورة المواجهة النووية عليهما واستحالة تغلب طرف على الأخر .\n- فشل سياسة الاحتواء التي تبنتها الولايات المتحدة الأمريكية في كسب حلفاء جدد ومحاصرة الاتحاد السوفيتي .\n- وصول المعسكرين إلى حافة الهاوية والإفلاس بسبب كثرة التدخلات والنفقات العسكرية والمساعدات الممنوحة لحلفائهم\n - بروز الصين كقوة نووية وابتعادها عن نهج الاتحاد السوفيتي وكثرة الخلافات داخل المعسكرين خاصة بخروج فرنسا من الحلف الأطلسي سنة 1966 وانسحاب يوغسلافيا من المعسكر الشرقي و تأسيسها لحركة عدم الانحياز 1961 ، والدور الكبير الذي لعبه رئيسها  جوزي بروس تيتو في الحركة\n- الأزمات الدولية التي خلفت ملايين الضحايا خاصة في كوريا وفيتنام ووقوف الرأي العام ضد الحرب الباردة خاصة الجمعيات غير الحكومية ودعاة السلام في العالم\n'),
      _h1Text('الظروف الدولية السائدة'),
      _h2Text(' العالم الثالث وكتلة عدم الانحياز:'),
      _normalText(
          'رفضت دول العالم الثالث الدخول في صراع الحرب الباردة وتحويل أراضيها إلى ميدان لتجريب الأسلحة الفتاكة ، لاسيما أنها عانت من الاستعمار وكانت بصدد إعادة البناء والتكوين ، لذلك برزت فكرة التضامن الأفرو آسيوي في مؤتمر « باندونغ » باندونيسيا 24 / 18 أفريل 1955 والذي يعتبر النواة الأولى لحركة عدم الانحياز'),
      _h3Text('مفهومها:'),
      _normalText(
          'هي منظمة دولية ظهرت في 06 / 01 سبتمبر 1961 م ببلغراد اليوغوسلافية ، تشكلت من عدة دول مستقلة حديثا في أمريكا اللاتينية وإفريقيا وآسيا والتي رفضت الانحياز إلى احد المعسكرين وتبنت الحياد الإيجابي إزاء صراع الحرب الباردة بين المعسكرين الرأسمالي والاشتراكي'),
      _h3Text('مبادئها :'),
      _normalText(
          ' - احترام المواثيق والمعاهدات الدولية\n- احترام سيادة الدول واستقلالها واستقرارها\n- احترام حق الشعوب في تقرير مصيرها \n- عدم التدخل في الشؤون الداخلية للدول\n'),
      _h3Text('أهدافها :'),
      _normalText(
          '- العمل على نشر الأمن والسلام في العالم \n- تنمية العلاقات الدولية الودية بين دول العالم\n - مقاومة الاستعمار ومناصرة حركات التحرر في العالم الثالث\n- الدعوة إلى تجنب العنف والقوة في حل الخلافات بين الدول\n'),
      _h3Text(' تطور اهتماماتها منذ مؤتمر الجزائر 9/ 5 نوفمبر 1973 م :'),
      _normalText(
          'سمي المؤتمر الرابع للحركة المنعقد بالجزائر بباندونغ الثاني ، نظرا لأهمية القرارات المتخذة والقضايا التي عالجها المؤتمر وعدد المشاركين - أكثر من 76 رئيس وملك + زعماء 10 حركات تحررية - ، حيث يعتبر المؤتمر نقطة تحول في اهتمامات ومطالب الحركة ، بحيث ادمج الشق الاقتصادي نظرا لخطورة الأوضاع الاقتصادية في دول العالم الثالث وجور النظام الاقتصادي العالي آنذاك ومن أهم قرارات المؤتمر :\n- حق شعوب العالم الثالث في الإشراف على مواردها \n- مطالبتها بتعديل النظام الاقتصادي العالمي الجائر .\n- تأكيدها على ضرورة تحقيق توازن بين أسعار المواد الأولية وأسعار المواد المصنعة \n- الدعوة إلى الحوار والتعاون - شمال جنوب – \n- محاربة الاحتكارات بجميع أنواعها \n'),
      _h1Text('مظاهر التعايش السلمي'),
      _normalText(
          ' - تبادل الزيارات الرسمية - زيارة نائب الرئيس الأمريكي  نيكسون  لموسكو وزيارة  خروتشوف للولايات م أ عام 1959 – \n- إلغاء الاتحاد السوفييني لمكتب الكومنفورم في 1956 وإنشاء الخط الأحمر بين القيادة في موسكو وواشنطن - خروتشوف وكنيدي - بعد ازمة كوبا في اوت 1963 . \n- عقد المعسكرين لمؤتمر الحوار والتعاون الأوروبي بمدينة هلسنكي بفنلندا وكذا التوقيع على وثيقة هلسنكي سنة 1975 ، أكد فيها الجميع على دعم الحوار واحترام سيادة الدول .\n- عقد مؤتمر جنيف للسلام سنة 1955 م بين دول المعسكرين.\n- التوقيع على اتفاقية الحد من انتشار الصواريخ الاستراتيجية بين الاتحاد السوفييتي والولايات المتحدة في اتفاقيتي - سالت الأولى - بموسكو في 72 / 05 / 26 و- سالت الثانية - بفيينا النمساوية في 1979 / 02 / 24 .\n- التعاون الأمريكي السوفيتي في مجال غزو الفضاء .\n- التقارب الاقتصادي بين الصين والولايات المتحدة وبين موسكو واوروبا الغربية\n'),
    ],
  ),
);

Container wad3iya4 = Container(
  child: Column(
    children: <Widget>[
      _h4Text('مفهوم الأحادية القطبية :'),
      _normalText(
          'نظام دولي جديد تتزعمه الولايات المتحدة الأمريكية التي اصبحت تقود العالم بعد انهيار الاتحاد السوفييتي والمعسكر الشرقي ، وقد برز رسميا بعد إعلان نهاية الحرب الباردة في قمة مالطا - 04 / 03 ديسمبر 1989 -  وتم تأكيد زوال الحرب الباردة في قمة باريس 20 نوفمبر 1990 بين الرئيس السوفيتي ميخائيل غورباتشوف والأمريكي جورج بوش '),
      _h1Text('عوامل تفكك الكتلة الشرقية وانهيار المعسكر الشرقي '),
      _h2Text('عوامل داخلية :'),
      _normalText(
          '- اتساع المساحة وصعوبة التضاريس عقد من تحقيق التنمية في مختلف ارجائه \n- تعدد القوميات 32 قومية خلق فتن ونزاعات داخلية كثيرة .\n- فشل التسيير الاشتراكي والركود الاقتصادي وغياب الديمقراطية .\n- ضخامة نفقات التسلح والتدخلات العسكرية أدى إلى إفلاسه .\n- ضعف حلفائه والاعتماد عليه في دعم المعسكر الشرقي .\n- إصلاحات الرئيس ميخائيل غورباتشوف الفاشلة المعروفة -  البريستروبكا والغلاسنوست –\n'),
      _h2Text('عوامل خارجية : '),
      _normalText(
          '- دور الو.م.أ و المعسكر الغربي في حصاره وإثارة المعارضة داخله ودعمها  .\n- سياسة الاحترام والتطويق التي مارسها الغرب ضد الاتحاد السوفيتي .\n- تورط الجيش الأحمر وانهزامه في الحرب الأفغانية - 1989 / 1979 م - .\n- دعم العسكر الغربي للحركات الانفصالية في الاتحاد السوفيتي وأوروبا الشرقية وتشجيع المعارضة .\n- ظهور حركة عدم الانحياز التي كان لها دور كبير في التخفيف من شدة الصراع بين المعسكرين \n'),
      _h1Text('مظاهر التفكك '),
      _normalText(
          '- الأحادية القطبية بانفراد الولايات ما بقيادة العالم وفرض هيمنتها اقتصاديا عسكريا وسياسيا .\n- حدوث التقارب الأمريكي الروسي في الكثير من القضايا - أمن إسرائيل + الحرب ضد العراق وأفغانستان- \n- تراجع دور هيئة الأم المتحدة لفائدة الولايات المتحدة الأمريكية وحلفائها . \n- حل وتسوية الكثير من المشاكل والتوترات الدولية وفق مصالح الدول الكبرى .\n- التحالف الصهيوني الصليبي ضد العالم الإسلامي.\n'),
      _h1Text('ملامح النظام الدولي الجديد'),
      _normalText(
          '- الأحادية القطبية بانفراد الولايات ما بقيادة العالم وفرض هيمنتها اقتصاديا عسكريا وسياسيا .\n- حدوث التقارب الأمريكي الروسي في الكثير من القضايا - أمن إسرائيل + الحرب ضد العراق وأفغانستان- \n- تراجع دور هيئة الأم المتحدة لفائدة الولايات المتحدة الأمريكية وحلفائها . \n- حل وتسوية الكثير من المشاكل والتوترات الدولية وفق مصالح الدول الكبرى .\n- التحالف الصهيوني الصليبي ضد العالم الإسلامي.\n'),
      _h1Text(
          ' مؤسساته الفاعلة : - وسائل الولايات المتحدة لفرض هيمنتها على العالم –'),
      _h2Text('المنظمات الدولية'),
      _normalText(
          'وخاصة الأمم المتحدة وما يتبعها من أجهزة باستغلالها لإضفاء الشرعية الدولية على تدخلاتها ولحصار وضرب ومحاكمة المعارضين والمتمردين عن هيمنتها - مجلس الأمن وحق الفيتو ومحكمة العدل الدولية . . . -'),
      _h2Text('المؤسسات المالية والاقتصادية '),
      _normalText(
          'وتتمثل في صندوق النقد الدولي FMI - البنك العالمي  BM- منظمة التجارة العالمية OMC - التي تستعملها للضغط على دول العالم الثالث وفي كثير من الأحيان لمساومتها منها اقتصاديا وسياسيا والتدخل في شؤونها .'),
      _h2Text('العسكرية '),
      _normalText(
          'ممثلة في الحلف الأطلسي - NATO - كأداة لضرب وحصار الدول التي تعارضها أو تشكل خطرا على مصالحها .'),
      _h2Text('المنظمات غير الحكومية '),
      _normalText(
          'باستغلال التقارير التي تصدرها ( حقوق الإنسان ، الديمقراطية ) كمبرر للتدخل في شؤون الدول - أزمة دارفور في السودان على سبيل المثال لا الحصر –'),
      _h2Text('الشركات متعددة الجنسيات '),
      _normalText(
          'التي تتحكم في الأسواق العالمية وتتلاعب بالأسعار وفي بعض الأحيان تسببت في حروب اهلية بافتعال الأزمات وبيع الأسلحة للمتمردين خاصة في إفريقيا - ليبيريا ، الكونغو ... -  '),
      _h2Text('وسائل الاعلام '),
      _normalText(
          'تعمل على نشر الثقافة الغربية والأطروحات الأمريكية ومحاربة وتشويه كل معارض لها عن طريق الحرب الإعلامية وخير دليل على ذلك قناة- CNN - ودورها في حرب الخليج '),
      _h1Text('دور دول العالم الثالث في النظام الدولي '),
      _normalText(
          'التكتل في حركة عدم الانحياز 1961 ، والتي أصبحت مجرد منبر لإصدار التوصيات والقرارات التي غالبا لا تطبقها دول العالم الثالث نظرا لارتباطها بالغرب - التكتل في منظمة الأوبيك 1960 والتي استطاعت أن تحفظ مصالح الدول الأعضاء رغم محاولة الولايات المتحدة وحلفائها تكسيرها بمجموعة ال 77 - تأسست في 1964 / 04 / 15 - داخل الجمعية العامة للأمم المتحدة للدفاع عن مصالح العالم الثالث ، والتكلم بصوت واحد في المنظمة الأممية  لكن معظم دول العالم الثالث تعاني التبعية والتخلف والمديونية ما اضعف موقفها في هذا النظام الجديد'),
      _h1Text(' اهداف النظام الجديد المعلنة'),
      _normalText(
          '- الشرعية الدولية : أي على جميع الدول التقيد بالمعاهدات والاتفاقيات الدولية وميثاق الأمم المتحدة\n- احترام وحماية حقوق الإنسان \n- الديمقراطية في الوصول إلى السلطة وحرية التعبير .\n- الحرية الاقتصادية -هيمنة الرأسمالية كنظام وحيد في العالم –\n'),
      _h1Text(' أهداف النظام الجديد الخفية'),
      _normalText(
          '- استخدام الولايات المتحدة لحلف الناتو لفرض نظامها بالقوة مثلما فعلت في حرب الخليج ضد العراق . \n- استغلال المؤسسات الدولية كأداة للضغط على دول العالم الثالث وجر دول اوروبا الشرقية وروسيا إلى الحلف الصليبي الجديد ضد العالم الإسلامي \n- محاولة الضغط على العالم الإسلامي للاعتراف بإسرائيل .\n- السيطرة على منابع النفط وثروات العالم الثالث عن طريق الهيمنة الاقتصادية أو إثارة الحروب الأهلية او خلق حجج للتدخل في شؤون العالم الثالث \n'),
    ],
  ),
);

Container wad3iya5 = Container(
  child: Column(
    children: <Widget>[
      _h1Text(
          'اكتشاف حتمية الثورة تبعا لمجريات الأحداث وانعكاساتها على الحركة الوطنية'),
      _h2Text(' مجازر 8  ماي 1945: '),
      _h3Text('أسبابها :'),
      _normalText(
          '- احتفال الجزائريين بنهاية الحرب العالمية الثانية ومطالبة فرنسا الوفاء بوعودها - حق تقرير المصير -\n- تصاعد الوعي الوطني وهو ما تجسد في بيان 10 فيفري 1943 \n- المطالبة بإطلاق سراح المعتقلين وعلى راسهم مصالي الحاج\n- محاولة فرنسا التأكيد على تمسكها بالجزائر والظهور بمظهر القوة العسكرية وإرهاب الشعوب الأخرى\n'),
      _h3Text(' أهداف فرنسا من ارتكابها للمجازر :'),
      _normalText(
          '- التنكر لوعودها ومحاولة تفكيك صفوف الحركة الوطنية .\n- إعادة الاعتبار لجيشها وقوتها التي فقدتها أثناء الحرب العالمية أثناء تعرضها للاستعمار الألماني . \n- ترهيب شعوب المستعمرات كي لا يطالبوا بحق تقرير المصير . \n'),
      _h3Text(' نتائج المجاز وانعكاساتها على الحركة الوطنية: '),
      _normalText(
          "- استشهاد أكثر من 45 ألف شهيد .\n- تزايد كره الجزائريين للمستعمر والمعمرين .\n- حل الأحزاب واعتقال القادة .\n- اهتزاز مكانة فرنسا الدولية .\n-  إعادة بناة الحركة الوطنية بعد صدور قانون العفو العام 09 - 03 – 1946 وفقا لإجراءات التهدئة الفرنسية بعد تلطخ سمعتها داخليا ودوليا على النحو التالي\n:1 - حزب أحباب البيان والحرية ظهر من جديد تحت اسم - الاتحاد الديمقراطي للبيان الجزائري - في 17 أفريل 1946 بزعامة فرحات عباس الذي طالب بالحكم الذاتي \n2 - حزب الشعب ظهر تحت اسم -حركة انتصار الحريات الديمقراطية - في 02 نوفمبر 1946 بزعامة مصالي الحاج الذي حافظ على مطلب الاستقلال\n3 - جمعية العلماء المسلمين واصلت نشاطها بزعامة البشير الإبراهيمي\n4 - الحزب الشيوعي ظهر تحت أسم - احباب الحرية والديمقراطية - بزعامة عمر اوزقان وكان جزءا من الحزب الشيوعي الفرنسي ولا يؤمن بالاستقلال\nولعل من أهم النتائج تأكد الجزائريين بان الحرية تأخذ ولا تعطى وإنشاء المنظمة الخاصة L ' OS في اجتماع 17 / 16 / 15 فيفري 1947 بوزريعة بقية التحضير العمل المسلح.\n"),
      _h1Text('القانون الخاص 1947 الأسباب والغايات والمواقف منه'),
      _normalText(
          'هو مجموعة من القرانين المسيرة لشؤون الجزائر يتكون من 8 ابواب و  60 مادة اقره المجلس الفرنسي والرئيس - فانسون اوريول - في إطار مشروع إصلاحي لدعم السياسة الاستيطانية وهو يدخل في إطار التهدئة بعد مجازر 08 ماي 1945 ، مصدر في 20 سبتمبر 1947 بهدف احتواء الحركة الوطنية ومحاولة تفكيك صفوفها وإدماج الجزائر في فرنسا ومن أهم ما جاء به :\n- الجزائر جزء لا يتجزأ من الأراضي الفرنسية هي تتكون من ثلاث مقاطعات - الجزائر وهران وعنابة –\n- المساواة بين جميع سكان العمالات الجزائرية .\n- يحافظ الجزائري على حالته الإسلامية ، ويخضع للحكم الإسلامي في أحواله الشخصية فقط \n- الحاكم العام يمثل الجمهورية الفرنسية في الجزائر وهو مسؤول أمام الحكومة الفرنسية \n- يؤسس مجلس حكومة مع الحاكم العام ، وظيفته تنفيذ قرارات الجمعية ويتألف من 06 اعضاء \n- تأسيس الجمعية الجزائرية - برلمان - يتكون من 120 عضو 60 من الفرنسيون و 60 من الجزائريون .\n- إزالة الحكم العسكري عن الجنوب والاعتراف باللغة العربية كلغة ثانية بعد الفرنسية\n'),
      _h2Text('المواقف منه:'),
      _h3Text('1 - الكولون - المعمرون –:'),
      _normalText(
          'رحبوا به لأنه منحهم الاستقلال بالجزائر ويجعل منهم حكامها رغم أنهم لم يتجاوزوا 800 الف نسمة مقابل 08 ملايين جزائري'),
      _h3Text('- الحركة الوطنية :'),
      _normalText(
          'رفضته لأنه مشروع إدماجي يربط الجزائر بفرنسا ويساري الأغلبية بالأقلية ولا يلبي المطالب - حق تقرير المصير - كما أن انتخابات أعضاء البرلمان في أفريل 1948 تعرضت للتزوير من طرف الحاكم العام - نايجلان - لصالح المعمرين'),
      _h1Text(' ازمة حركة الانتصار للحريات الديقراطية الأسباب والنتائج '),
      _normalText(
          ' تعرضت الحركة لأزمة حادة أثناء المؤتمر الثاني للحزب بين 04 و06 أفريل 1953 بالجزائر نتيجة لما يلي:\n- اكتشاف أمر المنظمة الخاصة ومتابعة أعضائها وتضيق الخناق عليهم سنة 1950 .\n- اعتقال مصالي الحاج ووضعه في الإقامة الجبرية في فرنسا .\n- خلافات داخل الحزب خاصة بين المصاليين والمركزيين وانقسام الحزب إلى 03 جماعات :\n'),
      _h2Text('1 - المصاليون : '),
      _normalText('يؤيدون استمرار القيادة الفردية للحزب من طرف مصالي الحاج'),
      _h2Text(' 2 - المركزيون :'),
      _normalText(
          'مع مبدأ القيادة الجماعية في الإقرار والتنفيذ وعلى رأسهم يوسف بن خدة'),
      _h2Text('3 - الثوريون : '),
      _normalText(
          'أعضاء سابقين في المنظمة السرية حاولوا لم الشمل وبعد أن فشلوا في ذلك قاموا بإنشاء اللجنة الثورية للوحدة والعمل في 23 - 03 - 1954 والتي ستعقد سلسلة اجتماعات تحضيرا لتفجير الثورة اهمها اجتماع لجنة 22 في 23 جوان 1954 بمنزل السيد - دريش الياس -  بصالمبي ، والذي انبثقت عنه لجنة الستة - العربي بن مهيدي + مصطفى بن بولعيد + محمد بوضياف + كريم بلقاسم ديدوش مراد + رابح بيطاط ـ ثم اجتماع 10 أكتوبر 1954 - لابوائت بيسكاد - بالرايس حميدو في منزل المناضل – كشيدة -  ثم اجتماع 23 اكتوبر 1954 بنفس المكان الذي وضعت فيه اللمسات الأخيرة للثورة - تأسيس جيش و جبهة التحرير +  بيان أول نوفمبر 54 –'),
      _h1Text(' الظروف الإقليمية والدولية لقيام الثورة '),
      _h2Text('محليا:'),
      _normalText(
          ' - مجازر 8 ماي 45 ونتائجها- قناعة الشعب بعدم جدوى العمل السياسي .\n- تشتت الحركة الوطنية خاصة بعد أزمة حركة الانتصار .\n- الوضع الاجتماعي والاقتصادي المزري . \n- اكتساب الجزائريين الخبرة من ماركتهم في الحرب العالمية الثانية .\n'),
      _h2Text('إقليميا ودوليا : '),
      _normalText(
          ' - انتشار المد التحرري في العالم بعد الحرب العالمية الثانية .\n- حصول العديد من الدول على استقلالها كسوريا ولبنان 1946 والهند وباكستان 1947 .\n- اندلاع الثورة في تونس المغرب وانتصار الثورة المصرية 1952 . \n- انهزام فرنسا في معركة ديان بيان فر في ماي 1954 أمام الجيش الفيتنامي بقيادة الجنرال « جياب » وتراجع مكانتها العسكرية بعد الحرب العلمية الثانية . \n- ظهور العديد من المنظمات الدولية والإقليمية التي تدعم حق تقرير المصير مثل هيئة الأمم المتحدة والجامعة العربية 1945 .\n'),
      _h1Text('/ مواثيق الثورة '),
      _h2Text('بيان أول نوفمبر 1954 : '),
      _normalText(
          'أول وأهم مواثيق الثورة الجزائرية حدد معالم وأسباب الثورة ووسائلها وأهدافها البعيدة والقريبة وطالب بضرورة التفاف الشعب حولها وتبنيها .'),
      _h2Text(' ميثاق  الصومام :'),
      _normalText(
          'وثيقة سياسية للثورة الجزائرية صدرت على اثر مؤتمر الصومام الذي عقد ما بين 20 إلى 27 أوت 1956 وقد زود الثورة بالمؤسسات والهياكل التنظيمية السياسية والعسكرية لضمان استمرارها وتحقيقها لأهدافها .'),
      _h2Text('ميثاق  طرابلس :'),
      _normalText(
          ': جاء بعد مؤتمر طرابلس بليبيا في جوان 1962 ، وضع جملة من الاختبارات التي تسير عليها البلاد بعد الاستقلال أهمها اختيار النهج الاشتراكي كوسيلة للتنمية والإبقاء على الأحادية الحزبية .'),
      SizedBox(
        height: 20,
      ),
      myImage('media/maps/algeria.jpg'),
      SizedBox(
        height: 20,
      ),
    ],
  ),
);

Container wad3iya6 = Container(
  child: Column(
    children: <Widget>[
      _h1Text('1- شرح إستراتجية تنفيذ الثورة '),
      _h2Text(' أ- على المستوى الداخلي :'),
      _h3Text('التعبئة الشعبية : '),
      _normalText(
          'يقصد بها قدرة الثورة على حشد واستنفار الجماهير الشعبية بمختلف شرائحها لإنجاحها عن طريق:\n- التوعية الإعلامية من خلال بيان 1 نوفمبر 54 ومختلف الوسائل الإعلامية عن مناشير وكتابات حائطية وصحف و جرائد لتحقيق الالتفاف الشعبي بالثورة n- مساندة الشعب ضد الأساليب والمخططات الإرهابية الاستعمارية \n- الاهتمام بالجانب الصحي والاجتماعي والتعليمي والتكفل بالبعثات الطلابية .\n- تحميل الشعب مسؤولية تنفيذ الثورة طبقا لمقولة العربي بن مهيدي - ارم بالثورة إلى الشارع يحتضنها الشعب -. \n- تنظيم الجماهير وتأطيرها من خلال تأسيس الاتحادات - الاتحاد العام للعمال الجزائريين 24 فيفري 1956 / الاتحاد الوطني للطلبة 13 جويلية 1955 - ، فريق جبهة التحرير لكرة القدم وفدرالية جبهة التحرير بفرنسا لتأطير المهاجرين وإذاعة صوت الجزائر ( صالح بوبنيدر وعيسي مسعودي انطلاقا من القاهرة وتونس ) ووكالة الأنباء الجزائرية سنة 1961 م \n.'),
      _h3Text('المظاهرات والإضرابات  -اهمها - :'),
      _h4Text(' إضراب 8 أيام - 25 جانفي - 04 فبراير1957 -'),
      _normalText(
          'من أهدافه : دفع الشعب للالتفاف أكثر حول الثورة - لفت انظار الراي العام العالمي ورفض الاستعمار'),
      _h4Text('مظاهرات 11 - 12 - 1960 '),
      _normalText(
          'لمواجهة مطالب المعمرين والسياسة الاستعمارية - الضغط على فرنسا ودعم الوفد المفاوض ورفض مبدأ الجزائر فرنسية ، وكان من نتائجها استشهاد 800 جزائري وأكثر من 1000 جريح والتي أكدت للرأي العام العالمي والفرنسي تمسك الشعب بجبهة التحرير الوطني كما أنها أعطت دفعا معنويا وسياسيا كبيرا للوفد المفاوض '),
      _h4Text('مظاهرات 17- 10 - 1961 بباريس '),
      _normalText(
          'ومن أسبابها فشل المفاوضات نظرا لاستمرار فكرة فصل الصحراء عن الشمال - دفع فرنسا إلى الدخول في مفاوضات جدية وكذلك الحضر المفروض على المهاجرين في باريس ، وقد أسفرت عن استشهاد 300 جزائري واعتقال 1200 ولكنها أسهمت في تدويل القضية الجزائرية وأظهرت بشاعة الاستعمار'),
      _h4Text('إضراب الطلب '),
      _normalText('في 19 ماي 1956 م حيث هجروا الدراسة والتحقوا بالثورة'),
      _h3Text('التنظيم العسكري:'),
      _normalText(
          '- تقسيم الجزائر إلى 05 مناطق عسكرية \n- انشاء جيش التحرير الوطني\n- إنشاء قيادة الأركان \n- تحديد الرتب\n- إنشاء جيش الحدود\n- نقل الثورة الى فرنسا \n'),
      _h4Text('هجومات 20 أوت 1955 بالشمال القسنطيني:'),
      _h5Text('ظروفها :'),
      _normalText(
          ' - الحصار المفروض من طرف الاستعمار على الأوراس واعلان حالة الطوارئ 03 أفريل 1955 .\n- استشهاد بعض القادة مثل ديدوش مراد 55 / 01 / 18 واعتقال مصطفى بن بولعيد شهر فيفري 1955 ورابح بيطاط في مارس 1955 .\n- سعي الحكم العام جاك سوستال لبعث مشروعه الاغرائي في المنطقة 1955 بهدف كسب سكانها وأبعادهم عن مساندة الثورة\n- وقد قادها العقيد زيغود يوسف قائد المنطقة الثانية بعد استشهاد ديدوش مراد واستهدفت المستوطنين ومراكز الجيش والشرطة وكانت في وضح النهار وشملت عدة مدن أهمها سكيكدة والقل و قسنطينة وعنابة......\n'),
      _h5Text('أهداف الهجومات :'),
      _normalText(
          '- فك الحصار عن منطقة الأوراس\n- الحصول على السلاح والرد على مجازر العدو .\n- تفنيد ادعاءات واشاعات العدو حول الثورة  .\n- القضاء على أي تردد في الالتحاق بالثورة .\n- التضامن مع المغرب في الذكرى 2 لنفي محمد الخامس .\n- تدويل القضية الجزائرية انعقاد الدورة العاشرة للجمعية العامة للأمم المتحدة في 30/09/1955\n'),
      _h5Text('نتائج الهجومات :'),
      _normalText(
          '- فك الحصار وزيادة الالتفاف الشعبي حول الثورة\n- تأكيد قوة الثورة وتكذيب ادعاءات العدو- قطاع طرق –\n- انطلاق الثورة بالولاية الرابعة هجمات أكتوبر . 1955 .\n- نقل الثورة من الأرياف إلى المدن .\n- مضاعفة القوات الفرنسية 400 الف جندي وارتكاب المجازر راح ضحيتها 1200 شهيد بالمقابل مقتل 127 فرنسيا.\n'),
      _h3Text(' التنظيم المؤسساتي:'),
      _h4Text('مؤتمر الصومام 20 اوت 1956 : '),
      _normalText(
          ' عقد في الولاية الثالثة بقرية ايفري وسط غابات أكفادو التي تشرف على وادي الصومام ( أوزلاقن ) واختير التاريخ احتفالا بالذكرى الأولى لهجومات 20 اوت 1955 م وقد تم اختيار المنطقة لعدة اعتبارات نذكر من بينها : \n- الحصار المفروض على الأوراس\n - توسطها للولايات التاريخية v- تكذيب ادعاءات العدو بالسيطرة على المنطقة . \n- توفر العامل الأمني فهي غير معروفة لدى العدو وبها غطاء نباتي كثيف\n '),
      _h5Text('انعقد في ظروف داخلية ميزها : -'),
      _normalText(
          '- مضي عامين عن انطلاق الثورة وتوالي انتصاراتها . \n- انضمام اعداد كبيرة من مختلف شرائح الشعب للثورة والحاجة إلى تنظيم هياكلها الإدارية والعسكرية . \n- الحاجة الماسة للتقييم والتخطيط للمستقبل . \n- تزايد جرائم الجيش الفرنسي للقضاء على الثورة . \n'),
      _h5Text('الظروف الخارجية :'),
      _normalText(
          '- دعم الكتلة الأفروآسيوية للثورة في مؤتمر باندونغ باندونيسيا 18 - 24 افريل 1955 . \n- استقلال تونس والمغرب مارس 1956 بفعل قرة الثورة الجزائرية . \n- تأميم جمال عبد الناصر لقناة السويس 1956 / 07 / 26 \n'),
      _h5Text('قراراته : '),
      _normalText(
          '- اصدار ميثاق الصومام وهي وثيقة سياسية مرجعية للثورة . \n- تأسيس المجلس الوطني للثورة وهو بمثابة برلمان مشرع للثورة وضم 34 عضوا . \n- إنشاء لجنة التنسيق والتنفيذ بلجان فرعية تابعة لها وهي هيئة تنفيذية. \n- تقسيم الجزائر إلى 6 ولايات عسكرية وتعيين مسؤول برتبة عقيد على كل ولاية وتقسيم كل ولاية إلى مناطق ونواحي ودوائر . \n- إقرار مبدأ القيادة الجماعية والأولوية للداخل على الخارج والسياسي على العسكري . \n- البناء الهيكلي لجيش التحرير الوطني - مسؤوليات - تقسيم - رتب .... \n- تدويل القضية الجزائرية  . \n- وضع مخططات قتالية جديدة والاعتماد على حرب العصابات \n'),
      SizedBox(
        height: 20,
      ),
      myImage('media/maps/algeria2.jpg'),
      SizedBox(
        height: 20,
      ),
      _h5Text('رد فعل الاستعمار:'),
      _normalText(
          '- صب غضبه على البيت الذي عقد فيه المؤتمر فتم تدميره .\n- زيادة على القيام بعمليات تمشيط واسعة ببلاد القبائل والانتقام من سكان المنطقة بمختلف أنواع التعذيب وفرض الحصار وسياسة التجويع عليهم \n'),
      _h2Text(' ب- على المستوى الخارجي: '),
      _normalText(
          ' كانت لدبلوماسية الثورة دور هام على المستوى الخارجي عن طريق تحقيق عدة أعمال وأهداف وهي:\n- التعريف بالقضية في المحافل الدولية .\n- فضح السياسية الفرنسية وعزلها دوليا\n- كسب التعاطف العالمي\n- الحصول على الدعم المادي والسياسي ، وهذا من خلال جهاز دبلوماسي يتشكل من الوفد الخارجي للثورة - حسين أيت ، احمد بن بله ، محمد خيضر وبوضياف - ووفود الجبهة إلى المؤتمرات الدولية .\n- إنشاء الحكومة المؤقتة بالقاهرة في ( 19 - 09 - 1958 ) برئاسة فرحات عباس ووزارة الشؤون الخارجية ووزارة الإعلام ، وإنشاء فدرالية جبهة التحرير بالمهجر\n- المشاركة في المحافل كمؤتمر باندونغ ومؤتمر الأحزاب المغاربية في طنجة 1958 والمشاركة في مؤتمر بلغراد 1961\n- كما اهتمت بالإمدادات بإنشاء وزارة التموين والتسليح اشرف  عليها - امحمد يزيد ومحمود الشريف –\n'),
      _h1Text('رد فعل الاستعمار واستراتيجيته للقضاء على الثورة'),
      _h2Text(' أ- على المستوى الداخلي :'),
      _h3Text('- المخططات العسكرية المختلفة:'),
      _normalText(
          '- عزل حكومة - منديس فرانس - وتولي – ادغارفو- السلطة بفرنسا 1955 / 02 / 23 م \n- تعيين « جاك سوستيل » واليا جديدا على الجزائر 1955 والذي اشتهر بوحشيته وجرائمه .\n- مضاعفة القوات الفرنسية بالجزائر -80000 جندي  سنة 1955 - واعلان حالة الطوارئ في 03/04/1955م\n- الاستعانة بالحلف الأطلسي وبالعملاء وتسليح المعمرين\n- إنشاء المناطق المحرمة في الأرياف لعزل الثورة عن الشعب\n- القمع والإيقاف الجماعي\n- إنشاء الفرق الإدارية الخاصة SAS لغرض التفتيش والتعذيب ، والزج بالجزائريين في المحتشدات\n- انجاز خطي موريس وشال وهما خطين مكهربين وملغمين على الحدود الشرقية والغربية للبلاد\n- الحزام في الولاية الرابعة 1959 - عملية المنظار بالولاية الثالثة و 1959 ...\n- استعمال الأسلحة المحرمة دوليا بما فيها النابالم\n- تطبيق مخطط الجنرال شال ، وهو عبارة عن مجموعة من العمليات العسكرية الكبرى منها عملية التاج بالولاية الخامسة سنة 1959'),
      _h3Text('- المخططات الاغرائية:'),
      _normalText(
          'عبارة عن مناورات كانت تهدف الى عزل الشعب عن الثورة وإغرائه اهمها :'),
      _h4Text(' مشروع سوستال :'),
      _normalText(
          ' نسبة إلى صاحبه - جاك سوستال - الوالي العام للجزائر 1955 وهو مشروع إصلاحي تتناول جوانب إدارية واقتصادية واجتماعية وثقافية بهدف دمج الجزائريين بفرنسا وجعلهم يتخلون عن الثورة \nوبعد احداث 1958 / 05 / 13 والتي كانت عبارة عن تمرد قادة الجيش الفرنسي مع المعمرين ضد باريس وصل « شارل ديغول » إلى الحكم في فرنسا في 1958 / 06 / 01 وبذلك سقطت الجمهورية الرابعة حكومة بيار بيليملان  وجاءت الجمهورية الخامسة بزعامة ديغول الذي قام بجملة من الإجراءات لقمع الثورة نذكر من بينها - إجراءات الجمهورية الخامسة -.'),
      _h4Text('مشروع قسنطينة :'),
      _normalText(
          'هو مشروع استعماري دعاني أعلنه - شارل ديغول - في 4 / 3 أكتوبر 1958 بقسنطينة وتضمن بناء 200 ألف مسكن وتوزيع 250 ألف هكتار من الأراضي على الجزائريين وتوظيف 400 الف منهم وبناء المدارس خلال خمس سنوات 1959 - 1963 - الأهداف المعلنة للمشروع –\nأما الأهداف الخفية فهي إفشال الثورة وفصل الشعب عنها وخلق فئة من المتغربين الجزائريين والبورجوازيين المدافعين عن فرنسا وكذلك الإظهار للعالم أن سبب الثورة اجتماعي واقتصادي فقط وليست حركة تحررية '),
      _h3Text('- المخططات السياسية - '),
      _normalText(
          '- انشاء القوة الثالثة من العملاء التمثيل الجزائريين والتكلم باسمهم \n- عرض مشروع سلم الشجعان 23 - 10 - 1958 \n- طرح مشروع حق تقرير المصير 16 - 09 - 1959 اعترف فيه ديغول بحق الشعب الجزائري في تقرير مصيره في ظل اتحاد فدرالي مع فرنسا \n'),
      _h3Text('مشاريع التقسيم:'),
      _normalText(
          'مشروع تقسيم الشمال إلى ثلاث مناطق 1957 - قسنطينة ذات الحكم الذاتي والاقليم الفرنسي في الجزائر وهران، الحكم الذاتي لتلمسان.فصل الصحراء عن الجزائر بداية من 10 - 01 - 1957 وتقسيمها إلى عمالة الساورة وعمالة الواحات عبر مرسومي 1957 و1960 '),
      _h2Text('ب - على المستوى الخارجي :'),
      _normalText(
          '- اعتبار القضية الجزائرية شانا داخليا ومعارضة عرضها في المحافل الدولية \n- الاستعانة بدعم الناتو \n- القرصنة الجوية واعتقال القادة الخمسة يوم 22 أكتوبر 1956 - احمد بن بله - حسين ايت احمد - محمد خيضر - محمد بوضياف - مصطفي الاشرف – \n- المشاركة في العدوان الثلاثي على مصر 29 أكتوبر 1956 كونها كانت تؤيد الثورة \n- قنبلة ساقية سيدي يوسف التونسية مخلفة 70 شهيدا من التونسيين والجزائريين في 08 فبراير 1958\n- التعجيل باستقلال عدة دول أفريقية لتفرغ للجزائر\n- قمع مظاهرات المهاجرين 17 أكتوبر 1961 في باريس 13\n'),
      _h1Text('-3 تأكيد عدم جدوى المخططات الاستعمارية ونجاح الثورة :'),
      _normalText(
          '- توالي انتصاراتها الداخلية والخارجية العسكرية والسياسية .\n- اعتراف الأمم المتحدة بحق تقرير المصير للجزائريين .\n- توالي سقوط 7 حكومات فرنسية منذ 1954 .\n- تمرد 13 ماي 1958 وقيام الجمهورية الفرنسية الخامسة بقيادة ديغول . \n- المحاولة الانقلابية ضد ديغول في 22 - 04 - 1961 . \n- الالتفاف الشعبي حول الثورة وهو ما تجسد في مظاهرات 11 ديسمبر 1960 .\n- تزايد الدعم والاعتراف الدولي بالحكومة المؤقتة للجمهورية الجزائرية . \n- ضغط الراي العام الفرنسي وتهديد فرنسا بحرب أهلية .\n'),
    ],
  ),
);
Container wad3iya7 = Container(
  child: Column(
    children: <Widget>[
      _h1Text('أسباب رضوخ الطرف الفرنسي للتفاوض '),
      _normalText(
          '- اهتزاز مكانة فرنسا جراء الجرائم التي ارتكبتها في الجزائر .\n- انتصارات الثورة داخليا وخارجيا وتزايد الاعتراف الدولي بها .\n- إفلاس الخزينة الفرنسية بسبب الحرب - 2 مليار فرنك قديم يوميا - .\n- فشل المخططات العسكرية والمشاريع الاغرائية الفرنسية .\n- تهديد فرنسا بحرب أهلية بسبب التمرد والاضطرابات - تمرد 13 ماي 1958- وتمرد الجنرالات في الجزائر ضد ديغول في - 22 أفريل 1961 – \n- مظاهرات 11 ديسمبر 1960 و 17 أكتوبر 1961 ودورها في تدويل القضية . \n- رفض الفرنسيين مواصلة الحرب بعد فقدانهم لأكثر من 60 ألف من أبنائهم في الجزائر . \nوقد مرت المفاوضات بعدة مراحل تذكر من بينها :\nأ / مرحلة الاتصالات السرية من بلغراد والقاهرة والجزائر منذ 1956 م \nب / مرحلة المفاوضات الجدية من - مولان - بفرنسا 29 / 25 جوان 1960 ثم - لوسارن - بسويسرا 20 فيفري 1961 ثم - ايفيان الأولى - بسويسرا 20 ماي إلى 13 جوان 1961 ثم - بال - بسويسرا أكتوبر نوفمبر 1961 م \nوقد تعطلت المفاوضات نظرا لتمسك الطرفين بمواقفهما :\n'),
      _h4Text(' الموقف الفرنسي :-'),
      _normalText(
          ' الحكم الذاتي - تجزئة الجزائر عرقيا ودينيا - فصل الصحراء عن الشمال - الطاولة المستديرة - الهدنة قبل الاتفاق'),
      _h4Text(' الموقف الجزائري :-'),
      _normalText(
          'السيادة الكاملة - وحدة الأمة الجزائرية - الوحدة الترابية - وقف إطلاق النار بدل الهدنة - جبهة التحرير الممثل الشرعي والوحيد للشعب الجزائري.'),
      _h1Text('ظروف قيام الدولة الجزائرية - ظروف بعث الدولة –'),
      _normalText(
          '- توقيع اتفاقيات ايفيان 18 - 03 - 1962 ووقف إطلاق النار 19 مارس - يوم النصر – .\n- تكوين الهيئة التنفيذية المؤقتة برئاسة عبد الرحمان فارس . \nاشتداد النشاط الإرهابي لمنظمة OAS منظمة الجيش السري \n- انعقاد مؤتمر طرابلس في جوان 1962 \n- إجراء الاستفتاء حول تقرير المصير يوم 1 - 7 - 1962 وكانت نتيجة التصويت % 96.5  بنعم للاستقلال والإعلان الرسمي عن الاستقلال 5 - 7 - 1962 وتكوين الجمعية التأسيسية - 160 عضوا - سبتمبر 1962 برئاسة فرحات عباس والتي اعلنت قيام الجمهورية الجزائرية في 26 - 9 - 1962 برئاسة احمد بن بلة .\n'),
      _h1Text(
          'أهم المشاكل الاقتصادية والاجتماعية والسياسية الموروثة عن الاستعمار'),
      _h2Text('الاجتماعية:'),
      _normalText(
          ' - مخلفات الثورة التحريرية و 132 سنة من الاستعمار\n- الفقر والجهل والأمراض والأوبئة والبطالة\n- مشكل اللاجئين والمعطوبين\n'),
      _h2Text('الاقتصادية:'),
      _normalText(
          ' - اقتصاد مدمر وخزينة منهوبة .\n- غياب القاعدة الصناعية وفرار الإطارات إلى فرنسا .\n- تجارة محتكرة وعاجزة وتابعة لفرنسا غياب عملة وطنية .\n- نقص في الهياكل القاعدية والمرافق العامة .\n'),
      _h2Text(' السياسية:'),
      _normalText(
          '- نقص التجربة الإدارية في الحكم .\n- قيود اتفاقيات ايفيان وخاصة بقاء سيطرة فرنسا على بعض القواعد العسكرية .\n-الصراع على السلطة بين السياسيين والعسكريين .\n- الأطماع الخارجية - اعتداء المغرب 1963 -\n'),
      _h1Text('الاختيارات الكبرى لإعادة بناء الدولة الجزائرية'),
      _normalText(
          'نابعة من مواثيق الثورة خاصة من ميثاق طرابلس الصادر عن مؤتمر طرابلس بليبيا 27 ماي إلى 02 جوان 1962  والذي شاركت فيه جميع القوى الفاعلة وتم فيه وضع وتحديد الخيارات الكبرى للدولة الجزائرية المستقلة والمتمثلة في:'),
      _h2Text(' اولا - الخيارات السياسية :'),
      _normalText(
          '- تشيد دولة عصرية ديمقراطية في إطار نظام الحزب الواحد \n- رفض النزعة الذاتية والانفراد بالسلطة .\n- محاربة الاستعمار ودعم حركات التحرر.\n- دعم السلم والتعاون الدولي . \n- العمل على تجسيد الوحدة المغاربية والعربية والإفريقية .\n'),
      _h2Text(' ثانيا - الخيارات الاقتصادية '),
      _normalText(
          '- تبني النظام الاشتراكي كوسيلة للتنمية\n- محاربة الاحتكارات والإقطاعية .\n- بناء اقتصاد وطني متكامل وتحقيق الاستقلال الاقتصادي .\n- تطبيق سياسة التخطيط وتأميم ثروات البلاد \n'),
      _h2Text('ثالثا - الخيارات الاجتماعية والثقافية:'),
      _normalText(
          '- تحسين مستوى معيشة الشعب وتطوير الخدمات الصحية والتعليمية وتوفير السكن .\n- تطوير الريف\n- ترقية اللغة العربية وإحياء التراث الوطني كعنصر أساسي للهوبة .\n- تجاوز التغريب الثقافي واستعادة الثقافة الوطنية .\n'),
      _h1Text(' التطور السياسي وبناء الدولة الجزائرية'),
      _h2Text('داخليا:'),
      _h3Text(' - التطورات السياسية : '),
      _h4Text('المرحلة الأولى 1962 – 1965'),
      _normalText(
          ' - انتخاب احمد بن بلة رئيسا للجمهورية .\n - إصدار دستور 1963 وميثاق 1964\n- إقرار نظام الحزب الواحد \n- تأصيل أبعاد الجزائر العربية والإسلامية .\n'),
      _h4Text('المرحلة الثانية - 19 جوان 1965 الى 1989  -'),
      _normalText(
          '- انقلاب 19 جوان 1965 أو ما سمي آنذاك بالتصحيح الثوري قاده بومدين ضد الرئيس احمد بن بلة \n-تكوين مجلس الثورة بزعامة هواري بومدين\n- تكريس سياسة الحزب الواحد \n- الشروع في بناء مؤسسات الدولة\n- انتخابات المجالس البلدية 1967 والولائية 1969 والمجلس الشعبي الوطني 1997\n- انتخاب هواري بومدين 10 - 12 - 1976 رئيسا للجمهورية وإعادة صياغة مواثيق الدولة - ميثاق ودستور 76 - .\n- انتخابات المجلس الشعبي الوطني 1977 \n- رقة هواري بومدين 27 - 12 - 1978 وحل مجلس الثورة جانفي 1979 .\n- انتخاب الشاذلي بن جديد رئيسا للجمهورية 7 فبراير 1979 .\n'),
      _h4Text('المرحلة الثالثة من 1989 إلى اليوم:'),
      _normalText(
          ' الانتقال من نظام اشتراكي مبني على الأحادية الحزبية إلى التعددية الحزبية نتيجة عوامل داخلية وخارجية اقتصادية وسياسية أحدثت اضطرابات 5 اكتوبر 1988 والتي دفعت بالرئيس - الشاذلى بن جديد -  إلى القيام بإصلاحات سياسية واقتصادية عن طريق دستور 23 فيفري 1989 '),
      _h3Text('- التطورات الاقتصادية :'),
      _h4Text('  المرحلة الأولى - 1962 إلى 1989 -:'),
      _normalText(
          '- إتباع النهج الاشتراكي وتطبيق سياسة المخططات التنموية .\n- التأميمات الكبرى - المناجم في 6 ماي 1966 / المحروقات 24 في فيفري 1971 –\n - التسيير الذاتي في الميدان الزراعي 1963 ثم الثورة الزراعية 1972 \n- إقامة صناعة وطنية والاهتمام بالصناعة الثقيلة بإنشاء مركبات صناعية كبرى . \n- احتكار الدولة للتجارة الخارجية والداخلية\n'),
      _h4Text(' المرحلة الثانية مند 1989:'),
      _normalText(
          ' - إتباع نظام اقتصاد السوق بخصخصة المؤسسات الاقتصادية .\n- جلب وتشجيع الاستثمار الأجنبي والتفتح على الخارج\n- إتباع سياسة الشراكة في التصنيع .\n-  تحرير التجارة الخارجية وحرية الأسعار .\n'),
      _h2Text('خارجيا :'),
      _normalText(
          '- الانضمام إلى هيئة الأمم المتحدة في 8 أكتوبر 1962 \n- الدخول في مفاوضات مع فرنسا للتخلص من بنود اتفاقيات ايفيان \n- العمل على إنجاح حركة عدم الانحياز - مؤتمر الجزائر 1973 وقراراته التاريخية - \n- دعم حركات التحرر ومناهضة الاستعمار ومساندة القضية الفلسطينية والمشاركة في الحروب العربية الإسرائيلية 1973 / 1967 ودعم قضية الشعب الصحراوي \n- الدور الفعال في المنظمات الإقليمية والعالمية\n- إعلان قيام دولة فلسطين في مؤتمر الجزائر 1988 \n- دعم القضايا العادلة في العالم - المساهمة في فض الكثير من الخلافات الدولية –\n- إدراج القضية الفلسطينية في جدول اعمال الأمم المتحدة\n'),
    ],
  ),
);
Container wad3iya8 = Container(
  child: Column(
    children: <Widget>[
      _h1Text(' تحديد وشرح مجالات العمل للجزائر بعد الاستقلال '),
      _normalText(
          ' تجسيدا لمواثيق الثورة عملت الجزائر بعد الاستقلال في إطار المبادئ والأسس التالية :\n- تصفية الاستعمار ودعم حركات التحرر والقضايا العادلة .\n- توثيق روابط الأخوة المغاربية والعربية بالانضمام للجامعة العربية 1962 ومنظمة الوحدة الإفريقية 1963 ثم الاتحاد الإفريقي والمساهمة في تأسيس الاتحاد المغاربي - قمة زرالدة الهامة 1988 م -  .\n- إرساء السلم والأمن العالمين والتأكيد على مبدأ الشرعية الدولية . \n- دعم التعاون بين دول العالم الثالث والسعي لتحقيق التحرر الاقتصادي والتنمية في دول الجنوب وهذا من خلال:\n'),
      _h2Text('- الأمم المتحدة :'),
      _normalText(
          'كان انضمام الجزائر في 08 أكتوبر 1962 وقد عملت على تطبيق قراراتها وقد برز دور الجزائر في الدعوة لدورة طارئة للجمعية العامة سنة 1974 وترأستها وفيها برز فيها خطاب الرئيس الراحل هواري بومدين  بالتأكيد على ضرورة إقامة نظام اقتصادي دولي جديد وعادل والدعوة إلى مراقبة عمل الشركات متعددة الجنسيات وتثمين ثروات العالم الثالث . كما عملت على تمثيل فلسطين في المنظمة '),
      _h2Text('- حركة عدم الانحياز:'),
      _normalText(
          'الانضمام إليها وحضور كل قممها بداية من 1962 واحتضان مؤتمرها الرابع في 9 / 5 سبتمبر 1973 المميز من حيث الحضور - أمراء ورؤساء 76 دولة و 10 قادة حركات تحررية - والقرارات التي ركزت على الجوانب الاقتصادية بالدعوة إلى نظام اقتصادي دولي جديد وعادل وتشجيع سياسة التاميمات والدعوة إلى حوار شمال جنوب والتأكيد على التعاون جنوب جنوب من خلال مجموعة 77 وكذلك الحد من صراع الحرب الباردة أثناء القطبية الثنائية والهيمنة الأمريكية بعد نهايتها.'),
      _h1Text('إسهامات الجزائر في حركات التحرر في العالم'),
      _h2Text(' 1 - القضية الفلسطينية :'),
      _normalText(
          ' - افتتاح أول مكتب لحركة فتح الفلسطينية في الجزائر سنة 1964 .\n- تدريب ضباط فلسطين في كلية شرشال وإرسال شحنة سلاح إلى فتح عبر سوريا وذلك تحضيرا الانطلاقة الثورة الفلسطينية في جانفي 1965 إنشاء اذاعة صوت فلسطين بالجزائر 1970 .\n- احتضان العديد من اللقاءات والمؤتمرات الخاصة بها ودعم القضية من خلال المؤتمر الرابع لحركة عدم الانحياز الذي قرر اعتبار الصهيونية حركة عنصرية \n- ترتيب زيارة عرفات للأمم المتحدة سنة 1974 والمشاركة في الحروب العربية الإسرائيلية سنة 1967 و 1973 م \n- أول دولة تعترف بدولة فلسطين في المؤتمر المنعقد في الجزائر 1988 / 11 / 15 .\n'),
      _h2Text('2 - حركات التحرر في افريقيا والعالم :'),
      _normalText(
          'لم تكن مساندة الجزائر لحركات التحريرية إلا امتدادا لمبادئ ثورتها التي مازالت تؤمن بحق الشعوب في تقرير مصيرها علما أن إسهام الجزائر في حركة التحرر بدأ حتى قبل استقلالها ودعم حركات التحرير لم يقتصر على القارة الإفريقية - جنوب إفريقيا - الموزمبيق - زمبابوي - غنيا - ناميبيا - وانما تعداه إلى أمريكا اللاتينية وآسيا - الفيتنام - تصديقا لمبادئ السياسة الجزائرية الرامية إلى تأييد كل صوت طامح لكسر طوق الهيمنة والاستعباد'),
    ],
  ),
);

Container wad3iya9 = Container(
  child: Column(
    children: <Widget>[
      _h1Text('تعريف الحركة التحررية'),
      _normalText(
          ' هي رد فعل وطني ضد القوى الاستعمارية بهدف طرد المحتل وتحقيق السيادة والاستقلال'),
      _h1Text(' عوامل وأسباب تراجع الاستعمار التقليدي وتصاعد المد التحرري'),
      _h2Text('أ/الداخلية:'),
      _normalText(
          ' - الظلم والاضطهاد المسلط من طرف القوى الاستعمارية.\n- اكتساب  شعوب المستعمرات الخبرة العسكرية والسياسية جراء مشاركتهم في الحرب العالمية الثانية\n- زوال عقدة الخوف جراء تعرض القوى الاستعمارية التقليدية ( فرنسا وبريطانيا ) للهزائم امام النازية\n- بروز زعماء وطنيون  كغاندي في الهند و احمد سوكارنو  في اندونيسيا و  جمال عبد الناصر في مصر\n- بروز فكرة التضامن الأفرو-آسيوي في مؤتمر باندونغ 1955 \n'),
      _h2Text('ب/ الخارجية والدولية :'),
      _normalText(
          '- صدور ميثاق الأطلسي في 14 أوت 1941 الذي يقر بحق الشعوب في تقرير مصيرها\n- تأسيس هيئة الأم المتحدة 1945 والجامعة العربية وكلاهما دعا إلى تصفية الاستعمار\n-  دعم المعسكر الشرقي لحركات التحرر في العالم الثالث\n'),
      _h1Text('  خصائص المشتركة بين حركات التحرر'),
      _h4Text('1- الشمولية: '),
      _normalText('أي أنها شملت معظم الدول الخاضعة للاستعمار'),
      _h4Text(' 2- جنوبية: '),
      _normalText(
          'أي أن جلها كانت في دول العالم الثالث في القسم الجنوبي من الكرة الأرضية'),
      _h4Text('3- الإصرار :'),
      _normalText(' أي إصرارها على الاستقلال ووحدة ترابها وشعبها .'),
      _h4Text('4- التزامن :'),
      _normalText(' اي أنها اشتدت بعد الحرب العالمية الثانية'),
      _h4Text('5- التضامن :'),
      _normalText(' فيما بينها - هجومات الشمال القسنطيني تضامنا مع المغرب – '),
      _h4Text('6- شعبية :'),
      _normalText('أي أن الشعوب هي التي قامت بها '),
      _h4Text('7- وطنية : '),
      _normalText(
          'أي ان البعد الوطني القومي هو إلى حركها ولا وجود للدور الأجنبي فيها باستثناء الدعم المادي والسياسي '),
      _h1Text(
          ' إبراز تنوع أساليب وخصائص التحرر في آسيا وإفريقيا وأمريكا اللاتينية'),
      _h2Text('في آسيا:'),
      _h3Text('الهند الصينية:'),
      _normalText(
          ' مستعمرة فرنسية منذ 1858 تضم - الفيتنام - اللاووس - كمبوديا - عرفت ثورة تحررية في الفيتنام ضد الاستعمار الياباني بين الحكومة الوطنية بزعامة هوشي منه - جبهة تحرير الفيتنام -الفيت منه- التي تأسست في 1941 - وبعد تدخل الجيوش الانجليزية والصينية تم تحرير الفيتنام ، فحاولت فرنسا : استرجاع المستعمرة فاصطدمت بجبهة - الفيت منه - في الشمال ، من نوفمبر 1946 حتى ماي 1954 وقد تدخلت أطراف الحرب الباردة فيه ليصبح الصراع غير مباشر بين المعسكرين خاصة بعد نجاح الثورة الشيوعية في الصين بزعامة « مارتسي تونغ » 01 أكتوبر 1949 وانتهى لصالح الفيتامين الشماليين - انتصار الجنرال جباب على الجيش الفرنسي في معركة ديان بيان فو 1954 / 05 / 07 ولإنهاء الصراع عقد مؤتمر جنيف في 20 جويلية 1954 م وقد شاركت في المؤتمر القوى العظمى والذي اقر حلولا لتسوية مرضية لكل أطراف ومن أهم قراراته:\n- استقلال الفيتنام الشمالي ( شمال خط 17 ) وعاصمته هانوي بزعامة هوشي منه \n- استقلال الفيتنام الجنوبي ( جنوب الخط 17 ) وعاصمته سابغون بزعامة الجنرال - دييم – \n- إعطاء كمبوديا واللاووس استقلالهما التام \n- إعادة توحيد فيتنام بتنظيم استفتاء شعبي ينظم عام 1956 .\nلكن الوم او في إطار سياسة ملء الفراغ تدخلت لدعم الجنرال دييم في الجنوب ضد جبهة - الفيت كونغ - الشيوعية المؤيدة من فيتنام الشمالي والمعسكر الشرقي ، لتخرج منهزمة وتنسحب نهائيا سنة 1975 بعد وقف إطلاق النار مقتضى اتفاقية باريس 1973 وبعد أن خسرت 60 الف جندي ، بينما خسر الفيتناميون أكثر من نصف مليون قتيل ، حيث استولى الشماليون على سايغون وتم توحيد فيتنام تحت اسم جمهورية فتنام الاشتراكية ، وقد تميز نضال الهند الصينية بما يلي:\n- العنف والشراسة والتضحيات الجسام والزمن الطويل .\n- تعدد الأطراف التي حاربتها - اليابان . فرنسا . الوم أ - \n'),
      _h3Text('الهند :'),
      _normalText(
          'خضعت للاحتلال البريطاني سنة 1858 وأصبحت ملكة بريطانيا - الملكة فيكتوريا - تلقب ملكة بريطانيا والهند ، وقد تزعم حزب المؤتمر الهندي بقيادة - المهاتما غاندي - الكفاح التحرري فيها إلى جانب - محمد علي جناح  زعيم حزب الرابطة الإسلامية وقد اعتمد غاندي على العصيان المدني ومقاطعة الإدارة البريطانية كلية وتنظيم المظاهرات والإضرابات - ثورة اللاعنف - منذ 1919 مما مكنهم من تحقيق الاستقلال عن التاج البريطاني في 15 أوت 1947 - مقتضى قانون الدومنيون - ، وقد تميز كفاحها التحرري ما يلي :\n- السلمية والعنف الايجابي حيث تعد من أبرز حركات التحرر في العالم لتميزها دون غيرها بأسلوب الكفاح السلمي .\n- بروز شخصية - المهاتما غاندي - وقوة تأثيرها في الهند وخارجها\n- انقسام الهند إلى دولتين وهما الهند وباكستان بعد الاستقلال 1947 \n'),
      _h2Text('في إفريقيا :'),
      _h3Text('الجزائر:'),
      _normalText(
          'احتلت ثورتها مكانة مرموقة على الساحة الدولية بإثباتها مجموعة من الحقائق شكلت خصائص لها منها :\n- أنها أولى الثورات التي أفشلت السياسة الاستيطانية الأوربية خارج أوروبا .\n- نجاحها في أثبات مبدا ما أخذ بالقوة لا يسترد إلا بالقوة \n- إثباتها أن الانتصار على قوى الاستعمار حتمية تاريخية أمام إرادة الشعوب التواقة للحرية والسيادة \n- تمكنها من التخلص من قيود الاستعمار في وقت قصير نسبيا - قيود ايفيان - فرض السيادة على الثروات بالتاميمات –\n- مواصلتها لثورة التعمير بعد ثورة التحرير في أبعادها الاقتصادية والاجتماعية والثقافية .\n- تبنيها بعد الاستقلال موقف ميزها الاستمرار في الكفاح ضد الامبريالية ومناصرة حركات التحرر والقضايا العادلة ومقاومة التسلط والهيمنة والنفوذ السياسي والاقتصادي في إطار حركة عدم الانحياز ومجموعة 77 .\n'),
      _h3Text(' مصر :'),
      _normalText(
          ' ابراز خصائص الثورة المصرية 23 07 / 1952 :\n- هي عبارة عن انقلاب عسكري للضباط الأحرار ضد نظام عميل لبريطانيا - الملك فاروق -، قام به جمال عبد الناصر في إطار حركة الضباط الأحرار  وقد تميزت بما يلي \n- محاربتها للمشاريع والقواعد والأحلاف العسكرية - حلف بغداد 1955 ، مشروع أيزنهاور 1957 –\n- سعيها لتحقيق الوحدة العربية ودفاعها عن مصالح شعوبها ودعم تحررها من الاستعمار والامبريالية والصهيونية - الجزائر وفلسطين –\n- استكمال مصر لسيادتها الكاملة على ثرواتها الوطنية من خلال تأميم قناة السويس 26 - 07 - 1956 وتمكن مصر من الصمود في وجه العدوان الثلاثي - الفرنسي البريطاني والاسرائيلي –\n- انجاز السد العالي وتحسين أحوال الفلاحين بنزع الأراضي من الإقطاعيين .\n- بروز  جمال عبد الناصر كزعيم للقومية العربية واحد مؤسسي حركة عدم الانحياز \n'),
      _h2Text(' في أمريكا اللاتينية:'),
      _h3Text(' كوبا:'),
      _normalText(
          ' قاد الزعيم فيدال كاسترو  الثورة سنة 1959 بعد أن فشل سنة 1953 في قلب نظام الدكتاتور الموالي للولايات المتحدة  باتيستا  وقد نجح الثوار في دخول العاصمة هافانا في 08 جانفي 1959 م والإطاحة بالدكتاتور باتيستا الذي فر إلى أسبانيا ، ومن اهم الانجازات التي قام بها كاسترو ، هي انتزاع الأراضي من الإقطاعيين وتأميم الثروات من الشركات الأمريكية مما اغضب الولايات المتحدة التي حاولت التخلص منه عن طريق تدبير محاولات انقلابية منها عملية خليج الخنازير في 17 أفريل 1961 بالاستعانة بتسليح المعارضة وازدادت الأزمة بينهما اثر اكتشاف الصواريخ السوفيتية في كوبا ، ولازال العداء بين الدولتين خاصة وأن الولايات المتحدة تسيطر على قاعدة غوانتانامو شرق كوبا منذ 1902 ومن مميزاتها :\n- اعتمادها على المبادئ الشيوعية وإبرازها الثائر العالمي  شيغيفارا \n- محاربتها للهيمنة الأمريكية مما عرضها لحصار وتهديد أمريكي طويل\n- أنها مثلت إحدى بؤر التوتر الشديدة في أثناء الحرب الباردة - أزمة الصواريخ 1962 –\n- دعمها لحركات التحرر الشيوعية في دول أمريكا اللاتينية ضد أنظمة دكتاتورية عميلة مدعومة من قبل الو.م.أ وشركاتها الكبرى\n'),
      _h1Text('من كفاح التحرر إلى ترتيبات ما بعد الاستقلال'),
      _normalText(
          'لما تأكدت الدول الاستعمارية - بريطانيا وفرنسا - من تحرر مستعمراتها سياسيا عملت على إيجاد الآلية التي تمكنها من المحافظة على مصالحها وامتيازاتها في تلك الدول من خلال تأسيس تكتلات ومنظمات ثقافية واقتصادية وسياسية - الاستعمار المقنع  - ربطت بها مستقبل مستعمراتها بها:'),
      _h2Text('الكومنولث : ( الثروة المشتركة ) :'),
      _normalText(
          'منظمة لمجموع الدول والوحدات السياسية التي عاشت تحت الحكم البريطاني تأسست موجب قانون « وستمنستر » 1931 / 12 / 11 وتشمل هذه المنظمة بريطانيا ومعها 53 دولة وتهدف إلى تحقيق التعاون في المجال السياسي والاقتصادي والاجتماعي وتحقيق تنمية مستدامة واستمرار تأثير بريطانيا الثقافي واستفادتها من الامتيازات الاقتصادية والسياسية في مستعمراتها .'),
      _h2Text(' الفرانكفونية'),
      _normalText(
          'هي منظمة تظم المستعمرات الفرنسية السابقة والشعوب الناطقة بالفرنسية تأسست في 20 مارس 1970 عدد الأعضاء 68 دولة من كل القارات وتهدف هذه المنظمة : إلى تحقيق التعاون الثقافي والاقتصادي وتقديم الدعم التقني وتحقيق التنمية المستدامة بين الأعضاء - نشر اللغة الفرنسية والهيمنة على الدول الأعضاء واستنزاف ثرواتها ومواردها'),
    ],
  ),
);

Container wad3iya10 = Container(
  child: Column(
    children: <Widget>[
      _h1Text(' سقوط الاتحاد السوفييتي وأثره على العالم الثالث'),
      _normalText(
          'تم تأسيس الاتحاد السوفييتي سنة 1922 من طرف الزعيم - لينين - وبعد انسحاب الجمهوريات السوفيتية منه - قمة الما اتا – بكازاخستان في 21 ديسمبر 1991 حل الاتحاد السوفييتي في 25 ديسمبر 1991 وقدم غورباتشوف استقالته في اليوم الموالي ، اما عن اسباب سقوط الاتحاد فتم التعرض إليها في درس من الثنائية إلى الأحادية '),
      _h1Text(' انعكاسات سقوط الاتحاد السوفييتي على العالم الثالث'),
      _h2Text('أ/ الانعكاسات السلبية :'),
      _normalText(
          'ظهور النظام الدولي الجديد - الأحادية القطبية - بزعامة الولايات المتحدة الأمريكية التي اصبحت تتغطرس وتتدخل في شؤون العالم الثالث بحجج مختلفة وشعارات نذكر من بينها:'),
      _h3Text('الديمقراطية '),
      _normalText(
          'بفرض الإصلاحات الديمقراطية في العالم الثالث ومحاربة الأنظمة الفردية بالمفهوم الأمريكي والتي تعارض هيمنتها مثال العراق وأفغانستان والصومال .'),
      _h3Text(' الليبرالية الاقتصادية '),
      _normalText(
          ' أي فرض تبني النظام الرأسمالي والعولمة الاقتصادية على دول العالم الثالث من خلال الضغط عليها عبر المؤسسات الاقتصادية والمالية العالمية - صندوق النقد الدولي والبنك العالمي والمنظمة العالمية للتجارة - ومن خلال استغلال مديونيتها الضخمة وربط تقديم المساعدات لها بفتح الطريق أمام شركاتها متعددة الجنسيات وتقديم تنازلات سياسية - الاعتراف بإسرائيل المشروط على الدول العربية - وعدم الاعتراض على هيمنتها على العالم . '),
      _h3Text('المنظمات الدولية '),
      _normalText(
          'الأمم المتحدة ومجلس الأمن وحق الفيتو - تستخدمها الولايات المتحدة والدول الكبرى لإضفاء الشرعية على تدخلاتها حيث أصبحت أدوات في يدها تمرر عبرها كل القرارات التي تخدم مصالحها . '),
      _h3Text('المنظمات غير الحكومية '),
      _normalText(
          'تقوم الدول الكبرى باستغلالها للتجسس وإثارة المشاكل والنزاعات والتحريض كما تتخذ تقاريرها كأوراق ضغط ووسيلة للتدخل في الشؤون الداخلية لدول العالم الثالث - دورها في إقليم دارفور –.'),
      _h3Text(' تكريس الاستعمار والتبعية '),
      _normalText(
          ' بانهيار المعسكر الشيوعي انتهت الحرب الباردة وانتقل العالم من الثانية القطبية إلى الأحادية وحول الصراع من شرق غرب إلى شمال جنوب وبذلك وجدت دول العالم الثالث نفسها في مواجهة القوى الاقتصادية الكبرى التي تعمل على تعطيل عجلة التطور في العالم الثالث '),
      _h3Text('حدوث أزمات إقليمية ووطنية '),
      _normalText(
          ' تسعى الولايات المتحدة الأمريكية ومن ورائها الدول المتطورة لاثارة أزمات إقليمية ومشاكل داخلية وطنية أو حدودية بين الدول المجاورة بهدف استنزاف قدراتها وإفشال التنمية فيها ولضرب أنظمتها التحررية ولنجد مبررا للتدخل العسكري تحت غطاء فرض الشرعية الدولية ، كالتدخل العسكري في العراق وفي الصومال وأفغانستان '),
      _h3Text('حقوق الإنسان وحماية الأقليات'),
      _normalText(
          ' باستخدام هذه الوسيلة للضغط والتدخل في الشؤون الداخلية للدول الرافضة للهيمنة الأمريكية مثل مشكل الأقلية الكردية في العراق والمسيحيين والأفارقة في دارفور بالسودان'),
      _h3Text('حرب الخليج الثانية - الحرب على العراق-'),
      _normalText(
          ' كانت هذه الحرب أول تجسيد لبروز النظام الدولي الجديد ولهيمنة الو.م.أ على العالم ، اندلعت حرب الخليج الثانية بعد غزو العراق للكويت في 2 اوت 1990 ، حيث تشكل تحالف دولي بقيادة الو.م.أ أعلن الحرب على العراق في جانفي 1991 يظم اكثر من 30 دولة '),
      _h4Text('الأهداف المعلنة للحرب: '),
      _normalText(
          ' تحرير الكويت وتدمير أسلحة الدمار الشامل المراقبة وحماية الأقلية الكردية والشيعة وإسقاط النظام الديكتاتوري لصدام حسين ، الذي كان في وقت سابق من حلفاء أمريكا استخدمنه لضرب الثورة الإسلامية في إيران'),
      _h4Text(' الأهداف الحقيقية :'),
      _normalText(
          '- السيطرة على بترول العراق والمنطقة \n- ضرب قوته الاقتصادية والعسكرية . \n- حماية أمن إسرائيل وكل حلفاء الولايات م.أ في المنطقة .\n- إنهاء حالة الركود الاقتصادي الأمريكي - الصناعة الحربية -.\n - إعادة رسم خارطة الشرق الأوسط . \n- فرض تسوية للقضية الفلسطينية وفق المصالح الإسرائيلية .\n- منع أي محاولة من دول العالم الثالث للخروج من الهيمنة الأمريكية أو الوقوف في وجهها ، وقد اكتملت خطة هذه الحرب باحتلال العراق سنة 2003 \n- أظهرت حرب الخليج الثانية دور الأم المتحدة التي أصبحت أداة في يد الولايات المتحدة ، والذي تجسد في سلسلة القرارات التي أصدرها مجلس الأمن والتي اعطت الشرعية الدولية للتحرك ضد العراق\n'),
      _h2Text('ب/ الانعكاسات الايجابية : '),
      _normalText(
          '- تخلص دول العالم الثالث من فكرة الأحادية الحزبية والنظام الاشتراكي وبروز التعددية الحزبية لكن نظرا لافتقار دول العالم الثالث للتقاليد الديمقراطية والتدخلات الأجنبية فقد تحولت التعددية في كثير من الأحيان إلى نقمة على دول العالم الثالث منها الجزائر العشرية السوداء والفتن الداخلية \n- نهاية الاتحاد والمعسكر الشيوعي أدى إلى انتهاء الحرب الباردة التي أدت في كثير من الأحيان إلى عواقب وخيمة على دول العالم الثالث - تقسيم كوريا - وتوحد اليمن والمانيا وهي من الايجابيات . \n- تبني دول العالم الثالث الاقتصاد السوق ساهم في تطورها الاقتصادي رغم بعض العراقيل البيروقراطية . \n- تطور مستوى حقوق الإنسان في العالم الثالث يفضل الرقابة الدولية\n'),
    ],
  ),
);

Container wad3iya11 = Container(
  child: Column(
    children: <Widget>[
      _h4Text('  جذور القضية الفلسطينية باختصار - المطالعة - :'),
      _normalText(
          ' نشأت الحركة الصهيونية في مؤتمر بال بسويسرا بتاريخ 1897 / 08 / 29 بزعامة الصحفي النمساوي اليهودي - تيودور هرتزل - بغرض إقامة وطن قومي لليهود في فلسطين ولعل من أهم مراحل القضية قبل 1947 :\n-وعد بلفور في 02 نوفمبر 1917 .\n- وضع فلسطين تحت الانتداب البريطاني سنة 1920 ( مؤتمر سان ريمو ) \n- بداية المخططات الصهيونية لتهويد فلسطين عن طريق تعين الانجليز لليهود على رأس الإدارة في فلسطين وعن طريق شراء الأراضي وتكوين المستوطنات التي تحميها العصابات المسلحة  -الهاغانا والأرغون  \n- تقسيم فلسطين لعام 1937 إلى دولتين عربية ويهودية مع بقاء القدس تحت الحماية البريطانية بعد ثورة 1936 - تقسيم اللورد بيل - بعد فشل بريطانيا في تسوية الصراع الصهيوني العربي قامت بعرض القضية على هيئة الأمم المتحدة في أفريل 1947 والتي أقرت القرار رقم 181  يوم 1947 / 11 / 29 الذي نص على تقسيم فلسطين إلى\n:دولة عربية: في قطاع غزة الضفة الغربية وأقصى الشمال الغربي\nدولة يهودية : في الجليل الشرقي والقسم الأكبر من السهل الساحلي وبئر السبع والنقب\nالقدس : وما جاورها توضع تحت وصاية هيئة الأمم المتحدة . وقد رفض الفلسطينيون هذا التقسيم في مؤتمر القاهرة 1947 بينما رحب به اليهود الصهاينة ويعتبر القرار 181 شكلا من اشكال التواطئ الدولي ضد فلسطين .\n'),
      _h1Text(' الحرب العربية الإسرائيلية الأولى 1948 '),
      _h2Text('- ظروفها وأسبابها:'),
      _normalText(
          ' في 14 ماي 1948 أعلنت بريطانيا إنهاء الانتداب والانسحاب من فلسطين وفي اليوم الموالي 15 ماي 1948 أعلن الزعيم الصهيوني - ديفيد بن غور يون - قيام دولة إسرائيل وعاصمتها تل أبيب ، وقد حظيت باعتراف الدول الكبرى وأصبحت عضوا في هيئة الأمم  وإزاء هذا الموقف قررت الحكومات العربية إرسال قوائها إلى فلسطين المساندة الشعب الفلسطيني '),
      _h2Text('وقائعها :'),
      _normalText(
          'اندلعت الحرب في 15 ماي 1948 حيث حققت الجيوش العربية المشتركة -  المصرية ، السورية ، اللبنانية الأردنية ، العراقية - انتصارات كبرى ، فأسرع مجلس الأمن تحت ضغط القوى العظمى الى إصدار قرار بوقف القتال لمدة شهر إبتداءا من 11 جوان 1948 كهدنة استغلها اليهود في الحصول اعلى الاعدادات العسكرية ، ثم قاموا بهجوم مضاد في 09 جويلية 1948 لتنتهي الحرب بوم 16 جويلية 1948 بهزيمة الجيوش والأنظمة العربية '),
      _h2Text('نتائجها :'),
      _normalText(
          '- هجرة 600 ألف فلسطيني من وطنهم قهرا وظهور مشكلة اللاجئين الفلسطينيين العالقة حتى اليوم\n- عقد هدنة رودس 1949 والتي أدت إلى عقد سلسلة من الاتفاقيات بين الدول العربية وإسرائيل كرست الهزيمة العربية\n- ضياع أرض فلسطين حيث أصبحت إسرائيل تسيطر على أغلبها ، ما عدا قطاع غزة - المصرية - والضفة الغربية – الأردنية\n - ارتكاب الصهاينة مجازر ضد الفلسطينيين - مجزرة دير ياسين في 09 أفريل 1949 راح ضحيتها 245 فلسطيني \n- سقوط بعض الأنظمة العربية بعد اكتشاف خيانتها في حرب 1948 مثل نظام الملك فاروق في مصر سنة 1952 .\n- ضم الضفة الغربية إلى الأردن وغزة إلى مصر .\n'),
      _h1Text(' ثورة التحرير 1965 '),
      _normalText(
          ' شعر الفلسطينيون بمسؤوليتهم في تحرير فلسطين حيث أعلن في 28 ماي 1964 عن تأسيس منظمة التحرير الفلسطينية وجناحها العسكري وتضم العديد من الفصائل أهمها - فتح - بقيادة باسر عرفات الذي أصبح رئيسا للجنة التنفيذية لمنظمة التحرير سنة 1969 وينص ميثاقها على إنشاء الدولة الفلسطينية ، وكانت أول عملية فدانية يوم 01 جانفي 1965 معلنة بداية الثورة الفلسطينية ومنطلقة من القواعد الخلفية في البلدان العربية المجاورة - سوريا ، لبنان ، الأردن - ، تواصلت الثورة رغم ردود الفعل الإسرائيلية الإرهابية وحروبها المدعمة بالقوى الغربية والأمريكية واستمرت في شكل عمليات فدائية ، لتتحول إلى انتفاضة شعبية عامة أرغمت في كثير من الأحيان العدو للتفاوض مع قيادات فتح ومن أهم المعارك - معركة الكرامة - في 1968 / 03 / 21 والتي خلفت أكثر من 70 قتيل في صفوف الصهاينة عندما حاولوا تعقب المقاومة الفلسطينية في الأردن...'),
      _h1Text(' الحروب العربية الإسرائيلية'),
      _h2Text(' الحرب الثانية - العدوان الثلاثي على مصر – 1956  '),
      _normalText(
          'تعرف بحرب السويس والعدوان الثلاثي على مصر ، إذ بعد نجاح الثورة المصرية ودعمها للتحرر العربي وبعد قيام جمال عبد الناصر بتأميم قناة السويس في 26 - 7 - 1956 بعد أن رفض البنك الدولي تمويل مشروع السد العالي بتحريض الولايات المتحدة ، شنت كل من بريطانيا وفرنسا وإسرائيل هجوما على مصر في 29 أكتوبر 1956 كل بحجته وأهدافه .\nوأمام الضغط الدولي خاصة الاتحاد السوفييتي الذي هدد باستعمال القوة النووية مع الدول المعتدية انذار بولغانين  في 1956 / 11 / 05 توقف العدوان في 06 نوفمبر 1956 وانسحبت فرنسا وبريطانيا من بورسعيد وإسرائيل من سيناء.'),
      _h2Text('الحرب العربية الإسرائيلية الثالثة - حرب الستة أيام 1967 -:'),
      _h3Text('وقائعها:'),
      _normalText(
          ' وقتها بدأت الحرب يوم 05 جوان 1967 بغارات جوية إسرائيلية مباغتة على المطارات المصرية دمرت فيها سلاح الجر المصري - حوالي 312 طائرة مدمرة - ثم اشتعلت الحرب على الجبهات الثلاث المصرية الأردنية والسورية  وكان سلاح الجو الإسرائيلي سيد الميدان الأمر الذي عجل بالهزيمة العربية بعد ستة أيام فقط حيث انتهت الحرب بوم 10 جوان 1967 .'),
      _h3Text(' نتائجها :'),
      _normalText(
          '- احتلال اليهود لأراضي عربية جديدة - قطاع غزة - الضفة الغربية - سيناء المصرية - والجولان السوري - القدس \n– تزايد قوة اليهود معنويا وعسكريا وتوسيع حركة الاستيطان الإسرائيلي داخل فلسطين مقابل نزوح آلاف الفلسطينيين إلى الدول العربية \n- هزيمة عربية نكراء وخسائر مادية وبشرية .\n- إصدار مجلس الأمن للقرار  242 ، بتاريخ 22 نوفمبر 1967 والمتضمن وقف القتال به دعوة إسرائيل إلى الانسحاب إلى حدود عام 1948 م لكن إسرائيل لم تلتزم به \n- مجازر أيلول الأسود الرهيبة التي تعرض لها الفلسطينيون بالأردن من قبل الجيش الأردني - سبتمبر 1970 وترحيل المقاومة إلى لبنان . \n'),
      _h2Text(' الحرب العربية الاسرائيلية الرابعة ( حرب رمضان ) 1973:'),
      _h3Text('وقائعها:'),
      _normalText(
          'حاول العرب محو نتائج هزيمة عام 1967 م حيث بدأت الحرب يوم 06 أكتوبر 1973 بهجوم القوات المصرية والسورية الفلسطينية مدعمة بالجيوش العربية منها الجزائر ، إذ تمكن الجيش المصري - اللواء سعد الدين الشاذلي - من اختراق الخط الدفاعي الإسرائيلي - خط بارليف - كما كاد الجيش السوري أن يستعيد هضبة الجولان ، وأمام هذا التفوق الذي هدد وجود إسرائيل تدخلت الأمم المتحدة وأصدر مجلس الأمن القرار - 338 - يوم 22 اكتوبر 1973 والذي دعا إلى وقف إطلاق النار والبدء في تطبيق القرار 242 والشروع في محادثات لإقامة سلام في المنطقة وفعلا تم توقيف القنال نهائيا يوم 25 أكتوبر '),
      _h3Text('نتائجها وانعكاساتها :'),
      _normalText(
          '- هزيمة عسكرية عربية جديدة إذ بقيت إسرائيل مسيطرة على الأراضي التي احتلتها سنة 1967 \nبروز الأهمية الإستراتيجية والسياسية للنفط باستخدام العرب للحظر البترولي على الدول المساندة لإسرائيل بداية من 17 / 15 أكتوبر 1973 \n- تحقق الغرب من خطر الوحدة العربية\n- الاعتراف بمنظمة التحرير الفلسطينية كممثل للشعب الفلسطيني ومنحها صيغة عضو مراقب بالأمم المتحدة في يوم 24 أكتوبر 1974\n  - توقيع رئيس مصر  انور السادات ، ورئيس وزراء إسرائيل مناجييم بيغن ، في 17 - 9 - 1978 اتفاقية  كامب ديفيد والتي توجت بمعاهدة السلام بواشنطن في 26 - 3 - 1979 وتتضمن الأرض مقابل السلام مع إسرائيل ما عمق الانشقاق العربي فنقل مقر الجامعة العربية من مصر إلى تونس\n- الحرب الأهلية اللبنانية ( 1975 - 1990 ) والاجتياح الإسرائيلي للبنان في 1978 ثم حصار بيروت 1982 وعزل منظمة التحرير الفلسطينية وضربها بلبنان وإبعادها من بيروت إلى تونس \n- مجازر مخيمي صبرا وشتيلا يوم 18 سبتمبر 1982 التي راح ضحيتها حوالي 6000 لأجيء فلسطيني\n- ظهور مشاريع تسوية للقضية الفلسطينية وأهمها مشروع ريغان 1982 / 09 / 01 ومشروع فاس  1982 / 09 / 09 \n'),
      _h1Text('الانتفاضة وأثارها '),
      _normalText(
          '- قيام الانتفاضة الفلسطينية في 07 ديسمبر 1987 كعمل تحرري من داخل الأرض المحتلة على شكل إضرابات ومظاهرات ومقاطعة وكانت حرب الحجارة  من أبرز اشكال المواجهة مع قوات الاحتلال ، لم يثن من عزم المقاومين لا القتل ولا الإبادة ولا الاعتقالات مما أذهل جنود الاحتلال وفتح أعين العالم على حقيقة الوضع في فلسطين ومن نتائجها واثارها:\n- عودة المقاومة بقوة إلى عمق الأراضي المحتلة \n- إعلان المجلس الوطني الفلسطيني عن قيام الدولة الفلسطينية المستقلة يوم 15 نوفمبر 1988 بالجزائر ، والتي كانت اول المعترفين بها\n- تأثيرها الكبير على إسرائيل عسكريا واقتصاديا وسياسيا\n- لفت أنظار الرأي العام العالمي لحقيقة الوضع الفلسطيني وحركت الدولي الكبرى للبحث عن تسوية للقضية الفلسطينية .\n'),
      _h1Text('مشاريع التسوية واتفاقية الحكم الذاتي'),
      _normalText(
          ' طرحت العديد من مشاريع التسوية للقضية الفلسطينية وأهمها مشروع ريغان 1982 / 09 / 01 ومشروع فاس 1982 / 09 / 09 مشروع بوش بيكر...\n- مشروع فاس 1982 : مشروع ملك السعودية فهد بن عبد العزيز وهو مشروع عربي جاء على إثر القمة العربية في المغرب وتم اقتراح : الاعتراف بإسرائيل مقابل الاعتراف بدولة فلسطين - انسحاب إسرائيل من الأراضي المحتلة في 1967 - تقرير مصير الشعب الفلسطيني . \n-مشروع ريقن الأمريكي 1982 : مشروع سلام أعلنه الرئيس الأمريكي رونالد ريغان في 01 سبتمبر 1982 وتضمن ما يلي : عدم تأييد قيام دولة فلسطينية مستقلة في الضفة الغربية وقطاع غزة - إقامة حكم ذاتي للدولة الفلسطينية - إبقاء القدس موحدة وتجسيد المستوطنات \n-اتفاقية الحكم الذاتي : عقد مؤتمر السلام في الشرق الأوسط بالعاصمة الإسبانية مدريد يوم 30 أكتوبر 1991 قبل الطرفان الفلسطيني والإسرائيلي إمضاء اتفاقية  أوسلو بالنرويج سنة 1993 ، ثم عقد اجتماع بواشنطن يوم 13 سبتمبر 1993 تم فيه توقيع اتفاقية الحكم النهائي في قطاع غزة وأريحا بين منظمة التحرير الفلسطينية - ياسر عرفات - وإسرائيل - إسحاق راين - برعاية الرئيس الأمريكي بيل كلينتون . وفي سنة 1995 نقل الحكم الفلسطيني لقطاع غزة وأريحا وفي 28 سبتمبر وقع الطرفان اتفاقا يقضي بتوسيع الحكم الذاتي إلى الضفة الغربية لكن إسرائيل وإلى يومنا تنكرت إلى الاتفاق .\n'),
    ],
  ),
);
// _normalText(''),    _h1Text('') ,         _h2Text('') ,         _h3Text('') ,       _h4Text('') ,      _h5Text('') ,

_normalText(String text) {
  return Text(
    text,
    style: TextStyle(
      color: Colors.black,
      fontSize: 18,
      fontWeight: FontWeight.normal,
    ),
  );
}

_h1Text(String text) {
  return Text(
    text,
    style: TextStyle(
      color: Colors.amber[800],
      fontFamily: 'Amiri',
      fontSize: 30,
      fontWeight: FontWeight.bold,
    ),
  );
}

_h2Text(String text) {
  return Text(
    text,
    style: TextStyle(
      color: Colors.amber[400],
      fontSize: 23,
      fontWeight: FontWeight.w600,
    ),
  );
}

_h3Text(String text) {
  return Text(
    text,
    style: TextStyle(
        color: Colors.green[200], fontSize: 20, fontWeight: FontWeight.w600),
  );
}

_h4Text(String text) {
  return Text(
    text,
    style: TextStyle(
      color: Colors.black,
      fontSize: 18,
      fontWeight: FontWeight.bold,
      fontFamily: 'Amiri',
    ),
  );
}

_h5Text(String text) {
  return Text(
    text,
    style: TextStyle(
      color: Colors.red[200],
      fontSize: 20,
      fontWeight: FontWeight.w600,
      fontFamily: 'Amiri',
    ),
  );
}
