class Mostala7 {
  String itemOne, itemTwo;
  int wihda;
  Mostala7({this.itemOne, this.itemTwo, this.wihda});
}

List<Mostala7> mostala7at = [
  Mostala7(
    itemOne: 'الليبرالية',
    itemTwo:
        'مذهب اقتصادي و اجتماعي يرتكز على مبدا الحرية الفردية ويستبد أي تدخل للدولة في الشؤون الاقتصادية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الاشتراكية',
    itemTwo:
        ' نظام شمولي يقوم على هيمنة الدول على مناحي الحياة و مناهض للرأسمالية تبناها الاتحاد السوفييتي بعد نجاح الثورة البلشفية ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الإمبريالية',
    itemTwo:
        ' هيمنة اقتصادية وعسكرية وسياسية لدولة على دولة أخرى وهي صورة أخرى للاستعمار التقليدي',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الشرق',
    itemTwo:
        ' يقصد به الدول التي تقع في شرق أوربا و التي طبقت النظام الاشتراكي أثناء الحرب الباردة .',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الغرب',
    itemTwo:
        ' الدول الديمقراطية الرأسمالية التي تقع غرب أوربا وكذلك الى جانب الو . م . الأمريكية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الحلف الأطلسي',
    itemTwo:
        ' 04 أفريل 1949 :الناتو حلف عسكري يضم الدول الرأسمالية بزعامة الو م أ بهدف مواجهة المعسكر الشيوعي و حركات التحرر مقره ببروكسل ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'حلف وارسو',
    itemTwo:
        'ماي 1955 حلف عسكري تابع للمعسكر الشيوعي بزعامة الاتحاد السوفييتي يهدف إلى مواجهة تحديات الغرب الرأسمالي',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الكريملين',
    itemTwo: ' القلعة الحصينة مقر الرئاسية السوفيتية بالعاصمة موسكو ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' البيت الأبيض',
    itemTwo:
        'هو مقر رئيس الو م أ بواشنطن ويستمد اسمه من اللون الأبيض الذي طليت به جدرانه ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة الاحلاف',
    itemTwo:
        'هي سياسة تقوم على تأسيس تكتلات عسكرية تضم دولا ذات مصالح مشتركة بزعامة إحدى القوتين منها الناتو - حلف بغداد - وارسو',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة المشاريع',
    itemTwo:
        'تتمثل في سعي كل طرف إلى احتواء واستقطاب اكبر عدد مند الدول في إطار مواجهته للمعسكر الأخر عبر مشاريع سياسية واقتصادية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الأزمات الدولية ',
    itemTwo:
        'هي الفترات التي تميزت فيها علاقات العسكرين باللا استقرار والتوتر الحاد الذي لم يصل لمستوى الحرب الفعلية ومن أبرزها الأزمة كورية و الكوبية ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الحرب الباردة ',
    itemTwo:
        ' هي صراع اديولوجي حضاري و مصلحي عرفه العالم بعد الح ع 2 حتى سنة 1990 بين المعسكرين استعملت فيه مختلف الوسائب باستثناء المواجهة العسكرية المباشرة بين و م أ و اتحاد السوفيتي ، بغية الحصول على مصالح مادية ومعنوية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الدعاية المغرضة',
    itemTwo:
        'من ابرز وسائل الحرب الباردة وتقوم على نشر الأفكار من أجل التأثير باستخدام وسائل الإعلام - الإذاعات الصحف القنوات التليفزيونية الإشهار النشربات السرية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الانفراج',
    itemTwo:
        'هي وصف العلاقات العكرين بعد تسوية أزمة كوبا الخطيرة حيث تم التخلص من الشدة والضيق اللذان وصل إليها ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'التعايش السلمي',
    itemTwo:
        ' مصطلح سياسي يقصد به إبعاد شبح الحرب الساخنة كوسيلة لتسوية الخلافات وحلها بالطرق السلمية مع القبول بازدواجية النظام الدولي ظل التعايش و تبادل المصالح بين 1977 - 1956',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'مشروع مارشال',
    itemTwo:
        'أعلن الوزير الأمريكي جورج مارشال في 5 جوان 1947 ويقضي بتقديم مساعدات مالية لأوربا من أجل إعادة اعمار دمار الحرب ع2 و بشروط ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الستار الحديدي',
    itemTwo:
        'مفهوم استعمله رئيس وزراء بريطانيا ونستون تشرشل لما تحدث عن أطماع الاتحاد السوفيتي التوسعية في أوروبا الشرقية ويمتد من منطقة ستايتن على بحر البلطيق إلى ميناء تريستيا الايطالي',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'الصراع الاديولوجي',
    itemTwo:
        'هو صراع فكري حضاري بين الشيوعية و الرأسمالية بحيث يسعى كل طرف لفرض مذهبه و سياسته',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'ملء الفراغ',
    itemTwo:
        'هي سياسة استعمارية تبنتها الولايات المتحلق الأمريكية تقوم على تعويض الدول الاستعمارية بعد ضعفها وانسحابها من مستعمراتها السابقة قابلها الاتحاد السوفيتي بدعم حركات التحررية ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة الاحتواء',
    itemTwo:
        ' سياسة تقوم على إنشاء سلسلة من الأحلاف والقواعد العسكرية لتطويق وعزل الإتحاد السوفييتي ومنع انتشار نفوذه وإيديولوجيته',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' توازن الرعب النووي',
    itemTwo:
        ' توازن عسكري نووي دولي منبثق من امتلاك كل من الوم أ والإتحاد س  قوة عسكرية ضاربة خاصة بعد توصل كل منهما للسلاح النووي ، تستطيع بها تدمير القوة الأخرى ، وكذا نشأت حالة من قوة الردع النووي العسكري المتبادلة ، يتعذر في ظلها على أي من الدولتين أن تحقق نصرا على الأخرى أو أن تتحداها مباشرة خوفا من التدمير المباشر',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'سياسة التكتل',
    itemTwo:
        'توجه استراتيجي تمارسه الدول التي لها مصالح وقواسم مشتركة سياسية اقتصادية عسكرية كما فعل القطبان اثناء الحرب الباردة ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'القطبية الثنائية',
    itemTwo:
        'نظام ميز العلاقات الدولية بين 1945-1989 بوجود قطبين مؤثرين على الساحة هما الو م أ والاتحاد س',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' المجال الحيوي',
    itemTwo:
        'سياسة توسعية تعني ملء المجالات الجغرافية أو استغللها إلا حين . . طبقتها النازية والفاشية وبعد الحرب ع 2 طبقت في شكل سياسة الاحتواء',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' المنظمة العالية للتجارة',
    itemTwo:
        'منظمة دولية أنشئت سنة 1995  خلفا لمنظمة - الغات GATT تعمل على وضع القواعد والقوانين التي تنظم التجارة العالمية 2004 مقرها جنيف بسويسرا ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'النظام الدولي الجديد',
    itemTwo:
        ' مفهوم برز بعد لقاء مالطا 1989 وانهيار المعسكر الشيوعي يقوم على أساس توسيع مفاهيم العولمة و الليبرالية و فرض خطة الهيمنة الأمريكية على العالم',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' المنظمات غير الحكومية ',
    itemTwo:
        'هي منظات خيرية عالمية تعرف بالمجتمع المدني موظفوها متطوعون تنشط في كافة الميادين البيئة ، حقوق الإنسان، الإغاثة ، الرعاية الصحية و الطفولة ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' مبدا جدانوف',
    itemTwo:
        '5 - 10 - 1947 نسبة إلى السياسي السوفيتي جدانوف وهو رد على مشروع مارشال وعلى اساسه تم تأسيس مكتب الإخبار الشيوعي - الكومفورم',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الكومنفورم',
    itemTwo:
        ' مكتب الإخبار الشيوعي هدفه مواجهة المشاريع الأمريكية بجمع المعلومات عنها ولذلك اعتبره الغرب مكتب للتجسس على المصالح الغربية في العالم',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' مشروع إيزنهاور',
    itemTwo:
        '1957  مشروع أمريكي برز بعد أزمة السويس يقضي بتقديم مساعدات مالية لدول الشرق الأوسط مقابل رفض للشيوعية و القبول باسرائيل .',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'البريستوريكا والغلاسنوست',
    itemTwo:
        'كلمتين روسيتين وظفها ميخائيل كورباتشوف الوصف سياسته الساعية إلى إدخال الشفافية والديمقراطية في تسيير أجهزة الدولة السوفيتية و الحزب الشيوعي ، وإعادة ترتيب البيت السوفييتي بشكل يؤمن للفرد السوفياتي حياة أفضل',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الأحادية القطبية ',
    itemTwo:
        ' نظام دولي جديد ساد العالم بعد انهيار المعسكر الشيوعي أصبحت فيه قيادة وتوجيه العلاقات الدولية والعالم للوم أ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' الشرعية الدولية ',
    itemTwo:
        ' يقصد بها الالتزام و تنفيذ القرارات الصادرة عن الهيئات الدولية كالأمم المتحدة وأجهزتها . ما يخدم مصالح الو م أ و حلفائها',
    wihda: 1,
  ),
  Mostala7(
    itemOne: ' النظام الدولي',
    itemTwo:
        'هو مجموعة المبادئ والقيم التي تسير العلاقات الدولية في مختلف المجالات كميثاق ملزم للجميع و بإشراف الهيئات والمنظمات الدولية',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'النظام الدولي الجديد',
    itemTwo:
        'مفهوم برز بعد لقاء مالطا 1989 وانهيار المعسكر الشيوعي يقوم على أساس توسيع مفاهيم العولمة و الليبرالية و فرض منطق الهيمنة الأمريكية على العالم ',
    wihda: 1,
  ),
  Mostala7(
    itemOne: 'التبشير',
    itemTwo:
        ' محاولة الأوروبين نشر المسيحية و الثقافة الغربية في مناطق مختلفة من العالم خاصة في العالم العربي والإسلامي تمهيدا للاستعمار ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الاستعمار',
    itemTwo:
        'هو السيطرة أو بسط النفوذ بوساطة دولة أو جماعة منظمة على مساحة من الأرض و على سكانها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' الاستعمار الجديد',
    itemTwo:
        ' أسلوب السيطرة السياسية و الاقتصاية و الثقافية على دولة أو مجموعة دول مع الاعتراف باستقلالها وسيادتها مبتعدا عن أساليب الاستعمار التقليدية واستخدام وسائل خاصة في تحقيق أغراضه ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' الاستعمار الاستيطاني ',
    itemTwo:
        ' وجود غرباء وسط سكان البلاد الأصليين يشعرون بالنقاء والتفوق و يمارسون إزاء السكان الأصليين شتى أنواع التمييز و ينكرون وجودهم القومي',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'التيار الثوري',
    itemTwo:
        'مجموعة الشباب المتحمس المؤمن بضرورة العمل المسلح و الثورة و هم أفراد المنظمة الخاصة و كل من يؤيد العمل المسلح',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' تصفية الاستعمار',
    itemTwo:
        'الجهود والتضحيات التي قدمتها الشعوب المستعمرة أثناء نضالها وحروبها ضد القوى الاستعمارية لاسترجاع سيادتها و تحقيق الاستقلال و حريتها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الأحزاب الوطنية',
    itemTwo:
        'وهي مجموعة التنظيمات ذات الطابع السياسي التي ظهرت في الجزائر بعد الحرب ع 1 إلى 1954 و المتشكلة في أربعة اتجاهات رئيسية هي دعاة المساواة ودعاة الإدماج، دعاة الاستقلال ،دعاة الإصلاح',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المؤتمر الاسلامي عام 1936',
    itemTwo:
        ' هو أول تجمع وطني جزائري جمع كل التيارات السياسية رغم اختلاف اتجاهاتها عقد بسبب إصدار فرنسا المشروع بلوم فيوليت . بدعوة من عبد الحميد بن باديس و الدكتور بن جلول و فرحات عباس ، و قد تم الاتفاق على تشكيل وفد عن المؤتمر ينتقل إلى باريس لتقديم مطالب الجزائرين إلى حكومة الجبهة الشعبية بباريس',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'سياسة القمع',
    itemTwo:
        ' استعمال فرنسا لاقصى وسائل التنكيل و الإبادة و التهجير والتجهيل لإخضاع و قتل روح المقاومة في الجزائريين كما حدث في سطيف و قالمة وملعب سكيكدة و استخدام الأسلحة المحرمة دوليا',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'تدويل القضية',
    itemTwo:
        'التعريف بالقضية الجزائرية في المحافل الدولية و الدعاية للثورة  لكسب حلفاء لها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الدبلوماسية',
    itemTwo:
        'جهود بذلتها الثورة بإنشاء جهاز دبلوماسي يتحرك بين العواصم و المحافل الدولية لكسب الدعم السياسي مع الثورة الجزائرية',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'مشروع سوستال',
    itemTwo:
        'نسبة إلى صاحبه جاك سوستال الوالي العام للجزائر 1955 وقد تناول جوانب إدارية واقتصادية واجتماعية وثقافية  قصد دمج الجزائريين بفرنسا',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' المكاتب العربية',
    itemTwo:
        'جهاز إداري خاص أقامته الادارة الفرنسية يهتم بشؤون الجزائريين و يهدف إلى ضرب الثورة ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المحتشدات',
    itemTwo:
        'مراكز مسيجة مغلقة و محروسة وهي إحدى الوسائل القمعية الرهيبة التي لجأت إليها فرنسا لخنق الثورة عن طريق عزل الشعب عنها وضمت قرابة 3 مليون جزائري',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'مشروع قسنطينة ',
    itemTwo:
        'هو مشروع استعماري دعائي أعلنه دغول في 3 أكتوبر 1958 بقسنطينة و تضمن بناء 200 ألف مسكن و توزيع 250 اف هكتار من الأراضي عل الجزائر و توظيفهم  وبناء المدارس خلال خمس سنوات 1959 - 1963 بهدف إفشال الثورة و فصل الشعب عنها و خلق فئة من المتغربين الجزائريين',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المد التحرري',
    itemTwo:
        'هو رد الفعل النضالي الوطني للشعوب المستعمرة ضد الاستعمار وقد امتد بين 1945 إلى 1965 في قارة افريقيا و اسيا',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'حرب التحرير',
    itemTwo:
        'الجهود العسكرية والسياسية التي شاهدتها الجزائر في الفترة الممتدة بين 1954 إلى غاية 1962 بهدف تحقيق الاستقلال واسترجاع السيادة و اخراج المحتل',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المواثيق',
    itemTwo:
        'هي مجموعة القرارات المتفق عليها و التي تأخذ صفة المبادئ والأسس مثل ميثاق الصومام ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'البرنامج',
    itemTwo:
        'هو مجموع الأطروحات و القرارات المتفق عليها و هو عبارة عن خطة عمل بأهداف وإجراءات وأجال محددة',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'البيان',
    itemTwo: 'هو تصريح كتابي يتعلق بقضية معينه مثاله بيان نوفمبر',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' الثورة التحريرية',
    itemTwo:
        'و هي فعل تحرري شامل ورد شعبي عنيف يهدف للسيادة و الاستقلال من خلال العمليات العسكرية والسياسية لجيش و جبهة التحرير',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' النشاط المسلح ',
    itemTwo:
        'هي مجموع العمليات العسكرية و الفدائية التي قام بها الثوار الجزائريون داخل وخارج الجزائر الفترة الممتدة بين 1954 - 1962 والتي انتهت بتحقيق الاستقلال',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' سياسة الاغراء',
    itemTwo:
        'سياسة الترغيب بواسطة المشاريع الاقتصادية والاجتماعية التي أقرتها فرنسا في الجزائر للقضاء على الثورة وكسب عملاء',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'حركة عدم الانحياز',
    itemTwo:
        'تنظيم سياسي تأسس في 1961 تضم الدول حديثة ا الاستقلال التي اختارت الحياد الايجابي و عدم الميل لأي من المعسكرين المتصارعين في الحرب الباردة',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'نظام اقتصادي عالمي جديد',
    itemTwo:
        'دعوة تقدمت بها الجزائر في الدورة الطارئة للأمم المتحدة ابريل 1974 تهدف إلى إعادة صياغة القواعد المنظمة للعلاقات الاقتصادية الدولية على أسس عادلة تحمي مصالح الدول المتخلفة و الدول المتقدمة على السواء ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' النظام الدولي الجديد',
    itemTwo:
        'يقصد به فرض وجه النظر الأمريكية لاليات سير العلاقات الدولية بعد انهيار المعسكر الشيوعي ونهاية الحرب الباردة 1990 بما يخدم مصالحها ومصالح حلفائها',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' حركات التحرر',
    itemTwo:
        'ظاهرة سياسية وعسكرية شهدها العالم بعد الحرب العالمية الثانية  متمثلة في كفاح نضال الشعوب المستعمرة ضد الوجود الاستعماري مما أسهم في تراجع وتصفية الاستعمار التقليدي في أغلب المستعمرات',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الجزائر جزائرية',
    itemTwo:
        'فكرة فرنسية اعلن عنها ديغول عام 1960 تنص على تقيلد مناصب الحكم في الجزائر لمن تثق فيهم الإدارة الفرنسية أي تهميش جبهة التحرير  الوطني وكل العاملين معها ',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' مخطط شال وموريس',
    itemTwo:
        'نسبة للجنرال شال و موريس  إجراءات عسكرية شاملة تهدف للقضاء على الثورة بتكثيف العمليات العسكرية الضرب وحدات الجيش و منع تواصلها مع غلق الحدود تونسية والمغربية بخطين كهرباء حراسة ألغام  لشل تحرك الثوار ووقف الدعم عنهم',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' القوة الثالثة',
    itemTwo:
        'طبقة برجوازية عميلة في الجزائر دعمتها فرنسا كبديل عن الثورة و جهازها السياسي جبهة ت و ولتغليط الراي العام العالمي',
    wihda: 2,
  ),
  Mostala7(
    itemOne: ' سلم الشجعان ',
    itemTwo:
        'مناورة سياسية و حرب نفسية أطلقها ديغول يوم 23 - 10 - 1958 تقضي باستلام الثوار وتسليم أسلحتهم مقابل ضمان حريتهم وسلامتهم وقد هدف الى إفراغ الثورة من محتواها وإظهارها إلى العالم على أنها ثورة جياع',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'المخططات الإنمائية',
    itemTwo:
        'عبارة عن برامج تنموية اقتصادية واجتماعية و ثقافية شاملة ترتكز على النهج الاشتراكي أعدتها الجزائر المستقلة لتطوير الاقتصاد الوطني والخروج محال التخلف والتبعية للخارج منها المخطط الثلاثي و الرباعي ومشاريع كبرى مثل طريق الوحدة الافريقية و السد الأخضر',
    wihda: 2,
  ),
  Mostala7(
    itemOne: 'الثورة الزراعية ',
    itemTwo:
        ' إصلاحات جذرية ادخلتها الدولة الجزائرية على القطاع الزراعي سنة 1972 تحت شعار - الأرض لمن يخدمها بهدف النهوض بالقطاع وتحقيق الاكتفاء الذاتي تم التراجع عنها بداية من سنة 1984 ',
    wihda: 2,
  ),
  Mostala7(
    //Q
    itemOne: 'التحرر الشامل',
    itemTwo:
        'هو دعم الاستقلال السياسي بالاستقلال الاقتصادي بحيث تشرف الدولة وتتحكم في ثرواتها و مواردها و في مواقفها واختياراتها الداخلية والخارجية',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'اتفاقيات الاستقلال',
    itemTwo:
        'هي تلك المعاهدات التي يتم توقيعها بين الدولة المستعمرة و بين القوى التحررية في دولة ما وفي الغالب تتضمن قيود وشروط تقرضها الدول الاستعمارية لضمان حماية مصالحها في المنطقة',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الديكتاتورية',
    itemTwo:
        ' من أشكال الحكم تكون فيه السلطة مطلقة في يد فرد ديكتاتور لا يتقيد بدستور و لا بقانون و يعمل على تقيد الحريات الأساسية -   التجمع ، التظاهر ، التغيير - كما يتميز بالتسلط و الاستبدا',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' الأنظمة الفردية',
    itemTwo:
        'هي تستمد سلطتها من فرد ووحكم في مصير الدولة و توجهاتها السياسية والاقتصادية دون العودة لشعبها و  مؤسساتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' الحرب الأهلية',
    itemTwo:
        ' هي الحروب التي تقع  داخل البلد الواحد وبين جماعات من شعبه بسبب الاختلافات العرقية والسياسية و تلعب الدول الاستعمارية دورا في إشعالها و إدامتها ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' التمييز العنصري ',
    itemTwo:
        'سياسة استعمارية تقوم على التمييز و التفضيل بسبب العرق أو اللون أو الدين في التعامل وممارسة الحقوق السياسية و الاقتصادية و الاجتماعية على قدم المساوات بين جميع السكان كما كان الحال في جنوب إفريقيا مع - نظام الابرتايد العنصري و  الحركة الصهيونية',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الحدود الموروثة',
    itemTwo:
        'حدود للدول المستعمرة سابقا التي وضعها الاستعمار و كثيرا ماتنشب حروب بين دول الجوار لانها قنابل موقوتة وضعها الاستعمار لتفجيرها وقت الحاجة',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' التعددية السياسية',
    itemTwo:
        'مشروعية تعدد القوى والآراء السياسية وحقها في التعايش والتعبير عن نفسها والمشاركة في القرار السياسي في مجتمعاتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الاستعمار التقليدي',
    itemTwo:
        ' هو القائم على أساليب الإخضاع باستخدام القوة والحملات العسكرية لتحقيق الهيمنة ونهب ثروات المستعمرات و استغلال شعوبها استغلالا مباشرا ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' الاستعمار المقنع ',
    itemTwo:
        'محاولة الدول الاستعمارية إلى إخفاء تغلغها بأقنعة جديدة منها الاتفاقيات السياسية و الاقتصادية و الثقافية و باستخدام المساعدات الإنسانية و وسائل الإعلام ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'التبعية',
    itemTwo:
        'وصف للعلاقة غير متكافئة بين الدول الإستعمارية و مستعمراتها السابقة في المجال الاقتصادي والسياسي والثقافي مما يجعلها في حالة ضعف وعجز و فاقدة لسيادتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' المنظمات العالمية',
    itemTwo:
        'هي منظمات مفتوحة في عضويتها لجميع الدول المستقلة شرط الالتزام بمواثيقها مثل منظمة الأمم المتحدة و المنظمة العالمية للتجارة و . . . ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الاستقرار السياسي',
    itemTwo:
        'حالة سياسية تتميز بها الدول الكبرى نتيجة استقرار مؤسسات الحكم فيها و التزامها بالديمقراطية بينها تعاني الدول المتخلفة من عدم استقرارها  السياسي نتيجة كثرة الصراعات على السلطة بين طوائف الشعب',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' التحرر السياسي',
    itemTwo:
        ' أهم هدف ضحت من اجله حركات التحرر وهو استرجاع الحرية و الاستقلال و إخراج قوات المستعمر و بناء دولة وطنية تحظى بالاعتراف الدولي',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'حروب الخليج',
    itemTwo:
        'من سنة 1980 إلى 1988 بين العراق وإيران الثانية : من 1990 إلى 1991 احتلال العراق للكويت وتشكل التحالف و الدولي بقيادة ال و م أ الذي أخرجه منها وفرض عليه الحصار . الثالثة : سنة 2003 و احتلال العراق من طرف ال و م أ إلى اليوم ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: ' المنظمات اليهودية',
    itemTwo:
        ' هي منظمات وهيئات داعمة للحركة الصهيونية عملت وتعمل للاستلاء على كل فلسطين وتحويلها إلى وطن قومي لليهود و تهويد مقدساتها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الحكم الذاتي',
    itemTwo:
        'تأسيس سلطة وطنية فلسطينية تمارس إشراف داخلي على الأوضاع في مدينة غزة وأريحا ثم الضفة لغربية كما نصت عليه الاتفاقية الموقعة في 13 سبتمبر 1993 بواشنطن بين منظمة التحرير الفلسطينية و الكيان الإسرائيلي',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الانتفاضة',
    itemTwo:
        ' شكل من أشكال المقاومة والتي ابتكرها الفلسطينيون ضد الوجود الإسرائيلي بداية من يوم 07 ديسمب 1985 تقوم على الاضربات و المظاهرات و المقاطعة للبضائع الإسرائيلية و المواجهة اليومية مع جيشها',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'المقاومة',
    itemTwo:
        'هي كل الأشكال التي يأخذها نظال الشعوب المستعمرة  سياسية واقتصادية وعسكرية ضد الوجود الاستعماري فهي وسيلة حركات التحرير الوطني من أجل الاستقلال و استعادة السيادة وتحرير أراضيها و تحقيق تقرير مصيرها .',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الحركة الصهيونية',
    itemTwo:
        'حركة سياسية عنصرية ظهرت سنة 1897 عمل زعماؤها على المطالبة باقامة وطن قومي لليهود',
    wihda: 3,
  ),
  Mostala7(
    itemOne: 'الكفاح المسلح ',
    itemTwo:
        'حق الشعوب المستعمرة في اللجوء لقوة للتحرر من المحتل واخراج قواته وهو حق أكدت عليه الأمم المتحدة ',
    wihda: 3,
  ),
  Mostala7(
    itemOne: '',
    itemTwo: '',
    wihda: 1,
  ),
];
